{"id":"1cimjpr","text":"So instead of making savings, they continued to spend money they didn’t have, yes that sounds very responsible. Maybe if the government had continued spending, the whole country would be in the same financial mess Birmingham is in.","sentiment_label":0}
{"id":"1d35qlg","text":"Needless story to have dragged into the election, party is rumoured to have sat on this for months too.","sentiment_label":0}
{"id":"1d3i3mt","text":"Now, in an ideal world there would be insight into why Mr James Daly thought it important to report her to the police, and what evidence he submitted which caused them to start an investigation in the first place. He was suspicious as all hell during interviews at the time, and would avoid discussing why he did what he did at all costs, even becoming quite defensive when questioned about it.","sentiment_label":0}
{"id":"1d5a8wa","text":"How did you not get mind controlled at birth though? Are you one of those free thinker\/sovereign citizens we keep hearing about?","sentiment_label":0}
{"id":"1d5l3e9","text":"Talk lately of conscription, having a store of food and water, and now drug shortages. I wonder if the writing on the wall to those in charge is that shits really going south and soon.","sentiment_label":0}
{"id":"1bd9wzg","text":"UK universities are undermining it pretty well on their own. Feels like a degree now is just another hoop to jump through to get into a shite paying job that will utilise none of it. \n\nSure, going to a prestigious university opens doors, though I suspect most of the people in those universities had a lot of doors already open.","sentiment_label":0}
{"id":"1ctxdmn","text":"This is so stupid...\nI can't believe people keep posting about this... If I crop many images and paintings out there and mirror them and put them side by side I will end up with another image specially if I turn them upside down two.","sentiment_label":0}
{"id":"1d5j92a","text":"Wow, what a disgusting country America is. Shame UK is turning into it.","sentiment_label":0}
{"id":"1cqw49x","text":"When does anything ever go right with Rishi in power? Last time I checked a massive chunk of the current government in power is either migrants or people with more money than. One person could ever need. We've been going down this \"Dark\" path for a long time now, especially with an illegal immigrant in charge of immigration. At this point I would rather have Boris back, the only thing he did wrong couldn't even be considered a petty crime.","sentiment_label":0}
{"id":"1bly5zf","text":"It suits him and he’s still handsome.","sentiment_label":1}
{"id":"1bsjjd9","text":"Ngl most of the media companies are probably owned by Zionists so no surprise there","sentiment_label":0}
{"id":"1d5bkz6","text":"wow I used to travel around Korea, Malaysia, Taiwan, Singapore, Vietnam etc in my youth and the best thing about it was that food was really cheap and amazingly tasty. \n\nThats a lot of money for a meal. Is it a tourist area?","sentiment_label":1}
{"id":"1d2y53i","text":"I can’t remember the last year that went by where water companies (and any other utility \/ service in private hands) didn’t say they needed to increase prices to invest in better infrastructure, only to see bigger dividends pay out, record profits and seemingly no improvement service. This is just years of neglect coming home to roost","sentiment_label":0}
{"id":"1d4e1pp","text":"there is no difference between the cons and labour. it's just a messaging and branding difference. \n\nWorking class are fucked. \n\nI know people on this sub are more far right than left. I am a leftist. I'd rather people voted reform than labour or conservatives. \n\nI'm going to vote green or independant. depending on how I think will get the bigger voting share. \n\nKier is an absolute dictator. He's kicked out so many MPs from the party. Diane abbott, Jeremy Corbyn kicked out from the party. Anyone left wing is gone. He's going to kick out more if he wins a landslide. I wish the left in this country were more organised and formed their own party. Workers party will only stand in a couple of constituencies.","sentiment_label":0}
{"id":"1cypi8f","text":"I'm going to 'waste' my vote on the Reform party.\nIt's the only vote that makes sense to me. \n\nCan't stand the Tories - and I shudder uncontrollably when I remember the last time Labour (who are a Tories mark2) were in power.","sentiment_label":0}
{"id":"1d5hsxf","text":">\"It's not just for LGBT+ kids, it's for everyone. Everyone should feel proud of who they are,\" they said.\n\n…”as long as they agree with me”.","sentiment_label":0}
{"id":"1d177uh","text":"Farage's concept of British values is being white and drinking pints of beer in a pub, so he's technically not wrong.","sentiment_label":0}
{"id":"1cryxda","text":"Sons a dumbass. But I don’t think any mother would be willing to give up their kid. Even though morally it would be the right thing to do, can’t imagine most mothers would be cooperative. Kid should be deported if found though","sentiment_label":0}
{"id":"1d3z6i1","text":"Good lord, Reeves! What have you done? Floating voters are easily scared by such dirty tricks. No wonder Labour lead is shrinking. It’s only a matter of time before we see the flippening.","sentiment_label":0}
{"id":"1bmy3cn","text":"As someone who's had this egg, it kinda slaps... While absolutely looking like a baked potato","sentiment_label":1}
{"id":"1cuy7ie","text":"Haha yup! [Here’s a video on it](","sentiment_label":1}
{"id":"1d1ktd2","text":"Health and safety legislation is written in blood.","sentiment_label":0}
{"id":"1bzv2q8","text":"I'd rather trust my dad who went to go get milk and never came back all those years ago than the bloody Daily Express.","sentiment_label":0}
{"id":"1boli15","text":"A soft underbelly where you can move here and claim benefits and drain the NHS. ","sentiment_label":0}
{"id":"1c68bfp","text":">Choose your water-saving goals for the next six months\n\nCheeky cunts; how about they sort out the billions of litres of leaks and stop fobbing this shit off on the consumer? It's just like when BP invented the carbon footprint.","sentiment_label":0}
{"id":"1bmandb","text":"I think Bibi and his far right political party only give the required lip service to demands that they attempt to avoid civilian casualties. They see the total elimination of HAMAS in the Gaza Strip  as an \"It's me or them\" scenario and they don't mind wiping out the Palestinians who they know hate them and are suspected of supporting HAMAS on some level. When the dust settles, Israel will be distrusted and\/or hated by all its neighbors. If the Israelis don't manage the Zionists including evangelical Christians intent on preparing for the Second Coming, Israel may indeed face an existential threat. ISIS and its ilke will be galvanized. That's the way I see it anyway.","sentiment_label":0}
{"id":"1d5kmp9","text":"He doesn’t hate them. It’s worse than that, he doesn’t care at all.","sentiment_label":0}
{"id":"1crt4ah","text":"I for one welcome our new goose overlord","sentiment_label":0}
{"id":"1by2u4l","text":"Yorkshire.  We're the only part of England culturally distinct enough to have an international football team. We are officially the wierdoes of the country, and based on the rest of you, I'm happy as Larry about it.","sentiment_label":0}
{"id":"1d4dgk9","text":"The last Gov report showed the cost to the UK of reoffending was around 18 billion a year. \n\nThe same statistics put the cost of housing a prisoner each year somewhere around 50k.\n\nIn the UK currently we have 95k people in prison.\n\nLet’s say we invest 10 of that lost 18 billion into increased prison capacity. That would house an additional 200k people. We could literally triple our prison population and still be saving money. This whole economic benefit of releasing people is a myth.\n\nPeople have this fairy tinted view that everyone can be reformed, they can’t. It’s not uncommon for prolific offenders to have anywhere from 100-300 convictions. Releasing them does nothing but bring more misery into their local communities because it is a certainty they will reoffend.\n\nThe whole myth around increased punishment isn’t a deterrent argument falls apart as well when scrutinised. How many of you would walk down the streets in the UK and smoke a joint? - Not worried about it right.. - Now how many of you would do the same in Singapore or Dubai? - Not so willing to are you, why? - Because you are shit scared of the consequences there, don’t nobody want to go to a Dubai Jail.\n\nThis country really needs to start investing in some fuck around and find out laws.","sentiment_label":0}
{"id":"1d4doel","text":"Sad to see an innocent life lost, but I do not understand the fascination for watches. Most people don’t wear one and those with the habit have moved on to smartwatches. Where is the demand to facilitate such heinous acts? Most watch shops are devoid of customers and I always wondered if they are fronts for money laundering.","sentiment_label":0}
{"id":"1d5tdx5","text":"The problem with Boris is that he has always engaged in the persona of, cheat, repeat until caught, then lie.\n\nThis kind of person should have never had the opportunity to run for higher office. Unfortunately as he's a good liar, people thought he'd be a laugh because he's like them.\n\nHe's just a complete mess and has never ever had to face the consequences of his actions, so he continues to behave like a twat and always will do.","sentiment_label":0}
{"id":"1d5kmp9","text":"I would have more respect for politicians if they actually stopped, answered the question while looking the person in the eyes instead of always trying to walk away when the shit hits the fan","sentiment_label":0}
{"id":"1cq61j2","text":"Piss off","sentiment_label":0}
{"id":"1d3dwhv","text":"It would make more sense to send Taylor Swift and her fans to the moon. Forever.\n\nMany problems solved all at once.","sentiment_label":0}
{"id":"1cp05gm","text":"Looks like a right dick head.","sentiment_label":0}
{"id":"1d38fpx","text":"I've always found this duo to be particularly odd. The way he has his sidekick 'Ash', who is never mentioned in credits, and whose only purpose seems to be a punching bag for James Whale. BIZARRE","sentiment_label":0}
{"id":"1c78sow","text":"Just laugh and move on.\n\nYou won't win with this level of stupidity.\nThey'll drag you down to their level, and beat you with experience. As the stolen saying goes.","sentiment_label":0}
{"id":"1d39vor","text":"I’m not a fan of the tories , or labour, or any of the parties really, yet to see a politician that is supporting the people rather than Their own interests or the interests of corporations or hedge fund lobbyists . \n\nLabour feels like the lesser of two evils after all this,  but do people forget how badly she came across when Corbyn was running ? \n\nShe is utterly incompetent , and at the moment if she gathers enough media traction.. which the tories will capitalise on , could cost labour the election . \n\nThis is the state of current politics , labour and conservative are essentially the parent name now , when there are effectively parties within the parties  that seemingly cannot work together . \n\nThis is going to turn out to be a shit show.\n\nThe press from labour and surrounding Diane Abbott has already been contradicting itself","sentiment_label":0}
{"id":"1bvhpf8","text":"Everything's being 'black washed' :) At least Denzil will be white I suppose?","sentiment_label":0}
{"id":"1d5vktv","text":"Lets see him put his money where his mouth is I say! I have never voted for labour, but this time I might just do it, they have been banging on about how great they are, so lets see it...","sentiment_label":0}
{"id":"1chjdl2","text":"In general I find the South has nicer towns and the North has nicer scenery. (Everywhere has nice villages)\n\nYou find pockets of \"Southern\" type towns\/cities in the north like York or Chester or Harrogate but they're not the standard, whereas in the South you find towns like that all over the place.\n\nMeanwhile in the South you find pockets of \"northern\" scenery like Dartmoor or Exmoor but again that's not the standard type of landscape in the South. Whereas that type of scenery is all across the North.","sentiment_label":1}
{"id":"1cm7oie","text":"So your saying Sadiq khan and Sajid javid and sayeda warsi and the other Muslims in government haven't got the government by the balls and are forcing them to put Africans and Muslims in five star hotels whilst white native veterans who kept us safe from afghans and Iraqis suffer on the streets? \n\nJust as much as I would happily give my taxes to Ukraine and Israel, I would also give it to put English veterans in free houses. Unfortunately our government gives our tax money to immigrants and in foreign aid to countries that hate us!!!","sentiment_label":0}
{"id":"1d45og9","text":"I could afford to go down slides if they didn't shit the bed over student fees","sentiment_label":0}
{"id":"1brcl81","text":"This knife wielding nutjob gets 3 months, meanwhile Sam Melia got 2 years for \"stickering\".\n\nI mean, some of them were quite mean stickers, clearly that's more important than someone stabbing people.\n\n","sentiment_label":0}
{"id":"1d5k5xh","text":"On today's episode of: 'People Really Will Buy Anything!'","sentiment_label":0}
{"id":"1bndxs7","text":"This is disgusting ","sentiment_label":0}
{"id":"1be2oo2","text":"Probably because it's a lot cheaper?","sentiment_label":0}
{"id":"1bfftth","text":"Well, the only POSSIBLE answer as to why they chose a particular example of why the map is not accurate over another absolutely MUST be because they are a defensive Northerner. \n\nOr not","sentiment_label":0}
{"id":"1cik0vu","text":"That's absolutely terrible, no child can cause harm, not all children from a certain ethnic or possible militarised background grows up to become a soldier of war. Some people have become Nobel Peace prize winners in the past for studies in humanity.","sentiment_label":0}
{"id":"1b2ztw8","text":"You know what? Fuck Helen mirren. What a cunt .","sentiment_label":0}
{"id":"1c7chpv","text":"FUCK YES","sentiment_label":1}
{"id":"1bxot1n","text":"Hahahaha shouldn't support genocide then. they get enough funding from zionist lobbies why do they need donations.","sentiment_label":0}
{"id":"1c8ssun","text":"And as Jews move to Israel left wing idiots take to the streets holding signs about a river and a sea they have no idea about, standing next to Islamists screaming look at all those colonialist white Jews. \n\nNon Jews like me need to start speaking up about what we’re seeing.","sentiment_label":0}
{"id":"1chjdl2","text":"Northern water is the nectar of the gods, compared to southern. You can almost feel like you can breath better, physically and emotionally. \n\nSouthern cities has always felt like visiting the centre of the nest, busy and efficient (mostly), compared to the more sleepy and calm north.","sentiment_label":1}
{"id":"1ay5nyd","text":"Yesss Lady ","sentiment_label":1}
{"id":"1d5k5xh","text":"Can’t wait till we get the sample pack of her accumulated STIs","sentiment_label":0}
{"id":"1d1pqka","text":"Average Joe with average thoughts :)\n\n> The only hypothetical part here is him being PM. This is a fairly stupid take by you.\n\n","sentiment_label":0}
{"id":"1d69mzd","text":"Sensible. Because it's very likely they won't cut it. For the same reason the Tories haven't. It would be bad for the economy and public services.\n\nSo we have this weird situation where both major parties pretend they'll cut migration, knowing full well they won't.","sentiment_label":0}
{"id":"1bp0vhr","text":"Fucked up by trying to sell the artifacts. He should have set up his own museum then when asked about the pilfered items. Declare that he's keeping them for safety as the previous owners are proven incapable of looking after them.","sentiment_label":0}
{"id":"1bnlwem","text":"Baffled how a hawkwind fan could manage to become such a racist insufferable cunt...","sentiment_label":0}
{"id":"1d1ndh0","text":"The dead look in his eyes is unnerving","sentiment_label":0}
{"id":"1cogq3r","text":"The police wouldn't want you noticing a pattern after all.","sentiment_label":0}
{"id":"1cruhr9","text":"Ok? That isn’t even relevant here","sentiment_label":0}
{"id":"1d5ls0c","text":"Lol . Always 3rd raters.\nOne chance they had, they fucked over their young supporters.","sentiment_label":0}
{"id":"1d3xp0l","text":"Like they've got money for tax cuts.  What tax do you want them to increase, or what cuts to make?","sentiment_label":0}
{"id":"1d3j6jh","text":"Have you seen how Keir runs the Labour Party? Anonymous complaint with no details comes in just before election and that’s it his career is over? Nah that’s not justice. You can keep him on the ballot, run an investigation and then have a bye-election if needed.","sentiment_label":0}
{"id":"1d325m5","text":"I don't know if it's related or not, but my grandparents were given a grant to get insulation done on their house, they went through with it and within weeks the wallpaper was noticeably wet. I think they ended up getting it torn out at their own expense.","sentiment_label":0}
{"id":"1cn4u7j","text":"I despise Cameron more, he's the reason we got all the shitty leaders that followed him, and austerity and Brexit","sentiment_label":0}
{"id":"1az6z8w","text":"When you are clearly on the wrong side, justifying your position becomes impossible. It would be like trying to justify the holocaust. This woman is pure evil. Like most capitalist politicians. Labour needs a purging. A Stalin or mao tier purge. Not some starmer shite.","sentiment_label":0}
{"id":"1d691xq","text":"This is why cyclists worry me . They are fast and heavy enough to do a lot of damage if they hit you, but aren’t insured.","sentiment_label":0}
{"id":"1d646l7","text":"I truly worry about the state of politics and society. It’s hard to see how things might be turned around.","sentiment_label":0}
{"id":"1d4d0pl","text":"Tories got rid of the police. So now, people can be the cunts they are and nothing will happen to them cause the copshop is way way understaffed","sentiment_label":0}
{"id":"1bepvuy","text":"Thank you so much for that information.","sentiment_label":1}
{"id":"1b0lvsi","text":"My government and your government are both responsible for false-flag terrorist attacks on civilians.","sentiment_label":0}
{"id":"1cuvfjf","text":" Jack Black sang Oasis' 'Champagne Supernova' on Tenacious D's UK tour.  \n\nJust love everything this man does, would love to watch a documentary about a day in his life.\n\nJust let a camera man follow him around, and get a glimpse into his world.","sentiment_label":1}
{"id":"1chgol2","text":"what's the problem? the UK has ~~presented a total lie as a fact~~ declared, by law, that Rwanda is a safe country. So making them deal with their own immigration \"crisis\", which they artificially create to distract from their own absolutely fucking appalling actions, should surely be fine. If they're being sent off to a safe third country (and also pocketing a shitload of money for Rishi Sunak's father's company) what's the harm? :)","sentiment_label":0}
{"id":"1bbbyv0","text":"That will be a pain in the arse post apocalypse.","sentiment_label":0}
{"id":"1d4q7bh","text":"So it looks like a petrol station leaked into the ground (in 2023) and it’s leaked (via a leak) into the water supply or just where the water is pumped from or something.    \nA whole lot of leaking and a whole lot of shrugging and people are drinking petrol. Lovely.","sentiment_label":0}
{"id":"1d5r159","text":"He is a grifter. He whips up support for his cause but his cause is actually his lifestyle.","sentiment_label":0}
{"id":"1c9kjse","text":"What? Pupils hate a country that doesn't give a fuck about them? How shocking.\n\nNote that it's the same in France. Go to any (public) school and you'll have many hands raised when a similar question is asked. Simply because gvts after gvts have catered for the boomers almost exclusively, asking younger generations to be just grateful. Add to that the second or third generation immigrants that couldn't integrate society and you just know the situation won't improve anytime soon. Frankly, I don't blame young people for hating a country that never loved them.\n\nEDIT: So much hate at immigrants here... No wonder so many young people feel like they don't belong if all they hear is that they are the sources of all problems. Racist people are so fucking stupid, it's insane.","sentiment_label":0}
{"id":"1bepvuy","text":"You shouldn't speak when you don't know what you're talking about.","sentiment_label":0}
{"id":"1azcah3","text":"\"It's not right that they are placing all the responsibility on parents\"\n\nThat parent can fuck off. Their child,  they gave them the phone,  they need to monitor the groups their kid is in, stop passing their responsibilities onto an already over worked educational system.","sentiment_label":0}
{"id":"1blwc70","text":"The flag itself isn't offensive but I think its rude to change the national flag of a country. Likewise, I think people would be pissed if the 3 lions badge became a Lion with x3 after it. \nSomething you just don't touch.","sentiment_label":0}
{"id":"1bvjwgb","text":"‘Man with oil and gas portfolio doesn’t like renewable energy’","sentiment_label":0}
{"id":"1cd5kfn","text":"I live in London and have spent time in Cape Town and the food wasn't remotely better? Also far less international cuisines to choose from - the \"British food being bad\" trope is getting old","sentiment_label":0}
{"id":"1bfftth","text":"Of course nothing can top London's grifty glamour, you can eat your fill and get robbed at the same damn time.\n\nMichelin Star? Nah give me like 10x steak slices instead.","sentiment_label":0}
{"id":"1bdru52","text":"Ah of course. Sunak thinks Prime Minister's Questions is where he gets to ask questions instead of answer them. Someone should inform him before I slap the bastard.\n\n\" ANSWER  A  GOD  DAMNED  QUESTION\"","sentiment_label":0}
{"id":"1cbxn9t","text":"bus drivers are a menace.","sentiment_label":0}
{"id":"1d5vktv","text":"The damage has already been done. \n\nJust take a look at the ONS data on ethnicity of various places then take a look at school students with English as second language. \n\n\"But why is this a problem, are you just raciiiist?!?!\" \n\nWould anybody be this flippent if it was an ethnic minority this was happening to? In a couple of generations the English will no longer be a majority in their own nation. \n\nI sometimes think that it's a kind of sick revenge against the British for empire, England and it's people must die for their great great grandfathers sins","sentiment_label":0}
{"id":"1c0gto1","text":"They probably mean to cut them in and kill them. You can’t be homeless if you’re dead, is probably their motto.","sentiment_label":0}
{"id":"1bmandb","text":"Feel like that’s the Swiss, seeing as it’s mostly a militia of their populace and its soul purpose is defence.\n\nMost armies are pretty shitty though, just look at French foreign legion crimes across north affrica the passed 20 years as well.","sentiment_label":0}
{"id":"1bwpntd","text":"Tbh I don't carry cash so I haven't actually seen these yet but it doesn't look right","sentiment_label":0}
{"id":"1bate8h","text":"\n\n35% of male perpetrators of paedophilia we're also victims. \n\nIt's not apples to apples, but the theme of trauma exposure to trauma giver is consistent, thus fair.\n\nJust another attempt or articulating the horror. Biden wants to send Israel another $14b I read today. That's a lot of dead kids.","sentiment_label":0}
{"id":"1d5o3mj","text":"We are desperate to see GPs and yet we have a bunch of them struggling to find employment.\n\nPerfect example of the complete mismanagement of our healthcare system.","sentiment_label":0}
{"id":"1cvwei5","text":"Wasn't this the episode narrated cheerfully by one of the Beatles as he was immured within the tunnel as the fat controller just mocked him?\n\nGood old childhood trauma","sentiment_label":0}
{"id":"1d2lemw","text":"I think we can all come together and agree that, irrespective of political inclinations, race relations and religious divides, this is a problem all of us should be worried about. \n\nI mean a love of ghosts unites everyone.","sentiment_label":0}
{"id":"1bd52ku","text":"Big words Dave. No do something about it you pigfvcking cvnt.","sentiment_label":0}
{"id":"1cypi8f","text":"As a lifelong hater of the Tories, I could not be less enthusiastic about the current prospect of a Labour government","sentiment_label":0}
{"id":"1cpcx3r","text":"Mint movie","sentiment_label":1}
{"id":"1cxyzmi","text":"Why would you follow the recipe of a country that doesn't have any culinary expertise?","sentiment_label":0}
{"id":"1d496h0","text":"It's one backpack, Michael, how much could it cost? 750 dollars?","sentiment_label":0}
{"id":"1bp7fjm","text":"Hmm, chocolate or Nigel Farage? Choices, choices ....","sentiment_label":0}
{"id":"1d69hhx","text":"Is Joe Lycett still feeding news outlets those false stories?","sentiment_label":0}
{"id":"1bcb34h","text":"That’s quality!! ","sentiment_label":1}
{"id":"1bslbqr","text":"Why would you even visit this place","sentiment_label":0}
{"id":"1c3p115","text":"As someone apparently employed by one with 0 shifts in the last 2 months I also kindly request them to stfu","sentiment_label":0}
{"id":"1d3e0zz","text":"For what it's worth, nursery alone is nearly £700 a month for two days a week, so you'll need alot more than £300 to be ok in this economy. \nReading on it's mostly a London issue. I don't live there anymore for the same reasons. \nAbsolutely no chance of ever owning a property so we left and went somewhere else..","sentiment_label":0}
{"id":"1d5ls0c","text":"I know everyone is enjoying Ed Davey's meme stunts of the last few days, but now coupled with this as their first concrete policy, is anyone else noticing how absolutely detached from reality and tone deaf the Lib Dems are?\n\nThe country is broken. Please come up with some ideas that will help and maybe worry about easier access to PL games in the next parliament once ambulance handovers and cancer wait times have been fixed.","sentiment_label":0}
{"id":"1d2hdo4","text":"I, for one,miss how un-curved our bananas have become. Back in the day,  you could rely on a certain curvature, but looking at the banana stands now, might as well be eating yellow cucumbers.","sentiment_label":0}
{"id":"1bs5y53","text":"Wait so during ramadan they post muslim trope but for Easter they just post positivity mantra. Yet we're told we don't live in a two tier society.","sentiment_label":0}
{"id":"1bibzz6","text":"Stopped buying and eating chocolate couple of years ago when all this shrinkflation started. Haven't bought a single one since. Nor will I ever again. Done wonders for my waistline and my wallet. These greedy companies can all literally fuck off now imo","sentiment_label":0}
{"id":"1d49haf","text":"And Israel wonders why they are hated. ","sentiment_label":0}
{"id":"1bk4new","text":"This is really interesting since I had no idea what different people in the UK actually prefer their tea to be like. I've always loved tea with milk and sugar but can definitely get behind without sugar too. Certainly would go with neither when it comes to green tea! ","sentiment_label":1}
{"id":"1bdssjg","text":"The idea for cube squash seems a little weird, especially with no concept on it.\n\nThe only possible way I could see it working is like OXO cubes, but that requires hot water.\n\nIf it's a condensed cube of powder with all the necessary additives, then that's just Pre-Workout and Gamer Fuel without the caffeine.","sentiment_label":0}
{"id":"1ct8tcj","text":"Sickening","sentiment_label":0}
{"id":"1cnubir","text":"They dont even get arrested mate, or they do and their on day release after stabbing someone outside maccies. Its disgusting, nothing wrong with the people that attempt to come here legally. But why is it even a question of just letting random fucking people into our first world country? The white British ethnic group remains at estimated 75% of our population. Theres already so many schemes in place to take special care for anyone whos even half black. What about us, the people who are actually British, born and bread, family histories. We are treated like shit just for existing in our own fucking country, and were not even allowed to talk about it.","sentiment_label":0}
{"id":"1bjrthf","text":"Why? The sheer incompetence of the Bank of England under the 'leadership' of this doughnut, together with the ever wrong OBR  is stunning, yet still our politicians allow them to constantly undermine our economy.","sentiment_label":0}
{"id":"1d69zbw","text":"This article is about FDI and UK’s advantages in certain fields vs European countries. Why are you posting trade stats that have nothing to do with the article?","sentiment_label":0}
{"id":"1d5o3mj","text":"Banger username.","sentiment_label":1}
{"id":"1cyaq43","text":"Best bit is the guy was paid. This bill does nothing for anyone but attempt to make it look like they’re doing something","sentiment_label":0}
{"id":"1d4h19p","text":"Really awesome to see headlines like this, given all the chaos going on in the UK right now.","sentiment_label":0}
{"id":"1cik0vu","text":"These zionazis are scum.","sentiment_label":0}
{"id":"1c7flab","text":"Such backwards ideas do not need encouraged. Extremism is a reaction to suppressive regimes, religious ideology is not required to explain it, nor should it be encouraged as a means to justify it.","sentiment_label":0}
{"id":"1bqsr48","text":"> the USA doesn’t seem to be doing too badly with their guaranteed 1st amendment rights\n\nYou realise the USA has banned talking about slavery in schools, bans talking about LGBT topics to children in most states, and is putting forward a shitload of book bans in schools? \n\nThey support \"free speech\" but their idea of protecting \"free speech\" means censoring any speech that goes against that perception.\n\nThat's all the \"Free Speech\" rightoit propaganda machine wants, for you to believe that allowing the speech of bigots somehow _doesn't_ hurt the speech of others, when history has shown OVER AND OVER AND OVER, that if you let hateful people have the microphone, then anyone they target has to shut up. \n\nYou've fallen for tory propaganda.","sentiment_label":0}
{"id":"1boli15","text":">why don’t we enjoy any of the benefits… like cheap labour and services\n\nBecause you need people who are skilled in those roles to do those roles. Contrary to what they might say, someone coming over from a less developed country probably isn’t a doctor.\n\nIf 500,000 people come in but most of those are unskilled workers, all that does it suppress wages for unskilled work and increases demand for higher skilled work (see; healthcare requirements, tradies, etc)\n\nThe difference with high population places like China is it’s local population getting local training for the local position, not someone who’s got a perhaps less than adequate education coming in and is going to work the till at Lidl.","sentiment_label":0}
{"id":"1d5j92a","text":"All bark and no bite","sentiment_label":0}
{"id":"1bfcsgr","text":"This isnt nazi germany, yet...","sentiment_label":0}
{"id":"1bame1o","text":"Down with the fr**ch","sentiment_label":0}
{"id":"1bpyn8z","text":"You think that *more* demands on landlords would be good for the vandalised rental market? \n\nThe market is fucked because of reforms. Your landlord sold and families queue to apply because renting isn't financially viable for many landlords now.\n\nBut at least the prices dropped, right? (S)","sentiment_label":0}
{"id":"1d4pqd7","text":"If Scotland is a third world nation what does that say about the 'strength of the Union' that allowed that to happen under its watch? Same for Wales, Northern Ireland and Northern England.","sentiment_label":0}
{"id":"1d4s065","text":"Even the highest profile new Tory candidate is an absolute shambles.\n\nWhat a mess they are. Not one of them can do a single thing right.","sentiment_label":0}
{"id":"1ch4w16","text":"Zionist terrorists killled about 750 British servicemen, many Palestinian policemen and civilians, many of those terrorists later became high ranking members of the Israeli government.\n\n\nWhat is happening all over the world is that history, or a warped view of it, is no longer being taught in schools and I'm a firm believer that those who don't learn from the mistakes of history will be doomed to repeat them.","sentiment_label":0}
{"id":"1c68bfp","text":"There are reasons we think Yanks are stupid, this is one more to add to the list.","sentiment_label":0}
{"id":"1cz78fd","text":"Well it's a war being commanded by an actor\/tv comedian. What do you expect? If not for massive US, UK and EU spending, they'd have succumbed by now.","sentiment_label":0}
{"id":"1bpyn8z","text":"Having just been forced to move rentals after a landlord wanted to sell the property, I can honestly say the rental market is fucked.\n\nThere is such a small pool of nice houses. Every viewing I went to, there would be families waiting outside to get in. \n\nThe fact that the Conservatives have failed to bring through any of the promised rental reforms is another nail in the coffin for me. They really do not care about the interests of people without property.","sentiment_label":0}
{"id":"1d69hhx","text":"> A prolific thief who stole 17 tubes of Pringles in a series of burglaries and shop thefts told police “once you pop, you can’t stop”.\n\nI'm suspicious.","sentiment_label":0}
{"id":"1b2ayq3","text":"They should take all the crappy tarmac off of cobbled roads.","sentiment_label":0}
{"id":"1clonsi","text":"Im impressed McConnell’s signature isn’t just mouth drool.","sentiment_label":0}
{"id":"1d4uhul","text":"Another nonsense platform about to be rendered meaningless.   \nMay as well promise free homes made of chocolate Rishi.","sentiment_label":0}
{"id":"1bh394u","text":"I’m sorry but a crime is a crime irrespective of the motives. All it says is that if you’re a white guy beating in a black guy, make sure you say absolutely nothing while you’re beating the guy black and blue, because that some how makes it better?   \n\nHate crimes are nonsensical.","sentiment_label":0}
{"id":"1byzy64","text":"Kudos to Miriam using her voice to speak up against tyranny.","sentiment_label":1}
{"id":"1czhxmd","text":"Why is this in dollars?  How the hell is that British?","sentiment_label":0}
{"id":"1d2xgmo","text":"Are you not old enough to remember how good life was during the last Labour government?  \n  \nYoung people bought avocado toast *and* houses.","sentiment_label":0}
{"id":"1by9ukv","text":"wow the world is finally getting to see the brutality of the Zionest IDF & the evil of  Israel government under zionist rule ,  but most of us knew the evil of them , the Jewish people are not ones causing this , its  not the people Palestinan either .","sentiment_label":0}
{"id":"1by2u4l","text":"West mids, if there’s anything to love about where I live it’s that there’s like a million pubs in my town. Or that we’re basically right in the middle so getting to places by train is quite easy \n\nOreyt duck","sentiment_label":1}
{"id":"1b0wddz","text":"How the UK are currently complicit in a genocide and never know how to stick their beak out of other people's countries is a major issue I'd say.","sentiment_label":0}
{"id":"1d38sr1","text":"Government should block this, or renationalise them… the problem is that our government is run by the Tories.","sentiment_label":0}
{"id":"1d5tdx5","text":"Compulsive liar, repeatedly sacked in the past from jobs in journalism and government, loads of dodgy situations and scandals he had got himself into before...\n\nYes, he was totally unfit.","sentiment_label":0}
{"id":"1bmj5p2","text":" Nope. Cannabis is only for liberal lefty woke ethnic types\/s\nBut in all seriousness, only a small percentage of the population use it, or consider its health benefits. No political party wants to waste whatever political capital they have on what is considered such a niche issue.","sentiment_label":0}
{"id":"1d5x2ir","text":"Alcohol really is a huge issue in this country","sentiment_label":0}
{"id":"1b7ffjh","text":"Atun Shei is so good and I do enjoy his lighter moments.","sentiment_label":1}
{"id":"1cmjixy","text":"Great places, thanks! Are there any scenic routes to drive through?","sentiment_label":1}
{"id":"1d3grdf","text":"A man who has tried and failed 7 times to become an MP is open to a conversation with a political party who will be lucky to make it to 2025 with more than 7 seats. Match made in incompetent heaven.","sentiment_label":0}
{"id":"1bp7fjm","text":"The NHS is failing so let's blame fat people? \n\nYeah, that take is stupid as fuck lol, blame the government that allowed it to be privatised.","sentiment_label":0}
{"id":"1cryxda","text":"I’m not shocked at all, this is not the first nor last person to think and behave this way in our country. If anything expect more of this.","sentiment_label":0}
{"id":"1d4e1pp","text":"Bollocks to you Tory Stooge.\n14 years of undelivered promises and corrupt and inept administrations. These criminal fucks are going down and will be annihilated. I'll watch with glee mf. \n@Conservatives #Proroguers #JailCummings #PPEWastage  #LateLockdown #ToryLies #ToryIncompetence #ToryCorruption #ToryBrexit #TorySleaze","sentiment_label":0}
{"id":"1c9t10g","text":"\"GROWTH....!\"\n\nStupid twat.","sentiment_label":0}
{"id":"1cypi8f","text":"You will love the current labour part then. Pretty much said they are going to do nothing and have explained exactly how they are going to do everything they are going to do.","sentiment_label":0}
{"id":"1c5ezyp","text":"A baby could have done better than her","sentiment_label":0}
{"id":"1benywu","text":"Why even change the definition of extremists? It's literally just to silent their opponents. Soon protesting will make you a terrorist","sentiment_label":0}
{"id":"1d4zore","text":"Good to know they’re spending time thinking about the important issues.","sentiment_label":0}
{"id":"1cb8gcc","text":"Absolute nonsense.","sentiment_label":0}
{"id":"1bkzrtt","text":"Custard creams and a scalding hot cuppa. Get in my fucking face hole.","sentiment_label":1}
{"id":"1bq81h2","text":"Shutup yank","sentiment_label":0}
{"id":"1cji78e","text":"Very true, but he's also a short-arsed multi-millionaire too, so I reckon the serious amount of fucks he gives will be minimal. Then the Tories will elect another prick to lead them in opposition, like mirror-opposite lanky streak of piss Jacob Rees-Mogg.","sentiment_label":0}
{"id":"1d3c1qu","text":"Wtf this is so disappointing as a Radiohead fan :(","sentiment_label":0}
{"id":"1d5yr56","text":"Well wait until you hear about what happened at the last European final to be held at Wembley. \n\nIt was a shit show. ","sentiment_label":0}
{"id":"1d4q7bh","text":"Fuck these ghouls. Ban increases in public utility prices for a year and subsidise utility companies who haven’t blown billions in dividends when they had issues like this that went unfixed. Let Thames go under. Buy it back for pennies on the pound and renationalise it.","sentiment_label":0}
{"id":"1cq4ev3","text":"All their fault, is it? \n\nNot the fault of lazy chavs who don’t want to work? Have you seen the state of some people these days? \n\nHow TF does a little political party change millions of people like that? Give them more money, yeah? ","sentiment_label":0}
{"id":"1blwc70","text":"That's not our flag! get it off.  The cross should be red. and the background white.\n\npeople are acting like If our flags have no meaning these days, which basically Insults the nation we all live in.\n\nwhat have we done to our society for this to even become a possibility? WW1 & WW2 Vets did not die for the type of society that we have made England become today, we have not made things better, we have just gone backwards in some ways.\n\nWho ever did this has wronged all of us.","sentiment_label":0}
{"id":"1c3molo","text":"This made my Sunday morning. What a twat.","sentiment_label":0}
{"id":"1cpgqtd","text":"Fucking scum just stop oil protesters. Y'know they are using senjor citizens so that they can spread the \"hey look, old people hate oil too\" and also other law enforcement won't dare to go too violent with them.","sentiment_label":0}
{"id":"1c5hfxg","text":"Why did the “conservative” government pay this family £150,000 of taxpayer funds to bring this kind of frivolous lawsuit?\n\nConservatives should be voted out forever and completely unemployable after what they have done","sentiment_label":0}
{"id":"1d5x2ir","text":"So those vouchers are completely worthless then.","sentiment_label":0}
{"id":"1bpyn8z","text":"Reform are as boomer as any party.","sentiment_label":0}
{"id":"1d38o5c","text":"I'm from the Balkans. Came in the UK 15 years ago. Never claimed any sort of benefit. Even paid for private medical for the first 4-5 years.\n\nWhen I first came here I was really amazed how easy the system was to scam... However when I actually talked to British people about it I always ended up being accused of \"racism\" and being \"bigoted\". So I quickly stopped.\n\nNow reading the comments on this I can tell that most people paint me with the same brush as the scammers. And it happens in real life too, nobody outright says it but I can tell I'm being treated as a potential fraudster once people learn I was born in the Balkans.\n\nThankfully my accent does not sound Eastern European and I actually changed my name so now people can tell I'm not originally from the UK but they usually think I'm American lol.\n\nTLDR: Actual legal self-sufficient immigrants from Eastern Europe kept warning you about all the fraudsters that were let into UK and then they stopped because they were getting branded racist...","sentiment_label":0}
{"id":"1c83gob","text":"It's not a democracy as there are no politicians or parties that care about the country, its people or the democratic process.\n\nLiterally every single serving MP is a career politician that supports corruption and the status quo to improve their own career.\n\nIf the UK was a democracy, political parties would listen to the people and stick to the manifestos that got them voted in. This never happens.\n\nIf you waste your time on politics, you are pissing into the wind as no one is listening and nobody in the government cares.\n\nIf you support any political party, you are my direct enemy as you are enabling people who are trying to make my life worse.","sentiment_label":0}
{"id":"1cbgc15","text":"it's not fear of racism, its apathy. a lot of people just don't give a shit.","sentiment_label":0}
{"id":"1d1c2rm","text":"*\"Vote for me, I'll kill your kids\"*\n\nUnusual one from Tories this year","sentiment_label":0}
{"id":"1d68acz","text":"I saw a video of this march where very young children were shouting with absolute rage “Allah, Allah, who the f*ck is Allah”. Seeing how angry these kids were was kinda scary. Obviously brainwashed with hate and racism.","sentiment_label":0}
{"id":"1d2y53i","text":"This creates an extremely bad incentive for companies to underperform to avoid fines!","sentiment_label":0}
{"id":"1cy7isi","text":"So, you're basically saying there ARE plenty of  'English' things to do and see in london..... Just gotta avoid the brown people. Thanks for clarifying top lad ","sentiment_label":0}
{"id":"1bq6tfs","text":"Don't worry everyone, the money is safe!","sentiment_label":0}
{"id":"1d3eajh","text":"Bold of you to assume that these regulations are observed consistently.","sentiment_label":0}
{"id":"1c3uw8v","text":"Nice try , Boris Johnson. We love our NHS, it just struggles to keep up with cunts like you. Fortunately, you’ve got private healthcare right? Right?","sentiment_label":0}
{"id":"1cvwflz","text":"Despite all the beauty\n\nIt’s a fact that nature is still seriously declining across the UK, a country that is already one of the most nature-depleted in the world. The data show that since 1970 UK species have declined by about 19% on average, and nearly 1 in 6 species (16.1%) are now threatened with extinction.","sentiment_label":0}
{"id":"1d5l0pg","text":"> this is what happens when you essentially hand a toddler (more than half the electorate) a harpoon (supreme transformational change).\n\n\nYes, but let's not forget most of the blame is still with the government. \n\n\n1. The referendum was not legally binding and the amount of people who came out against the result should of been cause for pause and more discussion. \n2. They did not have to trigger article 50 straight away. Could of actually worked out what Brexit might look like and present that to the public before doing anything. \n\n\nThe referendum should of been, \"ok the public want to leave EU. Let's see what that looks like\". Not \"the public want to leave the EU, let's go NOW\"","sentiment_label":0}
{"id":"1b2ayq3","text":"The quality of the Brit’s roads made them the best sailors in the world.","sentiment_label":0}
{"id":"1d5hsxf","text":"Yet thousands of parents pay for their kids to watch pantomime every Chrisrmas and nobody gives a shit.","sentiment_label":0}
{"id":"1c8szfa","text":"wiltshire is banging mate","sentiment_label":1}
{"id":"1cuktsy","text":"How have you not been to the Isle of Wight.\n\nWas there last year after the schools went back and after a washout summer the weather became nice. Handy as we were camping.\n\nOk it’s not a party island but we had great food at the pubs and found some fossils on the beaches.\n\nI’ve mentioned this before so no affiliation. The Dairyman’s Daughter pub is in the middle a craft area and is worth a look.","sentiment_label":1}
{"id":"1d3uho4","text":"Woop, common sense prevailing. Expect Reddit medical experts to have a meltdown.","sentiment_label":0}
{"id":"1cp05gm","text":"Fuck israel","sentiment_label":0}
{"id":"1d3c1qu","text":"They have some great music but they're BORING in concert and now we know that their politics suck ","sentiment_label":0}
{"id":"1d1ybzr","text":"What a pitch to old people\n\n\"Vote for me! I'll kill your grandkids!\"","sentiment_label":0}
{"id":"1d35oeh","text":"PM facilitates massive expansion of rip-off degrees\n\nPM pledges to swap rip-off degrees for apprenticeships","sentiment_label":0}
{"id":"1bibzz6","text":"It’s ridiculous they got rid of the squares, they were a big part of the chocolate.","sentiment_label":0}
{"id":"1clonsi","text":"This is the state of international law. That US Senators are writing threatening letters to an international court to get what they want. \n\nWhat an absolute shit show. Even countries at the top of the corruption index hide this shit better.","sentiment_label":0}
{"id":"1c7u8y3","text":"Should've gone with British Union of Kebabs","sentiment_label":0}
{"id":"1cjc4ta","text":">Zimbabwean Ashley Simbarashe Maparura, 34, was before Northampton Crown Court this week on weapons charges, where it was revealed that **he was recently granted leave to remain** in the UK despite the horrifying list of offences he has admitted to.\n\nClown country gonna clown. \n\nRecord legal\/illegal migration under the so-called “far right” party and our only alternatives are Neo-Blairites or open border Greens. British “democracy” in a nutshell.","sentiment_label":0}
{"id":"1btwk24","text":"Can you imagine if any other party was in government overseeing the completely unnecessary deaths of thousands upon thousands of Brits for the sake of a sub-1% increase to the staffing budget so people stop fleeing the service in droves? If they just stood back knowing this was happening and refused to lift a finger for the better part of 2 years?","sentiment_label":0}
{"id":"1bnlwem","text":"I wouldn't be surprised. However, what I mean is that they fail to do their jobs because of an external motive\/incentive. \n\nI don't know whether they're just ideologically-motivated, taking orders from the government which contradict their intended purpose, or taking monetary bribes. All I know is that they're acting as a ferry service for illegal immigrants when they should be keeping them out. That's corruption no matter how you slice it.","sentiment_label":0}
{"id":"1cq87o0","text":"Not sure what else they are supposed to do in the heat. U.K. houses are badly built, and air conditioning is prohibitively expensive. Masses of Lidos and council pools have been shut down along with libraries. We don’t build heat shelters like France did during their killer heat waves. As usual in the U.K. the govt don’t care if you live in misery or drop dead of heat stroke. So they have had to make do as best they can like a lot of people in grinding poverty in broke Britain. I won’t condemn them or sneer at them.","sentiment_label":0}
{"id":"1cgvk1o","text":"\\*Isreal\/Palestine war exists\\*\n\n\\*Countless anti-war protests around the world happen\\*\n\nAmerica: zzzzz\n\n\n\n\n\n\"Excuse me Mr President, Dave from Slough, United Kingdom has suggested that we vote for a ceasefire in Gaza\"\n\n\"HOLD THE PRESSES!! WE'LL STOP THIS WAR\" - Joe Biden, 2024","sentiment_label":0}
{"id":"1d5tdx5","text":"He turned number 10 into a fucking disco during the pandemic. Imagine if that news had got out during the pandemic, there would have been serious riots.\n\nThe level of irresponsibility to do something like that is mind boggling.\n\nThat alone should answer your question.\n\nAlso I was at Oxford at the same time as Johnson, Mogg, Cameron etc. Johnson was a celebrity there, everyone had heard of him. Not particularly unusual because public school kids all know each other before they get to Oxford. But I wasn't even in a University college and knew about him.\n\nDo a google search for Johnson and the Bullingdon club to find out some of the stuff they got up to. Theres even a feature film based on it, I think Riot Club.","sentiment_label":0}
{"id":"1d5ls0c","text":"Doesn't have to be the BBC. There are dozens of free to air TV channels these days. It's not 1982 anymore.","sentiment_label":0}
{"id":"1bprdy9","text":"This subs solution to everything is “be more right wing” when that is the cause of most of these behavioural issues, no third-spaces, parents having to be absent because nobody can fucking afford to live, teachers on minimum wage, no youth centers.\n\n“What is happening to our young people? They disrespect their elders, they disobey their parents.” - plato","sentiment_label":0}
{"id":"1d42rxt","text":"> I didn’t do it, I love you\n\nWho did it then? Your twin?","sentiment_label":0}
{"id":"1bifwdp","text":"25 years I've been driving. Can't remember the roads being this bad. People will cry funding, and yes, there are issues there on council funding which is a bigger issue. But delivery vehicles are everywhere and heavy EVs are clearly taking their toll.","sentiment_label":0}
{"id":"1d38sr1","text":"Fucking shameful. Praying a Labour government stops it in its tracks.","sentiment_label":0}
{"id":"1bsywcn","text":"Fuck Israel and fuck the international community for allowing them to get away with the evil shit they’ve been doing for years now.","sentiment_label":0}
{"id":"1cb8gcc","text":"So you're taking that as she's been punished for doing nothing wrong? She wasn't allowed to be there at all, peaceful or not, broke the law and is facing the consequences of her own actions.","sentiment_label":0}
{"id":"1d0mrs9","text":"I wish that  he'd been stood ever so slightly to his left, that would have been the perfect photo ","sentiment_label":1}
{"id":"1cncsbd","text":"We laugh at it today but this will all be set in stone given enough time. Not enough people are willing to stand up against nonsense due to cancel culture. The only small win will be the I told you so when it’s all too late.","sentiment_label":0}
{"id":"1bmlgoe","text":"It's probably because you are used to picking on people that fold over which is exactly what you get in a lot of work places.\n\nIt's easy to get promoted and excel when you bully and snake out your peers at every opportunity.\n\nI personally couldn't bully someone as I think psychologically they are cowards, but I have a strong character. Not all of us do.","sentiment_label":0}
{"id":"1bz87mw","text":"Fairly sure that a massive portion of the price of tobacco is tax. \n\nThat means if everyone quit smoking the £11bn would just have to be extracted by applying additional tax to other products. Basically the money would still disappear from local communities and be tossed into the giant pit of incompetence that we call our government.","sentiment_label":0}
{"id":"1bu7ae5","text":"It’s from the IEA (institute of economic affairs) it’s the oldest UK right wing “think tank” - and that’s in a crowded field \n\nIt’s one of many such organisations that’s set up as a propaganda outlet to manufacture consent for horrible austerity & privatisation policies.","sentiment_label":0}
{"id":"1d1ndh0","text":"How can I absolutely make sure I have no chance of getting elected ?\n\nGot it ! I’ll introduce a policy that everybody thinks as absolute madness, hang on I’ve already done that with Rwanda hmmm\n\nAh ha National service perfect ","sentiment_label":0}
{"id":"1d3yn7z","text":"the weather was pretty bad, rain showers etc, maybe they slipped as you say   so sad. thoughts and condolences to family and friends","sentiment_label":0}
{"id":"1c2qi7x","text":"Beans **ON** toast you utter muppet","sentiment_label":0}
{"id":"1bndxs7","text":"I hate them so much. Free Palestinians from these monsters","sentiment_label":0}
{"id":"1d4z7k4","text":"So what quack medicine do you think they'll promote instead? They've done bleach & horse medicine already ...","sentiment_label":0}
{"id":"1boli15","text":"There's a gaggle of 12 Albanian delivery drivers at my local McDonald's that seem to be having a whale of a time here, contributing next to diddly squit and aggressive to the staff every day. Might go ask what they think of this.","sentiment_label":0}
{"id":"1cb8gcc","text":"Cheerful fellow aren’t you.","sentiment_label":0}
{"id":"1co1nxa","text":"He's the only one who can bring back CEEFAX in all its glory, I'm in for Count Binface!","sentiment_label":1}
{"id":"1d691xq","text":"I have never been more thankful that r\/unitedkingdom doesn't represent the general populace. What a heartless, disgusting, racist fucking shithole this sub has become.","sentiment_label":0}
{"id":"1cpegjm","text":"I love super nintendo chalmers!","sentiment_label":1}
{"id":"1csd34p","text":"Quite frankly it is no surprise that the UK is a failing empire that is basically a vassal of it's former colony. [One day the UK will be American territory](","sentiment_label":0}
{"id":"1d45m83","text":"Good. It's absolutely fucking absurd that Shaheen could get blocked over a series of entirely innocuous tweets, a number of them from before she was even a Labour member, while someone like Luke Akehurst (who only a couple of months ago was spreading conspiracy theories about Palestinian 'crisis actors' and claiming the entire UN was anti-semitic) could be parachuted into a safe seat. It's crystal clear this is an entirely ideological decision.","sentiment_label":0}
{"id":"1b27yrw","text":"[Looks good](","sentiment_label":1}
{"id":"1cu392q","text":"Supremely cringe worthy","sentiment_label":0}
{"id":"1d679qy","text":"Before all the inevitable \"bUt cHiNA!\" posts that always seem to turn up, this is about air pollution, not climate change.","sentiment_label":0}
{"id":"1d47cc5","text":"A good economic policy from Reform UK. Has Hell frozen over?","sentiment_label":0}
{"id":"1cx515f","text":"***Housebuilders:*** We've built these houses with excellent insulation for the winter.\n\n***UK public:*** So they've got air-con for the summer?\n\n***Housebuilders:*** ......","sentiment_label":0}
{"id":"1bc6b1x","text":"Basically trying to stop free speech and trying to do what's best for them","sentiment_label":0}
{"id":"1cnd2md","text":"The internet has ruined everything.","sentiment_label":0}
{"id":"1ay5nyd","text":">Good for her, the British establishment is a fucking disgrace\n\nTrue Words Never Been Spoken...\n\nLots of reasons why we are failing. Because our MPs...","sentiment_label":0}
{"id":"1box4bk","text":"Imagine being such a fucking dumbass that you post yourself vandalising a mural on Instagram","sentiment_label":0}
{"id":"1d5vktv","text":"The damage has already been done. \n\nJust take a look at the ONS data on ethnicity of various places then take a look at school students with English as second language. \n\n\"But why is this a problem, are you just raciiiist?!?!\" \n\nWould anybody be this flippent if it was an ethnic minority this was happening to? In a couple of generations the English will no longer be a majority in their own nation. \n\nI sometimes think that it's a kind of sick revenge against the British for empire, England and it's people must die for their great great grandfathers sins","sentiment_label":0}
{"id":"1d3a7po","text":"TIL not wanting to waste money on transport, increase emissions by travelling and wanting a better work life balance means I need to grow up… \n\nIf you’re working a desk job it makes no difference whether you sit on your ass in an office building or in your home office. One saves people money and is better for the environment the other wastes hours a day commuting that you could be spending relaxing.","sentiment_label":0}
{"id":"1bbj3fp","text":"At least we have the lowest drive & motivation to do whatever it was I was gonna write a sentence about.","sentiment_label":0}
{"id":"1d1twc4","text":"I do believe that the British military needs extra funding and more manpower incase of a potential war against Russia or China but conscription is a fucking stupid idea. We need to keep the military a purely professional and voluntary affair.","sentiment_label":0}
{"id":"1cp05gm","text":"Every time Israel is held accountable or put in the spotlight for their actions towards Palestine, they throw tantrums like this.... it’s horribly childish…","sentiment_label":0}
{"id":"1d2o5zd","text":"“Oh yeah it’s a safe zone, don’t worry about it..”\n\n*proceeds to bomb said safe zone*\n\nCan people stop preventing the ICC from sending Netanyahu a big “Stop it or get arrested” notice?","sentiment_label":0}
{"id":"1d5u00b","text":"That's because they have closed so many units and places they went on to from hospital, not getting the mental health support in hospital but not getting the well enough to go home \nIts way way worse than you can ever imagine,really ill people with no place to go with weeks wait for one place 200miles away","sentiment_label":0}
{"id":"1cqw49x","text":"We need to have him out and sort the boarders ourselves and all the foreigners, stop giving them everything they want and boot them all out they should not be here and we don't want them here.","sentiment_label":0}
{"id":"1d37ath","text":"Agrivoltaics is the answer. However, that land and soil is going to be preserved for another 50-100 years and saved from erosion. \n\nIf you don't know what I'm talking about, go and ask farmers in the Fens, how much black soil they have left.","sentiment_label":1}
{"id":"1bnn6h7","text":"gotta say mate, saying \"Hitler wanted it as a capital\" is not necessarily a positive.","sentiment_label":0}
{"id":"1bif54z","text":">What the fuck are they playing at?\n\nDestroying the NHS and then say \"you see? We told you it didn't work!\". Then privatize healthcare for good.","sentiment_label":0}
{"id":"1cu210j","text":"They don’t need more tax. They need better management of the funds. Some absolute ridiculous wastes of money. NHS is so bloated with crap systems and middle managers. Needs a reboot from bottom up","sentiment_label":0}
{"id":"1d5jgvb","text":"What a morally bankrupt company they are. Probably giving themselves and their mates one last payout before they all get the boot. \n\nThere needs to be far stricter rules and higher accountability for executives who run these companies into the ground, then watch the sewage issues disappear over night.","sentiment_label":0}
{"id":"1d3xlr8","text":"So basically she has been barred from standing for liking a tweet stating the very obviously true fact that Israel has active and often professional lobbyists who work to drive vocal critics of Israel from positions of influence. \n\nAnd this has happened on the same day that Labour parachute someone who is literally the director of pro-Israel lobbying group into a safe seat. \n\nExtremely on the nose from Labour","sentiment_label":0}
{"id":"1cs59ou","text":"Imagine cheating at eurovision and STILL LOSING that is so embarassing lol","sentiment_label":0}
{"id":"1cxvqxm","text":"Low IQ….fail to understand what’s going on….blame Brexit…. or the immigrants!","sentiment_label":0}
{"id":"1d0cxo0","text":"This assumes that in a world without Covid Boris wouldn't have found a different massive scandal to walk into.","sentiment_label":0}
{"id":"1d4b2s4","text":"The most frustrating part is just the bare faced lying. Stop lying and just admit it and move on. \n\nAdmit it, you lose the voters who won’t accept it (I for one) and you’ll keep the voters that agree with what you’re doing.","sentiment_label":0}
{"id":"1bwgrlq","text":"Yep. Not to mentions the privatised water companies pissing all their revenues out as dividends for pension funds in Canada and Dubai rather than reinvesting it in local infrastructure. Resulting in higher costs for customers.","sentiment_label":0}
{"id":"1cys01q","text":"Charge higher fees then. I hate the argument that the foreign people paying more is why our country has universities. We had universities long before they were here, and it used to work. We generated world class thinkers, scientists, workers, and inventors. I feel like there is a middle ground between only Lords and higher class going to uni like in the past, and millions of people getting stupid degrees in useless shit that we all have to pay for. \n\nLet's dial it back a bit towards teaching topics that require the university degree to perform. Then move out towards degrees that help with critical thinking and abstract thought, which can still help with generating ideas and new ways of working.\n\nIf money and spaces are so limited, we need to go back to using universities as a step into future work, not just a standard thing that everyone does before they get an unrelated job. That might get spending under control.","sentiment_label":0}
{"id":"1b9h8by","text":"Nice! There’s a legendary chippy (Clayton Street Chippy) in Newcastle that used to sell cigs and painkillers. They know their customers. ","sentiment_label":1}
{"id":"1d41r44","text":"Where do you get deliberate fraud? It's clearly her fault but no reason to believe it was deliberate","sentiment_label":0}
{"id":"1d430lz","text":"Love how the pro-tory papers are flooding these kinds of stories now. The BBC is absolutely full of it today.","sentiment_label":0}
{"id":"1cntrsl","text":"**She's still a predator who should face the same punishment a man would, a short stint in prison before the inmates get their hands on her**","sentiment_label":0}
{"id":"1cnn7zk","text":"Yeah and it’s only going to get worse my friend.","sentiment_label":0}
{"id":"1bnfpur","text":"I see a silly young Muslim girl who was brainwashed by radical Islam.\nHow many 15 year old girls do you know who are easily led?\nIt’s disgraceful that the UK has left her stateless. \nGive her back her passport and if she has charges to face in the Uk then let her face them","sentiment_label":0}
{"id":"1d64og0","text":">We all be fucking\n\nI see you have forgotten you are posting on reddit where everyone is a virgin.","sentiment_label":0}
{"id":"1d5wzpn","text":"\"With UK airports missing the June deadline for scanners and others with awaiting regulatory approval, passenger confusion reigns\"\n\nThe UK in a nutshell...","sentiment_label":0}
{"id":"1d35u3k","text":"More homes in London basically translates to more ugly as sin high rise money laundering scams where 90% will be completely unaffordable to the average Joe anyway and owned by offshore companies wanting to hide money in the UK. Articles like this always talk about building more as though that's the only thing that matters. How about building afforable or decent houses that people actually want to live in? Houses in the last twenty years, for the overwhelming majority, look like they were designed by an architect who graduated with a first in Lego and hates everyone who lives in anything they build.","sentiment_label":0}
{"id":"1d3zfn4","text":">The other one who said the commission- does he expect brokers to work for free? \n\nNo one expects the broker to work for free. But you don't need a PhD in behavioural economics to understand that, if a service is chosen by a party which not only doesn't pay the bill, but gets a cut, then the result will be inflated prices.\n\nThe problem here is not that the broker gets a commission - it is that insurance commissions are shared between brokers and managing agents\/freeholders. But the bill is paid by the leaseholders.\n\nThis creates an incentive to choose the more expensive policy, if it pays a higher commission.\n\n  \nAnd what can the leaseholders do? Realistically, suck it up.","sentiment_label":0}
{"id":"1bn9s9s","text":"Our housing is expensive and scarce. Our food security is dangerous. Our energy is teetering on the edge. We're massively overpopulated.\n\nBut don't bring up the fact that immigration is responsible for most of these problems.","sentiment_label":0}
{"id":"1coreid","text":"I'm nearly 50, and I was taught in school kilos for weights and meters for lengths. Yes miles are on my car, but so are the signs so what can I do about it? For smaller sizes it's metric, and unlike the Yanks, I can use either. \n\nI'm happy with metric though, it's so much easier to use. 100ml of water is also 100g in weight. How simple do you need it and dealing with fractions of it?\n\nI don't criticise the Yanks though- I just pity them.","sentiment_label":0}
{"id":"1brcl81","text":"If you think it's bad now, wait until Labour get in. They have never been tough on crime","sentiment_label":0}
{"id":"1bd9wzg","text":"More racist bollox from the tories","sentiment_label":0}
{"id":"1b2whi8","text":"Sick, evil people","sentiment_label":0}
{"id":"1bn9s9s","text":"If government don’t take urgent action to fix this now it will literally destroy our economy. Cost of mortgage payments and rent will become so high any kind of sustained economic growth will become impossible. And yet Labour seem to be as complacent about it as the Tories have been.","sentiment_label":0}
{"id":"1ctc9uf","text":"Exactly she is witholding information about serious crimes and broadcasting it. Either go to the police and let the victims be the ones to tell the police they dont want to persue it or step down. This is really scummy behaviour. Why the hell would she broadcast something like this? Is it for her own publicity? If so this isnt someone i want anywhere near a position of power.","sentiment_label":0}
{"id":"1d3awg5","text":"I was on a canal boat near a bridge just like that on a clear night. Moon was so bright I could read a book at near midnight & the water was mill pond, so the bridge was perfectly reflected, summertime too.","sentiment_label":1}
{"id":"1d38sr1","text":"Looking forward to the new revenue making opportunities now that the post is owned by a privately owned profit driven foreign entity. How about:\n\n* Inserting advertisments into my letters so now I need to untangle everything from within a Domino's leaflet. Oops, I've been made redundant, but at least I'm getting 10% off my next extra large Hawaiian.","sentiment_label":0}
{"id":"1bsbf0r","text":"Cunts.","sentiment_label":0}
{"id":"1c5re71","text":"Not anymore. If you want a controlled migration system or want woman to play against some in sports then your effectively far right these days.","sentiment_label":0}
{"id":"1d1ybzr","text":"I doubt sunak’s kids are gonna go into military","sentiment_label":0}
{"id":"1d646l7","text":"Okay I was genuinely confused because the article conflates UK political terminology and USA terminology in weird ways.  \n\n\nUK Republicans (Oh hey fuck that's me I'm an anti-royalist... but I sure as hell don't support Donald trump why would other republicans do that usually were more socially progressive.)  \n\n\nUK conservatives (No that's the opposite of a republican here in the UK.)","sentiment_label":0}
{"id":"1d1c2rm","text":"I don't fancy national service when the entire world is a powder casket, thanks tho Rishi","sentiment_label":0}
{"id":"1d5vktv","text":"Anyone who believes this is living in cloud cuckoo land","sentiment_label":0}
{"id":"1d4b2s4","text":"These jokers aren’t even in power and already falling apart.","sentiment_label":0}
{"id":"1d1dypl","text":"I broke out laughing at this, genuinely couldn't help myself.\n\nI fix phones as a hobbie but fuck anything with moving parts, you go from 5 simple failure points to hundreds that become potential disaster if fixed wrong.","sentiment_label":1}
{"id":"1d06vir","text":"Will she be going back to advocating for Paedophiles again ? !","sentiment_label":0}
{"id":"1cyc5jr","text":"I was lucky enough to have the sun come out for a couple hours, still very windy though!","sentiment_label":1}
{"id":"1d2ttox","text":"Fuck off, Nimarata!","sentiment_label":0}
{"id":"1bka6ay","text":"The main question is what's going on with the headline? It's like a toddler wrote it... Completely inappropriate emoji combined with 'scary' in quotes... I mean I'm sure it would be terrifying if that happened.","sentiment_label":0}
{"id":"1d5jecs","text":"It depends on how you classify left and right.\n\nWe're had Tories so long that what classifies as left is so skewed.\n\nAlso, in these times we need a lot more 'left' policies. Controlling housing, making taking over private services like trains, supporting the people, taxing profiteering from corporations.\nThese kinds of things have gone out of control lately and need to be reigned in, so I'm that sense I think most people support this kind of stuff.\n\nStarmers policies would be considered right wing years ago...","sentiment_label":0}
{"id":"1c02ewt","text":"There’s a place in Kent called “Ugly”, and I always joked that they had an “Ugly Women’s Institute” (they didn’t: they let everyone down by calling it “Ugly Village Women’s Institute”).\n\nI wonder if that village in Sussex went ahead and shamelessly had a “Loose Bottom Women’s Institute”?","sentiment_label":1}
{"id":"1cn4u7j","text":"Fishi Ballsak found the magic money tree didn’t he? \n\nEdit… I can’t type ","sentiment_label":0}
{"id":"1d4z7k4","text":"I work in childhood cancer research and we've known for decades that this would be the way forward. Making such vaccines is very hard, however. What I'd be most interested in seeing the data of the short and long-term side effects of the vaccines. Current immunotherapies can be very lethal so hopefully this is a big kinder to the patient.","sentiment_label":0}
{"id":"1d5x3ph","text":"Seems we’ve got the American brain rot where everyone sees themselves as becoming “the rich”. \n\nNo one wants to tax your piddling little salary. What needs taxing are the rich - the actual rich. The type of rich where your tax rate is 0% because your legal team gives you specific instructions about which loopholes to squeeze through and which offshore tax haven to use.\n\nWe don’t have a trickle down economy - we have a vacuum up economy. The rich get perpetually richer, the money isn’t being cycled, it’s being hoarded. Unless that stops then we can expect nothing but the poor becoming poorer and the rich getting richer.","sentiment_label":0}
{"id":"1by6vom","text":"Honestly, I don't care where you are from as long as you're a good human. It's great when you have somebody who comes from a different life, has a different culture AND they are nice, you can learn so much from them. I always try to get people from different countries to teach me to cook something from their place.. I have so many dishes I can whip up from doing this for other English people who have never tried that sort of food and the majority of the time it goes down well.","sentiment_label":1}
{"id":"1d5r159","text":"I want off this timeline. This country is a fucking shambles. ","sentiment_label":0}
{"id":"1bh394u","text":"Yes, you are defending the criminals, you racist shitbag. You're trying to deflect from this incident by whining on about conveniently unspecified supposed incidents when \"it's the other way round\". Fuck off with that shit.","sentiment_label":0}
{"id":"1ct8tcj","text":"thats a fucking hallway","sentiment_label":0}
{"id":"1bacu7m","text":"15 years of Tories and the sunlit uplands of brexit will do that.","sentiment_label":0}
{"id":"1ccr2x0","text":"It’s a shame that that’s the case across folk music in general- it needs an injection of young interest or much of the folk tradition will die out. ","sentiment_label":0}
{"id":"1atys09","text":"world leaders kept encouraging and enabling israel even when people said this wasn’t a proportional response or that it would end poorly for palestine. we knew israel was a monster and world leaders shouldn’t get into bed with them…\n\nhere we are months later and israel has shown it’s full of hate and murder with the goal of occupying all of gaza.\n\nnow they’re being bit in the arse and realising how what a moral stain this is and they’re back-pedalling like crazy. \n\nremember this is the same cunt who said palestine could only exist with israel’s permission and then 3 days later say palestine has a right to statehood","sentiment_label":0}
{"id":"1cede54","text":"Useless cunt ","sentiment_label":0}
{"id":"1ck8hk4","text":"That medieval \"Wie knowwww\" lady is an absolute diamond she is!  ","sentiment_label":1}
{"id":"1cj2ydy","text":"\"No it's not that you don't like us, people didn't have any photo ID so they couldn't vote for us like they wanted it to..\nAlso the last time Boris was doing really well from the COVID bounce so *naturally* we lost some votes, totally expected all normal, we know you still love us and the boats and the high costs of living and scandals are mere bumps in the road, but it's normal and all totally expected.. we may swap out another prime minister next week but that's completely unrelated!\"","sentiment_label":0}
{"id":"1d2xgmo","text":"amazing logic this","sentiment_label":0}
{"id":"1bqsr48","text":"The whole concept of “hate speech” is Orwellian and goes against the very tenets of liberalism, unless someone is making direct threats then they should not be prosecuted in any way for what they say, not only is it morally wrong to criminalise speech, but it is also foolish from an intellectual and humanitarian standpoint, ideas should be fought with ideas, that is the cornerstone of a liberal democracy and it’s the best way we can help people change, its using a carrot rather than a stick.  Who decides what is considered hateful, politicians with their own agendas who are bought and paid for, a corrupt, unaccountable and unelected civil service, or strange pressure groups that are bank-rolled by big business and shady individuals. That is a very slippery slope to descend, their have been cases where comedians and writers have been prosecuted for simply making a joke or publishing a work, their was a case recently were a man was arrested for placing stickers on lamp posts, again regardless as to how distasteful you find their statements and views, it’s morally objectionable that people should be thrown in prison for simply opening their mouths and expressing an opinion. The most successful country on earth, the USA doesn’t seem to be doing too badly with their guaranteed 1st amendment rights, we’re increasingly seeing western “democracies” become more and more like 1984 as politicians try to cover their own failings with questionable legislation rather than address problems of their own making, I wouldn’t be surprised if parliament rename themselves big brother HQ soon!","sentiment_label":0}
{"id":"1d3z6i1","text":"Five more weeks and all of this stupid charade of the Telegraph, Express and Mail finding bullshit, convaluted ways of trying to defend the Tory party can stop","sentiment_label":0}
{"id":"1d1pqka","text":"Kid Starver would ask Netanyahu if he needs another [British drone to cover Gaza]( and he would apologize profusely for how the media mentioned the [Israeli bombing of British doctors]( in passing that one time.\n\nAlso\n\n\n\nSir. Tel Aviv Keith is planning on putting a pro-Israeli lobbyist in the position of unelected minister of defense.\n\nReminder that WIKILEAKS exposed her as a CIA asset and she worked **against** labour and pushed out an anti-racist  journalist for exposing her.\n\nI have a more colourful version of what Kid Starver would say to Netanyahu but I don't want to get banned off of reddit.","sentiment_label":0}
{"id":"1crm6ju","text":"It’s a weird piece. Miscarriages of justice have and continue to happen, I’m sure. This reeks of amateur investigative journalism that’s trying to look like a serious challenge to the outcome of a trial. Problematic to say the least.","sentiment_label":0}
{"id":"1d57y5r","text":"Do you want to be able to create fire and relax by it's warmth? Something hominids have done for nearly half a million years.\n\nYes? Well fuck you apparently...","sentiment_label":0}
{"id":"1d1ybzr","text":"The lollipop guild are bigger than the PM","sentiment_label":0}
{"id":"1d38fpx","text":"I stopped as soon as he derailed her first comment with “getting very violent” and set it all off. I can’t listen to that btec Piers Morgan shit, throwing fuel on the fire straight away and interrupting a valid point by making stupid arguments that aren’t relevant.","sentiment_label":0}
{"id":"1btl5lf","text":"There doesn't seem to be much 'indiscriminate killing' going on in this particular case...it was deliberate, targetted and they used murder and slaughter as a means to deter other actual Human beings from trying to help those poor people being systematically slaughtered in Gaza.\n\nNot indiscriminate at all.","sentiment_label":0}
{"id":"1c3uw8v","text":"If you think the NHS is bad just wait until you see what private healthcare does.","sentiment_label":0}
{"id":"1d5osrx","text":"I feel like they are just making shit up now, announcing it without any real thought or intention to follow through.\n\nBasically throwing anything at the “election” wall to see what sticks. \n\nDon’t believe a word they say. ","sentiment_label":0}
{"id":"1c3molo","text":"This guy needs to learn ASAP that being polite and friendly on the surface doesn't excuse otherwise abhorrent views held in private. Serial killers are often incredibly charming individuals on the surface as that's how they're able to get away with it for prolonged periods of time, would you still stay friends with a serial killer after learning they bodied 20 people just because they've been nice to you up until then?\n\nNow also consider the fact that you can measure the impact of a Conservative government in body bags.","sentiment_label":0}
{"id":"1d5hmp6","text":"so I'm guessing it's just overgrown now, she doesn't need the money. She has money now, so she stopped helping anybody else.","sentiment_label":0}
{"id":"1chz835","text":"Grey, depressing, endless concrete but there is a country side if you can find it. Getting access to it though, without a farmer chasing you is another matter. Theres not much to attract people other than the university's. If it wasn't for them I don't think anyone would go to Leicester. No one really goes there on purpose. There is a space museum but its pretty meh. Thats probably the best description of the place, meh. \n\nLately its being over run by immigrants, you'll find muslim preachers in the city center trying to convert people.","sentiment_label":0}
{"id":"1co1nxa","text":"Got my vote for London mayor, I want a recount","sentiment_label":0}
{"id":"1d45og9","text":"I've seen so many \"Ed Davey does X\" news stories, from watersides to moving a big clock. I still haven't the first clue where he stands on any issue","sentiment_label":0}
{"id":"1crxfdx","text":"Stfu. If we need to plug any labour shortages, it’s better that they’re from EU nations.\n\nNothing wrong with that, just like Singapore prioritises Chinese immigrants over others. Migration is one topic all native Europeans have common ground on.","sentiment_label":0}
{"id":"1d569vw","text":"I’m shocked that we even have to debate this. Immigrants with these views are very open about it. ","sentiment_label":0}
{"id":"1ayq5ew","text":"Nah, they can go fuck themselves.","sentiment_label":0}
{"id":"1bd9wzg","text":"Nothing this guy says is worth listening to.","sentiment_label":0}
{"id":"1ckr51r","text":"He isn’t that bad…as long as the only person you’re comparing him to is a deep void instead of morals and competence…oh wait, nevermind","sentiment_label":0}
{"id":"1bj9hi3","text":"Zionazis are the scum of the earth.","sentiment_label":0}
{"id":"1d4ta3s","text":"Cement in a rent-seeking gerontocracy in order to buy the geriatrics' vote.\n\nWho could have possibly predicted that it would be an economic disaster?","sentiment_label":0}
{"id":"1boao8a","text":"I respect that man I do the same even though I love sun pat, all about that extra 4% peanuts and none of the additives","sentiment_label":1}
{"id":"1bzv2q8","text":"So we'll be like a pub lasagne? Parts ice cold somrle parts too hot.","sentiment_label":0}
{"id":"1d1ndh0","text":"Tories have 2 months left until it’s 1997 all over again.","sentiment_label":0}
{"id":"1d06vir","text":"There is a certain amount of irony in criticising an organisation previously infiltrated by paedophiles on Reddit of all places.","sentiment_label":0}
{"id":"1d5osrx","text":"Haven't we already heard this. Their pledges mean shit.","sentiment_label":0}
{"id":"1d3e0zz","text":"She should leave the country, go to Sudan, get citizenship there, then come back to the UK as a migrant. Then she’ll be given housing and a stipend. She could easily have 12 children and not have to work.","sentiment_label":0}
{"id":"1baofai","text":"Always found it a massively weird plotline in that show - she's supposed to have picked up a Southern working class accent from a James Bond film","sentiment_label":0}
{"id":"1d5ysl2","text":"Hmmm it’s almost like the tories are cynically coming up with empty promises and policies that directly appeal to your gran and her generation.","sentiment_label":0}
{"id":"1d5h1jm","text":"Our ten year old 3 door is still going strong for our family of 4, but it’s always been hard work.","sentiment_label":0}
{"id":"1d4ph5t","text":"I thought it was death for a first-time offender?","sentiment_label":0}
{"id":"1c2m9g9","text":"You really think that your votes making difference? ROFL. I lived in the UK for 21 years but still don't have a right to vote in general elections as do not have British Citizenship but I recently found out that you still vote with a PENCIL  in general elections OMG. I was told it's an old tradition . In my opinion you can erase any vote so easily at every polling station across the country if you have \"right\" people there who might be bribed let's say .","sentiment_label":0}
{"id":"1d5or7g","text":"If you put a far lefty and a far right in front of each other, they will start calling names... What breaking news! This idiot even paid 100 pounds for the honor...","sentiment_label":0}
{"id":"1d0mrs9","text":"That loaf has more chance of winning election","sentiment_label":0}
{"id":"1d5maxb","text":"perfect, now we just need to get more people motivated to join the armed forces and make it a fulfilling career and something that people can take long learned skills back to civilian life.\n\nand.... it doesn't involve the Tories conscripting teenagers.\n\nI recently watched Amazon's Blue Angels series and was just blown away with the support of the US military. America i think has learned alot from their recent past wars and starting to really support members of their armed forces.","sentiment_label":1}
{"id":"1c3uw8v","text":"....I'm sure the attempts to run it like a business since the 80s haven't damaged its efficacy.....\n\n\"It should be reformed\"\n\nChrist. What an idea. I'm glad you didn't just throw that in there with zero suggestions as to how it would be structured and funded. \n\n\"Bad thing is bad\"\n\nEdit 1: it's not My job to fix it. \n\nNo, but until you suggest how to fix it, suggesting fixing it is pointless. \n\n*\"Some third world countries have better free health care than us\"*\n\nThis is the point where I call the comment moronic and move the fuck on....","sentiment_label":0}
{"id":"1bvhpf8","text":"What a dipstick!","sentiment_label":0}
{"id":"1c5hfxg","text":"Simple, scrap all \"faith\" schools and make all of them secular.\n\nEstablishments that segragate an ddivide societies based on religion have no place in a modern world.  Catholics here, CofE there, other Potestants there, Muslims somewhere else, Jewish children in their own schools etc... I can not believe that this is tolerated in today's world after literally thousands of years of experience showing us what religion does to inflame and instigate grief, ignorance and violence.\n\nIf your religion is so important to you then send you children to after school classes.  Your beliefs should not impinge on my freedom to be educated undisturbed, on teachers' abilities to teach or on schools' abilities to teach.  Why should 90% of society move over every time someone says their \"faith\" means they need to interrupt?  If every religious minority did this society would simply grind to a halt.  Civilised society depends on everyone compromising in the face of facts not beliefs.  Your beliefs doe not trump my facts.\n\nFrance has it right.","sentiment_label":0}
{"id":"1d4sb4p","text":"I’m getting tired of this headline. Maybe stop allowing so many people in the country? Maybe then we start hitting targets.","sentiment_label":0}
{"id":"1d5k5xh","text":"Can’t wait till we get the sample pack of her accumulated STIs","sentiment_label":0}
{"id":"1cqw49x","text":"We’re already in a dangerous era man","sentiment_label":0}
{"id":"1bh394u","text":"\"I'm not defending the criminals, I just want your attention to focus elsewhere, because they're white\"","sentiment_label":0}
{"id":"1cdhbxz","text":"Yes white people were created in Norway and there they stayed until the Vikings.","sentiment_label":0}
{"id":"1bhqrbb","text":"He's nicknamed \"The Caterpillar\" because he is a total backhoe loader.","sentiment_label":0}
{"id":"1d4rmlq","text":"Fucking madness.. this country is a laughing stock","sentiment_label":0}
{"id":"1d5wzpn","text":"\"With UK airports missing the June deadline for scanners and others with awaiting regulatory approval, passenger confusion reigns\"\n\nThe UK in a nutshell...","sentiment_label":0}
{"id":"1d69mzd","text":"As expected, it will be an utterly token amount if it happens at all.","sentiment_label":0}
{"id":"1brcl81","text":"To be fair, he was brought to justice, which patted him on the head with a \"there, there, try harder next time\" and sent him skipping on his merry fucking way so he could try harder to murder someone. \n\n\nThe laws aren't designed to keep people like that under control any more. They're just here to keep us (us as in the plebs) under control whilst we get exploited.","sentiment_label":0}
{"id":"1cb3vk3","text":"Irishman here, who thoroughly enjoys celebrating St Patrick’s day.     \n\n I lived in England for a few years, and was really disappointed that St George’s day wasn’t widely celebrated.   In fact I would make it a personal crusade of mine to get my English mates to the pub for it.     \n\n Having a national holiday (aside from being a great opportunity to get pissed) fosters a sense of collective belonging. It is a net positive that helps heal divisions and motivates a feeling that your community has a collective power (to fix shit).   \n\n  Bigger question tho, what should ‘Englands Guinness’ be? Nothing gets a national holiday going like the marketing might of a multinational drinks company. I’d vote for Tetleys (Edit: The Bitter not the Tea )","sentiment_label":1}
{"id":"1d4z7k4","text":"Oh boy. Can't wait to see how this one goes when the YouTube scientists get here.","sentiment_label":0}
{"id":"1bfa63i","text":"Woah... We could fit so many more migrants in here. We could fit the entire population of the world into a small grain silo if we only crush them into a fine powder first. Lets tarmac over every national park so we can increase our GDP!","sentiment_label":0}
{"id":"1bn9s9s","text":"It's a flakey investment now for sure. \n\nIf you look at things pragmatically, there will have to be asset taxes in the not so distant future due to younger people being unable to afford the tax burden to keep things like the NHS and the state pension afloat. \n\nIt's an inevitability.\n\nHopefully though there'll be a personal allowance, so the majority of homeowners won't be affected.","sentiment_label":0}
{"id":"1d60q17","text":"I don’t particularly like Andrew Tate, he is just another internet character which has sprung up. Some of these boys arrested are 12 and 13. Are you saying, even IF, they are a fan of him, that would make it right? Really big cop out suggesting this is happening because of people like Andrew Tate. This is poor parenting from whoever is raising these kids. Not only 1 to rape a girl, but 6? None of them there were like, err hang on should we stop this?","sentiment_label":0}
{"id":"1csfnv2","text":"It's ultimately OUR fault, THE PEOPLE have allowed this to happen.","sentiment_label":0}
{"id":"1cqw49x","text":"The planet is slowly burning, world war three has never looked closer and governments think the solution to all our problems is money printing. Still, you've got to laugh...","sentiment_label":0}
{"id":"1bnn6h7","text":">Otherwise the ideal thing to do wouldcvecto just movecthechouses of parliament elsewhere like Bristol. \n\nYeah I'm sure the best thing to do for the UK is to move parliament just to a different area of the already wealthy south! great idea!","sentiment_label":0}
{"id":"1bp7fjm","text":"Can people stop listening to this conman? the stupid half of this country already fell for his buggest scam, don't give him more attention.","sentiment_label":0}
{"id":"1cu2zml","text":"This is the standard in our \"liberal\" society. Anybody who speaks up is censored.","sentiment_label":0}
{"id":"1d6ccd4","text":"And yet people steal from Co-op, which isn’t that at all.\n\nIt’s clearly just people thinking they can get away with it and\/or feeling entitled to freebies.","sentiment_label":0}
{"id":"1cd5kfn","text":"People who say this have never tried real food and just eat frozen shit from supermarkets and gastro pubs. Moron.","sentiment_label":0}
{"id":"1d4yzwe","text":"Ah the brexit clickbait headline on a story previously explained as our interest rates still being higher.","sentiment_label":0}
{"id":"1d47cc5","text":"Literally nobody cares. They aren't even a real party they are a meme. Nigel \"ordinary bloke\" Fromage literally is just the political hand job for everyone's grandad.","sentiment_label":0}
{"id":"1ay3ju2","text":"Well said ","sentiment_label":1}
{"id":"1d5or7g","text":"We're really giving this toxic piece of shit attention? REALLY!? I thought her antics were known and the news stopped giving her what she wanted?","sentiment_label":0}
{"id":"1d3zhcp","text":"Bugger all information in the article, just seems like a bent copper","sentiment_label":0}
{"id":"1bij6ji","text":"I really don't care about the RF but this is getting ridiculous...can't avoid the coverage...she's recovering from surgery, end of. We don't need daily updates. What do people expect??","sentiment_label":0}
{"id":"1bno8wv","text":"It’s only a flag, what does it really matter, there are more things too worry about, ie our financial state. Is the colour of a flag going too pay better wages, is the colour of a flag going to pay your mortgage, is the colour of a flag going to give you job security, no it isn’t, so instead of worrying about the colour of a poxy bit of paint on canvas, shouldn’t you be more concerned about how the government will be affecting your life. Don’t be fooled again by a simple distraction, concern your self about what the government are doing, wile you’re not looking.","sentiment_label":0}
{"id":"1d5l0pg","text":">This is never going to be “front and centre” of the July GE. Starmer knows it’s divisive and he’d alienate many of the votes he’s keen to capture\n\nAnd yet, he was one of the main people who pushed for a \"peoples vote\" to be included in the Labour 2019 manifesto.","sentiment_label":0}
{"id":"1bdu09m","text":"It's king of degenerated into a celebration involving alcohol and explosives, a heady combination.","sentiment_label":0}
{"id":"1d4ta3s","text":"Now hang on a minute, Rishi’s income has been doing rather well. Michelle Mone isn’t complaining either, so it’s not all bad.","sentiment_label":0}
{"id":"1bj9hi3","text":"Israel is doing a holocaust on Palestine.","sentiment_label":0}
{"id":"1c0qbo2","text":"It’s not just capitalism the game. \n\nIt showscases the end game. One player having all the wealth, stripping away all the assets from other played until people get bored and everyone stops playing.\n\nI can only think of one way to stop playing in real life to be honest.","sentiment_label":0}
{"id":"1crm6ju","text":"I'm gonna take a wild punt and say it's American right wing freaks that are saying that she's Innocent?","sentiment_label":0}
{"id":"1d4dgk9","text":"[Yougov tracking poll](\n\n>Question: Generally speaking, do you think the sentences that the courts hand down to people who have been convicted of crimes are too harsh, not harsh enough, or get the balance about right?\n\n>Too harsh: 4%\n\n>About right: 17%\n\n>Not harsh enough: 64%\n\nLot of victorians still kicking around it seems.","sentiment_label":0}
{"id":"1cuvfjf","text":"Everyone who’s ever met him says he’s not a nice person apparently","sentiment_label":0}
{"id":"1cz78fd","text":"Bojo is high","sentiment_label":0}
{"id":"1cz78fd","text":"the fact that there are neo-nazi groups in the army is not a surprise- there are neo-nazis on the russian side too and in many other armies (which is partially what makes Russia's 'de-nazification' excuse so obviously bullshit). \n\nWhat *is* concerning is the level of influence and prestige that Azov battallion has, and *has* had since 2014. Putin kept Prigozhin and his thugs at arms' length and killed them the second they started acting out, but Zelensky is in a bind because of the power of these extreme elements within Ukrainian military and administration. In the (unlikely) event that Ukraine wins, what will happen to these extreme groups?\n\nHow many more hundreds of thousands will die over lies and greed? The young men of Russia and Ukraine are being fed into a meat grinder and there seems to be no end in sight.","sentiment_label":0}
{"id":"1bospol","text":"> One mosque-goer, who did not want to be identified, said Ezedi had \"attacked innocent people\" and as he had converted to Christianity, it was the \"responsibility of the church to bury him according to his new belief or religion, not the mosque\".\n\nWhat a messed up situation all round. I would be livid if my local mosque used donation money to bury this rat","sentiment_label":0}
{"id":"1cijl06","text":"I enjoy how Thomas is an 80 year old Tiger 2 but still hanging around with far more modern machinery. \n\nGood on you Thomas. Age isn’t a barrier.","sentiment_label":1}
{"id":"1cj657s","text":"Obvious publicity stunt","sentiment_label":0}
{"id":"1d1paj3","text":"Feinstein is fab. well Worth listening to. Shame he won’t will.","sentiment_label":1}
{"id":"1d177uh","text":"It’s truly terrifying that this rhetoric and conspiracy is so acceptable. Just like how dangerous antisemitism is and we know how that went. It’s exactly the same. ","sentiment_label":0}
{"id":"1cq5za5","text":"Who cares. The UK entry was truly awful though!!!","sentiment_label":0}
{"id":"1bndcda","text":"It's nice to be seen once in a while.\n\n\n<Chuckles in tubby>","sentiment_label":1}
{"id":"1cj657s","text":"Boris.... always the bumbly fumbly 'doing it for the bants' attention whore.....","sentiment_label":0}
{"id":"1btwk24","text":"The clinical staff know this. We know there's a lot of corruption and made-up roles, too. We can't do anything about it, unfortunately.","sentiment_label":0}
{"id":"1c7flab","text":"There are no martyrs. Religion has enough blame for compelling such inhumane behaviour without spreading its sick ideas. You do not get rewards for suffering.","sentiment_label":0}
{"id":"1cbgc15","text":">But we can't do it here because we're worried that some people might think it's racist.\n\nAnd God forbid, we ask the London luvvies to show any sort of patriotism. The sky may very well come falling down!","sentiment_label":0}
{"id":"1bcvprx","text":"These people are deranged extremists. How anyone thinks zionism is still a normal ideology, I have no clue.","sentiment_label":0}
{"id":"1d5vktv","text":"Both parties are fucking useless let's be honest, dismantle parliament.","sentiment_label":0}
{"id":"1by8lcq","text":"Indeed. I totally agree. But would you like the chance to defend yourself or hope that they don't whack you? Scum is scum and it's their rules which they make up as they go along. It's also worse among a certain age group, the young will always be trying to out do the last guy in order for a scarier reputation. \n\nI'm also for the death penalty. But again who does it? You certainly don't give the role to the person with their hand frantically waving in the air. \n\nAs I said, law and order has gone to shit. Prison is no longer something the criminals truly fear. \n\nBut when you have a group that appeals to take it easy on youth offenders, or make winners of those that don't do as well as the person who put the effort in to win, you create a nation of cowards and evil bastards.","sentiment_label":0}
{"id":"1c3molo","text":"A straight Tory?! What is the world coming to?","sentiment_label":0}
{"id":"1b4lm23","text":"Utter disgrace. But they disgrace themselves and show the whole world.","sentiment_label":0}
{"id":"1d3zxng","text":"Just get rid of her already, she's way more trouble than she's worth and they just don't need the bad press.","sentiment_label":0}
{"id":"1avp68w","text":"Glorious to see how the paid off politicians in parliament are earning their crust, for their puppet masters. \nI wonder if sweeping reforms are necessary.","sentiment_label":0}
{"id":"1ciemjb","text":"I think the most effective voter suppression measure is just to run candidates that I would never vote for. It's polling day, my passport is in my jacket pocket (I travel a lot), I'm not working and the polling station is about 200m down the road. Still not voting, because they all make me sick. I honestly don't care who wins.","sentiment_label":0}
{"id":"1ctyga5","text":"So the article says we're he still alive he'd have faced criminal charges and I have to say I don't see the point. If they have evidence the choking was consensual, he clearly is distraught about what happened. Why waste court time and public money- he'd have had to live with it. Was the behaviour, in particular the drugs and shit reckless? Sure. But it was reckless for both of them not just one of rhem","sentiment_label":0}
{"id":"1bbnjwv","text":"I’m with you there. It must be soul destroying to be surrounded by total strangers all the time.","sentiment_label":0}
{"id":"1by6vom","text":"I met a Brazilian at work recently. He works remotely most of the time but made a visit to our country’s office.\n\nI thought he was Spanish by mistake and I saw him on his own in the kitchen so I said *”hola”* using the very little Spanish I know (thanks Dora). \nHe was a bit shocked (like wow) but then looked at me and his face changed to confused looking, so I said *“oh no…are you not Spanish?”*\n\nHe replied *“no I’m from Brazil…but?…so?… you’re not Portuguese”*\nI didn’t understand what he meant though so I asked him why he thought I was Portuguese.\n\nHe said *“your pronunciation was 100% Portuguese it sounded native so I was excited to have a colleague who was a Portuguese speaker but then I turned to see a small English girl (thanks) and you don’t even look 1\/2 Portuguese it make no sense to me! Your *hola* in Spanish was pronounced very very wrong, but for Portuguese it’s perfect, I’m impressed!”*\n\nWe then laughed so much at the fact that my Spanish is so bad that I momentarily convinced a Brazilian man I was fluent in Portuguese. \nNow we are friends. \n\n\nSo I think they have good humour and are forgiving.","sentiment_label":1}
{"id":"1cn4u7j","text":"Can't we just say they should both burn in hell together?","sentiment_label":0}
{"id":"1cggtey","text":"Shocked Pikachu face.\n\nGenocide Joe was always going to do everything in his power to stop this and continue the slaughter of brown babies.","sentiment_label":0}
{"id":"1d45m83","text":"Reminder that 2 out of the 3 NEC members who were on her panel have been given safe seats (as has Starmer’s PA).\n\nPure corruption.","sentiment_label":0}
{"id":"1bwgrlq","text":"It's fair to say...Tory governments have bought the UK to its knees. They have failed to deliver anything positive to anyone other than the super wealthy. Tory conservatism has been a catastrophe for the majority of Britah people.","sentiment_label":0}
{"id":"1ciou7i","text":"Can you? I ran a  pub for years and government was *always* a hot topic. I can only assume you've never visited a pub before or are on your high horse about something.","sentiment_label":0}
{"id":"1bm1g0s","text":"Not really surprising, everyone knows israeli soldiers are child rapists ","sentiment_label":0}
{"id":"1cg0hsi","text":"yep thats the 1 :)","sentiment_label":1}
{"id":"1bfdh2m","text":"Yes famously left wing people want to gas the Jews and kill all white people. What incendiary nonsense.","sentiment_label":0}
{"id":"1cuu0cj","text":"Wouldn't go there and the bloke is obviously in the wrong job.\n\nPubs are supposed to be there for socialising.","sentiment_label":0}
{"id":"1d4pqd7","text":"Let's hope the SNP are gutted at this next general election. Binning Humza is the final straw for a lot of voters.","sentiment_label":0}
{"id":"1d1pqka","text":"Exactly, we need a leader who can lead. \n\nHiding from tough questions isn’t leadership and indicates that his stance on any subject is selected by the media team.","sentiment_label":0}
{"id":"1bmandb","text":"You saying that Russians are not brutal and in over two years of war they haven't committed mass executions rapes etc. They haven't changed, they brutal like nobody else, Germans to this day have nighmares about Russian taking their wife's and daughters...","sentiment_label":0}
{"id":"1d3xo7e","text":"Having a gun doesn’t stop you getting shot, especially if it’s a surprise shooting. I guess we could all wear body armour all the time.","sentiment_label":0}
{"id":"1d4c0ym","text":"Fuck me what a fucking doughnut.","sentiment_label":0}
{"id":"1d3ao5d","text":"RT Davies has been stating they're going to table this for a week, so why is everyone surprised?\n\nIt'll go nowhere. It's just a sideshow for the upcoming General Election.","sentiment_label":0}
{"id":"1d646l7","text":"Fucking loads of uk people down the conspiracy rabbit hole mate.\n\nMy dads one of them. To him donald trump is a genius. It’s fucking baffling.","sentiment_label":0}
{"id":"1bkzrtt","text":"I don’t disagree with the quantity.\n\nI disagree with the brand.","sentiment_label":0}
{"id":"1d4ndph","text":"This is what I wish people would accept. Our priority is to get rid of authoritarian nationalists, whether they're English authoritarian nationalists (Tories) or Scottish authoritarian nationalists (SNP). The SNP are the Scottish mirror image of the Tories. Every bit as despicable.","sentiment_label":0}
{"id":"1cmdx4t","text":"I wasn't born here (England) and love it. Like everywhere it's got good and bad bits, but I love this country. I love its history, its people, the culture, the humour. Almost everything about it. I think Englanders should be proud of who we are and celebrate on St George's day. Sure we make jokes about ourselves, and we don't mind others making jokes about us. We are tolerant of all people (even the French).\n\nDon't confuse our self-deprecating humour with hate. A lot of people do say they hate the country, but then I think that person would probably hate any place they found themselves. If you hate it so much, just go on, go, walk out the door\nTurn around now\nYou're not welcome anymore","sentiment_label":1}
{"id":"1chgol2","text":"Nobody with more than half a brain wants any of these male criminal rapists to be allowed to live for free at our expense and to get the preferential treatment they get over us who were born here. They are abusing the system and getting more from our government than English people can ever get, they never have and never will contribute to our system\/country in any way, or will they ever integrate or do anything positive, they have different beliefs, come from a different culture etc so they do not think, believe or respect the things we do. They are not compatible with our society and that’s why they are raping, abusing, and “honour killing” women in our country. They simply come here to abuse the system as much as they can and they lie, cheat and scam the home office\/ immigration to get more than English people get. They are given special privileges and priority for council housing that should be for English homeless people first before any foreigner should even be considered to receive any kind of free help from the U.K. taxpayers system. \nIt sickens me to think that when I retire after working for 55 years I will get the same state pension as an immigrant who illegally came here on a dingy today who has never put a single penny towards the U.K. tax\/benefit\/welfare\/national insurance pot that all us hard working U.K. citizens have to contribute towards all our lives. How does it make sense to any English person that illegal immigrants are getting more free benefits than English who claim benefits now and they get housing quicker than English people and they will get exactly the same pension from the government as us who have worked and paid towards all our lives, while they openly admit that they despise white English people and our country and everything our society stands for. This country has gone mad.","sentiment_label":0}
{"id":"1d3mdfk","text":"How the fuck they picked this idiot to be pm. Absolute knuckle dragger.","sentiment_label":0}
{"id":"1c3uw8v","text":"Tell me then, how you're going to reform the NHS","sentiment_label":0}
{"id":"1d5j92a","text":"Nasty people, best avoided when possible. It must be really damaging to live your life so full of blind hatred for everything except an orange muppet.","sentiment_label":0}
{"id":"1cpkok5","text":"My sister in law paid quite a bit of money to go on a cruise around the Fjords and to see the Northern Lights around 6 months ago. Meanwhile I stepped out into the garden ","sentiment_label":0}
{"id":"1d5jgvb","text":"I'm sure they won't just pass this onto the consumer with the massive price rises they're planning...","sentiment_label":0}
{"id":"1cj657s","text":"Utter arsehole.\n\nCurrently I'm helping 5 different people without any photo ID to get something sorted - the kind of vulnerable people who are either illiterate or mentally\/physically ill - who have never worried about voting before. Just took their voting card to the polling station and voted - job done.\n\nThis was just the Tories doing their \"Wish we were the US GOP party...sigh\" dreamy eyes across the ocean, where they hope to have a proper dictatorship with no rules that effect their wealth accumulation, or challenges from those nasty poor people (i.e. anyone earning less than a million a year).\n\nSo funny that Bozo got caught out, but knowing him it was deliberate as he craves ANY attention whatsoever for his \"brand\".\n\nWith any luck he's piss off soon to do his Scrooge McDuck diving into gold act in the Cayman Islands where he can be near all the money he and his mates stole from the British public.\n\nKnob.","sentiment_label":0}
{"id":"1by2u4l","text":"From London but now live on the outskirts of Portsmouth\n\nI wouldn't move back to London its much less peopley where I live,  but Portsmouth is rammed so I avoid that as much as possible\n\nBest thing about it for me is there's some nice nature reserves near me and some harbours for some nice relaxing walks","sentiment_label":1}
{"id":"1d5maxb","text":"I'll give you 5\/1 odds she whacks a lamppost in the middle of the Atlantic Ocean","sentiment_label":0}
{"id":"1cbxh7o","text":"Yeah they often invent stories just for the bad press (standing seats, 50p to use the toilet etc), so this seems like an easy win for them.","sentiment_label":0}
{"id":"1bbgqdi","text":"I just want that 5 percent of gdp back so we can have nice things again like roads without great pits in them.","sentiment_label":0}
{"id":"1biil4d","text":"Just disgraceful really, such obvious pandering. I thought we were supposed to be proud of being a secular society, and this is nothing of the sort. I'm sure if there were bible verses being posted up there, the twitterati would be all over decrying how backwards and non-inclusive our country is. I have no doubt that this will be met with silence by them however.","sentiment_label":0}
{"id":"1cdhbxz","text":"If we want a dragon slayer, metaphorical or otherwise, as a patron saint let's have one who was actually from here.\n\n\n\nAdditionally:\n\n- Piers had winged dogs. George had no dogs. Sad.\n- He humiliated the devil with word play\n- He calls out St George for his probable non-existence on his tomb. Meanwhile Piers definitely, 100% existed (trust me bro).\n\nThe arguments are irrefutable. Piers for Sainthood!","sentiment_label":0}
{"id":"1d5k5xh","text":"Yep, chlamydia is very much bacterial…this is hilarious on so many levels.\n\nThis whole thing is a mess. The article keeps talking about viruses at a cellular level, which is a pretty nonsensical statement (viruses don’t have cells). And then she calls herself Miss ViRos, but half of the things she paints are bacteria…","sentiment_label":0}
{"id":"1boli15","text":"I’m trying to go here to work, I’m from EU and a physiotherapist, but I can’t seem to find jobs as a bad 5 even with 5 years of experience. I’ve just been getting rejected. So not only the unskilled workers are facing a hard time getting jobs","sentiment_label":0}
{"id":"1cxwfhs","text":"Taking a moment to think about it, and yeah, this is a really good idea. It's not something that had occurred to me, even though I work in a hospital - maybe because all the loos in my department are single occupancy mini-bathrooms with a toilet, wash basin and sanitary disposal bin.","sentiment_label":1}
{"id":"1d3awg5","text":"You can’t beat it, it’s no wonder so many great poets have emerged from the English countryside.","sentiment_label":1}
{"id":"1d5j1q9","text":"Oh look, another male perpetrator with a suspended sentence, despite a long history of abuse and harrassment.\n\n","sentiment_label":0}
{"id":"1d3zxng","text":"Diane Abbott the racist? The person who says white blonde Scandanvian nurses are not suitable for the community of Hackney. The assertion being because they are not black.\n\nThe woman who claims white mothers do less than black mother?\n\nThe woman who claims Mao was mostly good?\n\nThis woman has no place in Labour and I am flabbergasted she has such support after the nonsense she speaks. She gets mocked because she gets numbers wrong which is amazing because she says far far worse things.\n\nIf a white person said half the stuff she did they would be branded racist and hounded out by the left but she gets a free pass? Why?","sentiment_label":0}
{"id":"1d4yakh","text":"Everyone sucks in this situation, but it feels like justice was served. \n\nLloyds get bad publicity. \n\nThe family gets guilt and grief, because they didn't provide enough support. \n\nWoman attacks someone weaker than her and the worst possible outcome happened. The sentence was fair and proportionate. \n\nI get why some people are mad, I'm a black guy and I've had to show restraint all my life and walk away. I've been wronged several times, including being hit. I don't react because I know that I won't receive a fair and proportionate sentence, if a confrontation takes a turn for the worst. Life ain't fair and Kemi Badenoch would be championing my tougher sentencing.","sentiment_label":0}
{"id":"1c7chpv","text":"Doesn't this just tell us they are ripping us off? They *could* charge 10p...they just don't.","sentiment_label":0}
{"id":"1bxqljn","text":"Stay classy r\/Hull","sentiment_label":0}
{"id":"1d5ls0c","text":"How about making sure City answer those 115 charges instead of bending over backwards for a nation state.","sentiment_label":0}
{"id":"1d5wzpn","text":"It was mostly security theatre anyway. What makes carrying a 1000ml of explosives in 10 bottles more easily detectable than one 1000ml bottle of explosives?","sentiment_label":0}
{"id":"1bsbf0r","text":"Clearly being a psychopath is no bar to being elected to the Knesset..","sentiment_label":0}
{"id":"1cys01q","text":"Massive journal subscription fees are one. The library will actually be expensive to run with many textbooks costing several hundred pounds each. \n\nSalaries of postdocs, PhD scholarships they will fund some of. Lecturer and professor salaries and pensions arent that cheap.  \n\nLab equipment, maintenance of the more fancy machines usually come with expensive service packages. Consumables in the lab are insanely expensive as well. \n\nRunning certain courses are certainly expensive and from my experience in science, it's not cheap.  \n\nThere are a lot of predatory business that charge universities extortionate amounts of money. Look up how much they pay annually to academic journals alone and I think you'll be shocked.","sentiment_label":0}
{"id":"1bjn318","text":"Where are all the fking Zionazi scum to defend this shit?\n\nStrangely silent now aren’t you, pussyholes?","sentiment_label":0}
{"id":"1d4edfh","text":"I’m a member of the Green Party but I’ll be voting Lib Dem as it’s so tight here between Lib Dem and Tory. I cannot contemplate our useless tit of a Tory MP being reelected. I’ll use the Swap My Vote website so someone somewhere can vote Green for me.","sentiment_label":0}
{"id":"1d4uhul","text":"The Conservatives could promise everyone a £20k bonus and a free mountain bike if they wanted because they won't be forming the next government so none of it will ever become reality. All this is about is generating the headlines they think will attract the attention of those voters who they think they still have a chance of retaining with the hope that it's not as bad a loss as they are fearing. There will be no substance to whatever policies they pull out of their arse.","sentiment_label":0}
{"id":"1c0si0e","text":"I think my main criticism here is size, not the cake status. How are we going to cut this up at my birthday party?","sentiment_label":0}
{"id":"1d5o3mj","text":"I asked my GP wife this question when she mentioned it in some BMA magazine she gets.\n\nWhy the fuck is the central government dictating how local GP practices deliver their treatment through implementing these random funding streams. Why is a pot allocated to a GP and they split it based on what they want to employ and then judged on outcomes?","sentiment_label":0}
{"id":"1d2vpu1","text":"I agree. \n\nWe need to get rid of the immigrants starting from the beginning. \n\nRomans back to Italy, Anglo-Saxons to Germany, normans back to France. \n\nMake Britain Celtic again!","sentiment_label":0}
{"id":"1cxvqxm","text":"Government should take back the water companies by force.","sentiment_label":0}
{"id":"1by8lcq","text":"You do realise it was all me right?\n\nYes I brought up the US as a prime example how being able to carry offensive weapons for whatever reason you like doesn't make you safer, but your response of \"nuh uh\" and *refusing to back that up* is a bad faith argument.\n\nUnless you have proof to back up your claims then wind your neck in.\n\nThe crack about \"quoting\" movies is also unnecessary. This isn't a formal debate, this is Reddit and me *paraphrasing* a movie quote to make my point is not in any way reflective of the actual content of my argument.\n\nYou're a walking talking logical fallacy.","sentiment_label":0}
{"id":"1cmdx4t","text":"I think it's our inerrant need to fit in and not seem better than everyone else. \n\nSo, saying England is a great place to live will trigger an almost primal reaction from people saying that you can't say that England is awful because of A,B,C.\n\n I just ignore those kind of people, as I don't have the energy or want to interact with them.","sentiment_label":0}
{"id":"1d4sjzx","text":"How? Wouldn't you see or small a dead body?\n\nI guess it's good that you said the last time you heard something like this happen was in the 90s. But it shouldn't happen now & again.","sentiment_label":0}
{"id":"1d46zwz","text":"Personally I don't think planning laws go far enough. Recently someone on my street bought a honda, I think they should have had to have a consultation before they were allowed, it doesn't fit in with the area's character of mostly Land Rovers. And don't get me started on PS5s, they are making too many and driving prices of gaming up, we should force them to make 60% affordable PS2s.","sentiment_label":0}
{"id":"1d1c2rm","text":"They were not going to win the young vote anyway. Does anybody know how old you’d have to be to have experienced National Service? The elderly seems to think it’s necessary for the youngsters but never experienced it themselves, and they would have us to believe that they turned out alright despite the fact.","sentiment_label":0}
{"id":"1d2ww02","text":"Yup. Welcome to New Zealand, we’re short of everyone except delivery drivers. I’m not sure how many nurses we failed to recruit in the last few years but I’m aware we need 600 GPs.","sentiment_label":0}
{"id":"1c9p8uw","text":"North Lincs my beloved. Scunthorpe my beloved","sentiment_label":1}
{"id":"1cimjpr","text":"Birmingham has a specific problem going back to an equal pay dispute that was badly mishandled and is still being badly mishandled from what i can tell.\n\nThere are a lot of councils in financial trouble because during the austerity years, the government lent them a lot of money (billions) to invest in all kinds of capital projects, many in commercial real estate. \n\nAll went well when interest rates were low until covid hit, suddenly everyone was working from home and their tenants started defaulting on lease\/rent payments as well as interest rates jumping.\nStatutory obligations are also increasing with smaller budgets and Westminster expects everyone to do more with less.\n\nThere are a lot of councils on the verge of bankruptcy, The Guardian is the only newspaper i know of that covers this long term.\n\n","sentiment_label":0}
{"id":"1d2i8l1","text":"Well this isn't at all horrific. \/s","sentiment_label":0}
{"id":"1c9w6um","text":"I like it. I cant think of a better public figure to have their likeness made into a statue. Though I'm sure crap will turn up in 200 years time and she'll get torn down...\nBut until then. She was the boss. And she commanded respect and was loved.","sentiment_label":1}
{"id":"1bnfpur","text":"100%\n\nWho the fuck are these clowns that want her back in?","sentiment_label":0}
{"id":"1ct8tcj","text":"Dystopian nightmare pod.","sentiment_label":0}
{"id":"1d5kmp9","text":"Oh honey he doesn’t hate you, he just enjoys exploiting you for the benefit of an aging population that sees no concerns in destroying the livability of this this world in the next 20 years","sentiment_label":0}
{"id":"1d38bf7","text":"That’s Bleak. Some of these people spent a career working on rescue helicopters and that’s their retirement prize. The article states that fumes were exhausted into the cabin (wtf!) and that Germany rectified this issue on their aircraft. Makes you wonder about the countless other number of exposures happening in the military.","sentiment_label":0}
{"id":"1d430lz","text":"Dianne Abbot should fuck off. She's toxic to half of Labour voters and toxic to 100% of everyone else.  It's like shes a fucking tory sabateur!","sentiment_label":0}
{"id":"1d3grdf","text":"Not an MP nor is his standing. Why does he get so much air time?","sentiment_label":0}
{"id":"1cb0zq6","text":"It's just recently become vastly worse, too. While the government is going in for a gimmick that will deport small numbers of people to Rwanda, it has issued enough visas in the last two years to cause net migration of 1.5 million. That's three whole regional cities' worth of people who need houses and jobs and services.","sentiment_label":0}
{"id":"1bz87mw","text":"Ah yes but at the cost of the £10.4 Billion it'll lose in taxes- trust me ...they'll still want that cash so you'll need to 'find it' from other sources (VAT\/Income etc)\n\n\n\n  \nCost to the NHS of smokers? £2.6 billion a year... guessing the gov just pockets the difference for other 'things'\n\n\n\nStill. Good to know it 'Might' go to local causes...","sentiment_label":0}
{"id":"1cbea55","text":"We could try not selling weapons, and not bombing other countries. That might reduce refugees.\n\nFucking idiot","sentiment_label":0}
{"id":"1d3x6ti","text":"Know somebody in a trust.  They had the new system in but it didn’t have the functions of the old system. Basically various tasks for onboarding and off boarding staff.  So they went to the emergency plan.   Got an external software consultant in who spent 6 months in the HR office taking plans and writing software.  Spend hundreds of thousands.   Went to implement it and NHS IT refused to let the external system access the main database.  \n\nSo they are still on the emergency system years later.  Much less efficient.  All manual and relay on managers completing tasks.  When they don’t things like lease cars and equipment don’t get cancelled and payments are still made.  \n\nThat’s why the software cost 900 million and is still shit.","sentiment_label":0}
{"id":"1bsvd47","text":"I support the people of my country not the parasites living a life of obscene luxury while leeching off us. Nice try bootlicker.","sentiment_label":0}
{"id":"1bthc64","text":"Self defence ended a long time ago. This is just a sick nation (or government and apparatus) performing unbelievable cruelty out of a mentally ill perspective on their place in the world.\n\nEternal victim complex even as they perpetrate the kind of evil they can never stop whining about.","sentiment_label":0}
{"id":"1bqsr48","text":"How are the Scottish assembly standing up for human rights, when they are attempting to further criminalise peoples most basic right to free speech and expression, even in their own homes, how can they said to be defending human rights?","sentiment_label":0}
{"id":"1bdru52","text":"Could someone sack all the diversity managers as well... that will help with the funding of NHS","sentiment_label":0}
{"id":"1bsjjd9","text":"The “news” follows a narrative and is not truthful.\n\nThe MSM stifles certain stories or makes mountains out of molehills to suit their narrative. \n\nThe BBC have been caught out a number of times, clearly reporting falsified “reports” or using language to dehumanise certain groups.\n\n“These people were killed\/ These people were *Found dead*”","sentiment_label":0}
{"id":"1cimjpr","text":"Croydon was one of the first to go bankrupt and it’s in London. The real answer is a combo of: lack of available council housing = huge temporary accommodation bills, and rising social care costs without additional funding to cover it. Remember how mad people got at the “dementia tax”? Well… it’s gotta come from somewhere.","sentiment_label":0}
{"id":"1csuwqp","text":"I prefer Kid Starver, no point even implying he's remotely left wing.","sentiment_label":0}
{"id":"1d4dlbl","text":"It's pretty shit.\n\nBeen waiting 2.5 years to see a dermatologist for psoriasis that's causing a reasonable amount of pain and functional problems.\n\nIt's looking like I'll have to wait another 1.5 years still.\n\nSo about 4 years for something that should be fairly simple.","sentiment_label":0}
{"id":"1d3hdw7","text":"Fortunately, mine is this year. The issue is that the govt offering is shit. Nobody in power wants to give up their money or power. Where are you?","sentiment_label":0}
{"id":"1d4sjzx","text":">The inquiry heard that on 5 July he took a call from a farmer named John Wilson reporting a car off the road and recorded it in his police notebook, but he failed to log it into the Storm case management system and no action was taken.\n\nFuck me.\n\nMust've thought it was abandoned.","sentiment_label":0}
{"id":"1bj9hi3","text":"This is fucking disgusting. It is a genocide and off the scale wrong. I can't believe our elected leader dickhead Sunak tells the world that the UK stands with Israel.  No we fucking don't sunshine. Fuck you Sunak and fuck all the Zionist","sentiment_label":0}
{"id":"1d4doel","text":"Very well said. We have a massive and growing underclass in this country of people who not only do not contribute but actively destroy society. Eventually it will hit a critical mass where everything collapses. People need to wake up and realise just how dangerous and insidious this problem is.","sentiment_label":0}
{"id":"1bbgqdi","text":"“Perfect is the enemy of good” - Voltaire\n\nSure, Labour are tories in red ties. At least they aren’t the bastard tories.\nAny step to the left is a step in the right direction.","sentiment_label":0}
{"id":"1cqs8pn","text":"Bullshit article. If you like it, watch it. If you don't like it, don't watch it. Your sex or sexuality doesn't mean you can't enjoy\/watch shows that weren't made for your specific sex or sexuality (which is every TV programme).","sentiment_label":0}
{"id":"1c5re71","text":"Farage should go back to cleaning Drumpf's teeth like the Plover bird does to a crocodile","sentiment_label":0}
{"id":"1bguyf4","text":"Thank you for making me crack up today, democracy at its finest.","sentiment_label":1}
{"id":"1ckrypm","text":"uff i prefer watch 2 girls 1 cup 10 times before i watch this 2 bags of manure masquerading as people","sentiment_label":0}
{"id":"1d5l3e9","text":"Well I'm fucked then if two of the shortages are gonna be thyroid and epilepsy. I take thyroid hormone for under active thyroid and pregabalin (or Lyrica brand name) for fibromyalgia and Pregabalin is one drug that  if you just stop taking it or drop too much  too quickly it can royal fuck you up. I found that out the hard way when trying to lower my dosage too much too quickly cos I thought it stopped working. Not only did my pain increase ten fold but my mental really went down the toilet too. Like I was close to suicide bad.","sentiment_label":0}
{"id":"1bd38hx","text":"Ah Ai Images. My (not) Favourite","sentiment_label":0}
{"id":"1d3cfw6","text":"They’re after our fish! Don’t worry, Jeremy Clarkson will be standing on Tower Bridge wearing a custom made Union flag suit, brandishing a pint of hawkstones in his left hand and a narwhal tusk in his right, he’ll give them a good seeing to","sentiment_label":0}
{"id":"1bmj5p2","text":"It's absolutely ridiculous how it's still illegal and how so many people are still against \n\nI could go and buy a load of alcohol get absolutely ruined go out be loud and cause some chaos and do whatever and that's fine even if I do it every week.\n\nBut I have 1 smoke and play some video games or watch some movies and it's completely illegal and I'd get a criminal record ","sentiment_label":0}
{"id":"1ch1318","text":"I could never understand why a potential new border was being blamed on the UK. It's the EU that requires its members to have borders with non-members. So if a border went up, it would've been Ireland putting it up, not the UK. The UK, being free from EU rules, wouldn't have to follow them.","sentiment_label":0}
{"id":"1d68acz","text":"His name is Steven Yaxley-lennon or Steve for short.\n\nTommy Robbinson is a made-up propaganda name designed to make him sound less like a posh nazi knobend and more like an 'ordinary' English working class hero type bloke.","sentiment_label":0}
{"id":"1d4dgk9","text":"Sounds like a far-right jackboot-licker's wet dream. I fully expect to see this in Reform's manifesto.\n\nThis sort of thinking died out with the Victorians. It's senseless to allow people to die from overcrowding needlessly and deliberately.","sentiment_label":0}
{"id":"1d5vktv","text":"Labour leader: \nWe will cut down on immigration \n\nAlso Labour:\nWe will bring in Gazans to the UK","sentiment_label":0}
{"id":"1balovb","text":"What a dishonest horrible take of a completely innocent comment. \n\nYou must be fun at parties.","sentiment_label":0}
{"id":"1d3m1k4","text":"It's pretty unsettling how many people who take on the Joker character as a representation of themselves end up killing or hurting people.","sentiment_label":0}
{"id":"1bndxs7","text":"Once again, where are the Zionazi pussyholes that called me every kind of racist bigoted antisemite for calling this shit out? I don’t see the IDF as Jews any more than I see the Westboro Baptist Church as Christians.","sentiment_label":0}
{"id":"1ay3ju2","text":"We're now having votes in parliament swayed by Islamic threats. Literally happened a matter of days ago but you keep pretending it's non Muslims that are the problem","sentiment_label":0}
{"id":"1cx515f","text":"Do they really need click bait titles for the weather? Surely people who want to know the weather will click it regardless","sentiment_label":0}
{"id":"1bqqrsv","text":"If we had government owned shops, like the tobacco shops in Spain, could regulate strength and quality, and ensure age restrictions. Imagine the amount of tax money flowing into the Treasury! We could have a fully functional NHS and a publicly run transport system.","sentiment_label":1}
{"id":"1d35bq6","text":"That headline completely misrepresents the data. To quote the first line for those who don't bother read the links: \n\n\n> Wealthy white men from rural areas are the UK’s biggest emitters of climate-heating gases from transport \n\n\nThe headline makes you think of frivolous emissions by Chelsea tractor drives but the data is for hard to avoid emissions by actual tractor drivers. \n\n\nAlso, the data shows that the majority of transport emissions come from flying across all wealth deciles. If you care about  the environment, don't fly. That's the message The Guardian should be giving it's readers instead of twisting the data for a bit of \"daily hate\" against wealthy white men.","sentiment_label":0}
{"id":"1d627ck","text":"It’s a family fun day man!","sentiment_label":1}
{"id":"1cxvqxm","text":"Replace them all with AI. By them I mean the rich assholes that run crucial infrastructure companies. I agree AI may not work for politics because of the risk of whoever programming it being able to influence politics, but when it comes to infrastructure, it just needs to do its job i.e. process data, and make decisions from that data. These are the kinds of jobs I don't mind being replaced by machines","sentiment_label":0}
{"id":"1d4zore","text":"Hope that there's intelligent life somewhere up in space, 'cause there's bugger all down here on Earth.\n\nThanks Eric.","sentiment_label":0}
{"id":"1d3a7po","text":"Have the players all been working from home? Is that why they've been so shit?","sentiment_label":0}
{"id":"1d325m5","text":"I love farm shows and one of the farmers on a doc sold their fleece for insulation.  As a wool \/ sheep fan I just said OMG how is that possible.  Thanks for the confirmation","sentiment_label":1}
{"id":"1cytc9y","text":"Get the shitservatives out of power, they had their chance","sentiment_label":0}
{"id":"1d3zxng","text":"More like purge of the corbots. These people resent the idea of labour being electable","sentiment_label":0}
{"id":"1bpx39o","text":"The propaganda works unfortunately. But it only works on those willing not to look beneath the surface in the age where everyone has a phone and we have hours of footage of exactly what they're denying. That's why subs like worldnews spend so much time stopping people sympathetic to Palestinians from posting or commenting. History won't look kindly on what's happening or those who defend it.","sentiment_label":0}
{"id":"1d67ul5","text":"> I've tried and so far failed to get an apprenticeship for a career change after my degree career path ended in failure before it even started\n\nDid you use your degree funding? The funding for higher education tends to be a single pot so if you did a degree, it might exclude you for applying again for a higher education path","sentiment_label":0}
{"id":"1bbbyv0","text":"What about those giant lizards that died out in the Ice Age - haven't seen those around in a while. I'm sure they'd also be a welcome addition to the British countryside. Let's bring 'em back!","sentiment_label":0}
{"id":"1d3zxng","text":"I think it's time the whip was removed and followed by an expulsion. She's literally the biggest vote winner for the tories now. This morning Hunt defended the record debt, poor services, huge tax bill and NHS problems with \"well Starmer can't deal with Abbott, so how can he run the country?\" to which the presenters nodded with agreement.\n\nLike lancing a boil, it's best to do it in one go and be done. It's better to lose one or two seats in London (although the local support is vastly overstated) than lose 150+ nationwide.\n\nAll the policies on tax and NHS are being drowned out by someone realising their time on the gravy train is over","sentiment_label":0}
{"id":"1ccw3z0","text":"If you actually do something you don't have anything to campaign on.\n\nSame as the Calais boats. If you just sucked up the €3000 fine for stuffing each one on the plane rather than the hotel, fees and food etc, you'd have solved the issue. Then you wouldn't have a \"vote for me and I'll stop it\".\n\nCampaigning on I did X for you, doesn't generate the vote. It's still na you're a douchebag and I'll vote you out anyway.\n\nSame as those idiot republicans about that wall every time to stop the drugs... The most lethal one is coming in from China. Can't build a wall in the Pacific so no point talking about the actual source. Just blame Mexico.","sentiment_label":0}
{"id":"1bsbuwn","text":"Are you surprised. They don't even visit you now after a \"minor\" crime (and sometimes even quite big crimes fail to get a visit) but will issue a note so you can claim on the insurance. Too busy chasing rainbows......","sentiment_label":0}
{"id":"1bpx4gp","text":"Utterly sickening.","sentiment_label":0}
{"id":"1bh29kt","text":"Good to see you’re with likeminded people, those who know nothing about boxing.","sentiment_label":0}
{"id":"1c5a4oh","text":"Haha legend","sentiment_label":1}
{"id":"1d4xckp","text":"We're a bankrupt country. Fact  But also pay no attention to the man behind the curtain (Wizard of Oz reference) all the billions Tories have wasted on expenses, war, tax cuts, asinine immigration schemes.\n\n\nIf we can spend £250m to send warships to the Red Sea to bomb Yemenis protesting genocide and not put in any genuine effort to stop the genocide (free of charge) then what can I say ","sentiment_label":0}
{"id":"1d3mdfk","text":"This Benjamin twat really is the kiss of death to any political movement he involves himself with, isn't he?","sentiment_label":0}
{"id":"1cqs8pn","text":"You journalist confuses her personal experience with \"always\".\n\nIf you're a free paper you're not going to be paying much (if anything), and stuff like this gets clicks and shares.\n\nThe usual race to the bottom.","sentiment_label":0}
{"id":"1ayxv5m","text":"I sew Captian Obvious has fallen on hard times and is now going insane. Someone call up HMP Broadmoor.","sentiment_label":0}
{"id":"1d1ndh0","text":"Burn this man","sentiment_label":0}
{"id":"1cvwflz","text":"Hard agree and I've been saying it for a while now! All the lovely wildflowers, animals and greenery. The fields not scorched yellow. Only annoying thing is the rain! But still it's magnificent it really is. We r very lucky.","sentiment_label":1}
{"id":"1d3i3mt","text":"The whole thing was clearly a hatchet job. Billions bunged to the mates of rich Conservative MPs in farcical contacts during covid, and they are trying to smear Rayner over this utter non story. Pathetic deflection.","sentiment_label":0}
{"id":"1bndxs7","text":"This is horrible. Why would they treat the kid so badly? No wonder they kids will learn to hate them","sentiment_label":0}
{"id":"1d3gxc7","text":"Any government who proposed raising my income tax by a penny per pound to help the NHS and another penny per pound to support law and order would get my vote.","sentiment_label":1}
{"id":"1bfgqo0","text":"Its more like kids wanting all the toys in there and adults surprised with how expensive charity shops are now.  \nI went in my local one today and they wanted £15 for some of the T shirts! Gone are the days of grabbing bargains for 50p","sentiment_label":0}
{"id":"1d5tdx5","text":"Public schools tend to churn out a good amount of people who end up in high public office while knowing the square root of fuck all about the public, their struggles, needs, wants, etc, and they have no intention of learning. \n\nBecoming an MP is more of a thing to check off their list of things they should do to further their ability to earn money, rather than something they do to better the country.","sentiment_label":0}
{"id":"1ch1318","text":"Can we not all just collectively agree to leave the ireland borders the fuck alone??\n\nDo people not realise that the IRA very well do still exist, they might not be publicly doing attacks anymore, but they are still around and waiting\n\nAnd if an incident were to happen, i doubt our current government is competent enough to be able to pull of another good friday agreement","sentiment_label":0}
{"id":"1ct8tcj","text":"Perfect for someone with a huge amount of clothing but no prospect of sex","sentiment_label":0}
{"id":"1d38o5c","text":"yet my dad who lost job after 14 years could not even get JSA and when he did they only gave him 150 a week that only covered his fuel\/lunch he prepared at home to go for a job they asked him miles away. lovely that UK Tax payers get barely much after they worked and paid taxes.","sentiment_label":0}
{"id":"1d5yr56","text":"Although in typical fashion the BBC bring in to the story the “far right” protest in central\nLondon despite it having no relevance to the Wembley arrests.","sentiment_label":0}
{"id":"1d6ccd4","text":"The fact that you can do it as much as you like and get away with it is a biggie","sentiment_label":0}
{"id":"1d6a0cd","text":"If this comes to fruition I will definitely be getting an annual pass!","sentiment_label":1}
{"id":"1csfnv2","text":"As an ex cop I can agree with you, but it wasn't shady tactics, just incompetence and bad management.","sentiment_label":0}
{"id":"1d2y53i","text":"What a fucking joke .. they fucked the system by not investing so their punishment for causing all of this damage .. is to reduce their punishments .. to encourage investment .. fucking madness \n\nWho just bought a new car then? New house maybe ??.. one particular cunt has done very well here","sentiment_label":0}
{"id":"1cytc9y","text":"In reality him and his mates have finished pillaging the public purse.","sentiment_label":0}
{"id":"1d5jgvb","text":"Its a natural monopoly, so really it shouldn't exist full stop.","sentiment_label":0}
{"id":"1awop3j","text":"US says jump, UK says how high Sir?","sentiment_label":0}
{"id":"1b31ea8","text":"Ooh but you can’t call it nazi like conduct even though it’s fits the definition perfectly","sentiment_label":0}
{"id":"1d5376m","text":"Such a tiny amount of money to steal from someone.  Guess the crabs in a bucket that is the UK underclass would sell their own children for mere thousands.","sentiment_label":0}
{"id":"1d5k5xh","text":"Shame mysteriously has no effect on people now?","sentiment_label":0}
{"id":"1d4qqda","text":"14 billion litres of sewage divided by 67 million (the uk population) means that Thames water, over the year, pumped 206 litres of water into the Thames for every person in the UK.\n\nThames water don’t even service all the UK - what the fuck is going on? Are they dumping Litterally every bit of sewage directly into the Thames? Are they asking other companies for their sewage and then dumping it in the Thames? Are we importing sewage for dumping in the Thames?","sentiment_label":0}
{"id":"1d1ud3r","text":"If history has taught us nothing else, selective breeding of European royals always works out well.","sentiment_label":0}
{"id":"1d4pqd7","text":"Saying and doing are irreconcilable possibilities for the SNP","sentiment_label":0}
{"id":"1d3iuah","text":"The last 20 years should have taught you that Muslims are very selective over which other Muslims they care about, support and assist.\n\nMost people who protest don't want to protest anything which is risky or dangerous, they just want an easy day out to yell about their specific view.","sentiment_label":0}
{"id":"1cy67n8","text":"Oh come one he’s as much a fat cat as the rest of them in Downing Street. The bloody bastards!","sentiment_label":0}
{"id":"1d57y5r","text":"Honestly, got cars outside our bedroom windows, children go to school in cars to play in a playground near a road and then get driven home.\nWe've got private jets and politicians or royals taking flights a short train could manage, and finally a runaway dependency on plastics.\n\n\nBut if you want to burn wood for warmth, comfort, and auld Lang syne then fuck you.\n\n\nGet a grip and subsidise buses ","sentiment_label":0}
{"id":"1d1ktd2","text":"If this happened in the US, attorneys would be lining up to sue Topgolf. You can’t (reasonably) protect people from their own stupidity, but lawyers try to prove it’s the “deep pockets” fault so they can make a buck. Topgolf is safe as long as people don’t do stupid stuff like this.\n\nHeading to my local Topgolf right now where I’ve worried about losing my balance (old guy) and falling into the net but never once worried about tumbling over it!","sentiment_label":0}
{"id":"1ct8tcj","text":"Landlords are scum.","sentiment_label":0}
{"id":"1b9xbmo","text":"I laughed out loud at that. Brilliant","sentiment_label":1}
{"id":"1coreid","text":"Out of those I only use mph, the others I have no understanding of in the slightest.\n\nAnd I only use mph because all the speed limits use it","sentiment_label":0}
{"id":"1c25yp4","text":"That's a steal!!","sentiment_label":1}
{"id":"1bpyn8z","text":"About Reform seeming to give a fuck. They’re somehow a nastier and manipulative party than the Tories","sentiment_label":0}
{"id":"1cpe534","text":"Today is the brightest day I've seen all year lol","sentiment_label":1}
{"id":"1cq4ev3","text":"Ah yes. Him having regret. Then there's the news that Braverman has regret.\n\nIt's just them trying to seem human before next election. They've had the position of influence to do good, for many years, but chose not to.\n\nDon't be fooled. \n\nIf you appreciated how the Tories behaved, then fine, you know what you're voting for.\n\nBut if you didn't appreciate it, don't think this is a leopard changing its spots. Vote based on what you've seen, not their regret and hope.\n\nExpect more of these regret articles in coming weeks. Two in one day isn't bad.","sentiment_label":0}
{"id":"1d0cxo0","text":"That’s a tough wall. I reckon de pfeffel Johnson is probably the highest score because he was the most image obsessed, and therefore most recognisable to whoever lacks the cunning to avoid the people who do the surveys for Pointless","sentiment_label":0}
{"id":"1d5jgvb","text":"How is it that a company with so much debt is capable of paying out dividends to shareholders?\n\nSurely there is no money to hand out if they can't pay their creditors.","sentiment_label":0}
{"id":"1d1q9p0","text":"Absolutely spot on. The slaughter is directly the responsibility of the Labour Party. They must dedicate their entire focus on putting right this terrible war they've caused in the Middle East and in no way think about what's happening in the UK. \n\nSeriously, these posts really fucking piss me off.","sentiment_label":0}
{"id":"1b12yux","text":"They used gas in the gaza city tunnels and managed to kill 3 more hostages\nJews gas Jews gives Ironic a completely lunatic outlook","sentiment_label":0}
{"id":"1btwk24","text":"I work in a private bank. Absolutely incompetent at handling money, spent extremely poorly.\n\nWaste is a part of any large structure. \n\nThought you should know.","sentiment_label":0}
{"id":"1d38bf7","text":"Military use so much drugs that all that stuff you said is meaningless ","sentiment_label":0}
{"id":"1d57y5r","text":"You can fuck off. I like my stove. Don't have the heating on 95% at the time of the year.","sentiment_label":0}
{"id":"1avp68w","text":"No surprise there. UK politicians are in the pay of the zionists","sentiment_label":0}
{"id":"1chdm7r","text":"I do this.  A local takeaway pwner is a fully qualified doctor, but was so sick of not neing ablkle to treat everyone, so left and started a take away. His food is indian and is gorgeous.  Now he can treat everyone with his home cooked food. Quite a change in jobs :) I have rang him twice for help, and it always been good advice.","sentiment_label":1}
{"id":"1cfwkbf","text":"Says the man whose recent tax changes with the loopholes in the non dom tax law could save his family £250 million in UK taxes.\n","sentiment_label":0}
{"id":"1bdqcxt","text":"Amazing ","sentiment_label":1}
{"id":"1d3nyx5","text":"Update: bodies have been found :( How unspeakably terrible :( \n\n","sentiment_label":0}
{"id":"1d38sr1","text":"Something so important shouldn’t be allowed to be owned by a private company, never mind a foreign entity. This is insanity.","sentiment_label":0}
{"id":"1d0wr7i","text":"Genuine LOL on the toilet. Thank you.","sentiment_label":1}
{"id":"1bj9uvr","text":"A single celled organism could do a better job than rishi \" the twat \" sunak","sentiment_label":0}
{"id":"1cj657s","text":"To be honest this just about sums up Boris Johnson, unreliable, useless and a complete waste of time","sentiment_label":0}
{"id":"1buj9lv","text":"“His mother died” was the wording I would use.","sentiment_label":0}
{"id":"1d5jgvb","text":"Should just be a publicly owned utility. This country (England, long live public Scottish water) being one of the few in the developed world to have completely privatised water and sewerage is completely mad.","sentiment_label":0}
{"id":"1bq6tfs","text":"To be fair to sticky ricky he NEEDS to steal 1bn of taxpayer money, the first billion he immorally collected is lonely.","sentiment_label":0}
{"id":"1bjn318","text":"Exactly i couldn't agree more my friend.","sentiment_label":1}
{"id":"1d3xlr8","text":"An equally horrible element of this scandal is that she is a worthy candidate to be a MP. She is teacher at LSE, she has decades of experience working in social inequalities, is a published author, and was born and raised in the constituency she’s standing in, having built a great campaign for the past 5 years.","sentiment_label":0}
{"id":"1bg4t84","text":"Gosh I loved the Amando Iannucci show.","sentiment_label":1}
{"id":"1cdkst6","text":"Fuck Israel","sentiment_label":0}
{"id":"1cnd2md","text":"Shame your parents weren't part of it you cunt...","sentiment_label":0}
{"id":"1d601rh","text":"Heroin dealers provide a much needed service for heroin addicts though....unlike Jonathan Gullis who provides nothing of value to anyone, apart from perhaps JCB.","sentiment_label":0}
{"id":"1b2ztw8","text":"\"encouraging\" What? She said \"I witnessed things that were wrong\"... Do you tell people they are wrong as a form of encouragement?","sentiment_label":0}
{"id":"1cu0xh5","text":"Get this girl to put sunak in his place","sentiment_label":0}
{"id":"1d1ktd2","text":"Health and safety is stupid. We were so much steonger as a nation when the working class were fodder and knew their place. Which was usually in a casket or whellchair. Accidental maiming and death is character forming. So is being sued as a company because you are at fault. Let's also go back to rickets and diphtheria. Fly the flag, stop moaning, polish your doorstep, die young and rejoice you are part of an empire on which the sun never sets.","sentiment_label":0}
{"id":"1d3iuah","text":"They make parts for the multi-national F-35, which Israel is also part of.   We're at a point where many of the European air forces are going from F-16s to F-35s.  If they transistion than Europe is safer and stronger and the planes could oossibly be sent to Ukraine.  But due to the latest problem with the F-35 there haven't been any deliveries for about the last 6 months.  As one crucial part has been found to be defective, in some of the later models.   So any further delays are really unhelpful, unless you're Russian.   \n\nThey do make some cheap parts that get put into other missiles and some artillery.   A jam resistant GPS guidance unit for JDAM bombs guidance kits for long range artillery shells and kits to make helicopter launched 70mm rockets more accurate.  Israel has no need of rocket assisted artillery in Gaza as Gaza simply isn't big enough to need it.   The only people who don't like having more accurate firepower are the people who are supposed to be on the receiving end.  As they'd prefer that civilians get killed instead of them.","sentiment_label":0}
{"id":"1bfgqo0","text":"High quality meme","sentiment_label":1}
{"id":"1d5fw9r","text":"Like egg printing, with actual tracking? Sounds good, please do it at source though.","sentiment_label":1}
{"id":"1cyaq43","text":"They know they won't win. They're ransacking the place so that labour will inherit a shitstorm and promptly do fuck all about it but whine.","sentiment_label":0}
{"id":"1b22zae","text":"Nah. Too busy fighting each other to hold our government to account for failing this country.","sentiment_label":0}
{"id":"1d5kgda","text":"I live near here and the buzz is that it was full blown riots with guards taken prisoner. A real shit show. Bit more than 'disorder' anyway.","sentiment_label":0}
{"id":"1bp7fjm","text":"Maybe an unpopular opinion but fat bastards *do* consume NHS resources that could be better spent on people without voluntarily-induced conditions. And, in case anyone hasn’t noticed, the NHS is struggling after years of underfunding and privatisation by stealth. Some people like Michelle Mone made a *lot* of money from the pandemic, all of which came from public coffers. Bet Nige didn’t try to rile the audience with that particular fact. No, he rails against a doctor advising people not to be greedy fuckers which genuinely *isn’t* bad advice.","sentiment_label":0}
{"id":"1d5mbpl","text":"Appeal to aspiration middle class?\n\nThen why is he taxing private schools? It’s the aspirational middle class who are trying to send their children to private schools. Less children in private school = more people in tax funded public schools","sentiment_label":0}
{"id":"1ayq5ew","text":"Most  countries can't risk a war, it's always led by the young and the future is supposedly bringing an aging population crisis which is already a nightmare.\n\nWho will look after them if the government kills off the young in another war?","sentiment_label":0}
{"id":"1bemu8c","text":"Feel like this post is a debate full of hypocrites.","sentiment_label":0}
{"id":"1d5wzpn","text":"I took 2 100ml travel size Lynx deodorant through security in a clear bag as instructed. My bag got rejected and had to be manually checked. They tested of the Lynx to make sure what was in it was only deodorant. They didnt test the other\n\nSeemed all abit pointless\n\nFact some airports are ready for this and not others seems to just make it more complicated and confusing","sentiment_label":0}
{"id":"1d3zxng","text":"Diane's had the whip restored a matter of hours and she's already plunged Labour into a new crisis.\n\nStarmer should have nipped this in the bud months ago rather than dither over her future in the Labour party but it's pretty clear a number of salty Labour lefties have now jumped on the band wagon and are out to cause trouble.  Its right what they say about Labour having the ability to clutch defeat from the jaws of victory.","sentiment_label":0}
{"id":"1bp56fu","text":"Honestly have no idea why we have so many streetlights. There's one outside my bedroom, it's annoying. When in Turkey I noticed they have a far lower density of streetlights and it gave the city a much lovlier mood.","sentiment_label":0}
{"id":"1d431mo","text":"Why in the article have they written it \"innocent victim\" in quotation marks. Of course she's innocent she's 9. Is it just me or does that not appear right.","sentiment_label":0}
{"id":"1d4b2s4","text":"I think this is the line the anti-labour Media has chosen to destablise Labour amongst their own voter base. \"Keir is a right winger, hates working class and leftists\". Which makes no sense, but of course... Making sense isn't important lol. \n\nThey loved the idea of (2019) Corbyn being a \"champagne Socialist\" big city woke elite and it was only the Tories who cared about Working class. Makes no sense, but it worked. \n\nThe whole Tory in party in 2019 was purged of anyone who had the slightest anti-Brexit or anti-Johnson stance. What's going on in Labour right now is child's play compared to the Tory Civil War 2017-19. Honestly people have such short memories. Has everyone forgot how crazy it was then?","sentiment_label":0}
{"id":"1d22unl","text":"I am a white male. My country's media, ruling party and women never stop telling me what a horrible person (for being born the way I was) I am and how much they hate me. I am not going to fight and die protecting the interests of people who will laugh and cheer when I come home in a box or as a cripple. \n\nHere's a video of how women react to a man being mutilated.  . That is what is in women's hearts for you and me. \n\nWhen women are forced to die to support the policies they vote for, I'll fight. When the children of the ruling class who hates me fight and die at the same rate as the rest of us, I'll fight. When women come home from the war in boxes at exactly the same rate as men, I'll fight. Until then, if you push a gun into my hands and tell me to kill or be killed, I'll point that gun at you motherfuckers. I'm not dying to protect people who hate me. \n\nFuck off. You can't relentlessly insult, degrade, humiliate, accuse, blame and discriminate against people and then expect them to literally die to protect you. Not only would you never protect me but you will celebrate my death. If I'm dead anyway, I'm going to take people who hate me with me to the grave.","sentiment_label":0}
{"id":"1d1c2rm","text":"And the people who it's going to affect can't even vote so they don't have a say in ut, he's just trying to get the fare right vote with old people but it's going to backfire on him, I know it","sentiment_label":0}
{"id":"1b4vf19","text":"As with all things it comes down to money. The Recipe they use now is cheaper. So that also means more profit. They don't care that it also affects quality even though it's the quality that made Cadbury's so big in the first place. Presumably they thought they could get away with it because Cadbury didn't really have any direct competitors so it's not like any one could take advantage of the brands drop in quality; Except that now Milka, the German equivalent, is making massive inroads into the UK market after dominating central EU.\n\nAnother thing they did was \"stream line\" the business. After the take over they cut a lot of jobs and reduced the benefit packages the employees that remained. Which then caused a lot of people who hadn't been fired\/made redundant to leave of their own accord.\n\nSeems like a massive waste, doesn't it.","sentiment_label":0}
{"id":"1cypi8f","text":"Showing your age mate ","sentiment_label":0}
{"id":"1d5maxb","text":"For what it's worth the military have probably been one of the most egalitarian employers for a long time. \n\nPromotion is absolutely based on performance and there's been alot of females in more or less every command role for years. \n\nI'm sure she will do very well. The RN have had a selection of very good female senior officers for years. \n\nnon exhaustive list includes Jude Terry, Sarah Oakley, Jo Deakin, Sue Neilson and Cat Jordan.","sentiment_label":1}
{"id":"1cfwkbf","text":"Have you tried, killing the poor?","sentiment_label":0}
{"id":"1chm685","text":"Do you mean to tell me, that under 18s are looking at pornography. That Porn sites don't bother to check whether someone is adult and that boys are becoming addicted to porn 4 years before they ever have sex. \n\nI for one, am shocked!","sentiment_label":0}
{"id":"1d4e1pp","text":"Didn’t Starmer try getting Saville off some charges at one point? I agreed with labour under Corbyn but of course they accused him of antisemitism and he had to step down. Dunno Starmer reminds me of that show the New Statesman in that one episode where Alan B’Stard a true Tory joins labour","sentiment_label":0}
{"id":"1bsvd47","text":"So what the fuck do we pay them for?","sentiment_label":0}
{"id":"1cj6sbh","text":"Yep, that what I was thinking. \n\nThis guy decided to fuck decent people for his own gain, its a fucked up trait in this day and age and I'd personally hang every last fucker who chooses this route.","sentiment_label":0}
{"id":"1d3grdf","text":"Why is this guy even still being given airtime? Can we deport him?","sentiment_label":0}
{"id":"1d4zore","text":"I swear they are actively trying to avoid fixing the real problems in this country….","sentiment_label":0}
{"id":"1d646l7","text":"You have a guy who is now a cirminal, and has proven before to be sexist and a racist. Yet people in the UK and US love him\n\nBizarre","sentiment_label":0}
{"id":"1d57y5r","text":"What a load of horseshit. Meanwhile China sends out thick plumes of shite into the atmosphere 24\/7 365 double time on a sunday, but Dennis and Mary need to not put 3 logs on. Fuck...right...off..","sentiment_label":0}
{"id":"1cd5kfn","text":"Give her a mouthful of English Mustard. She'll be squealing back to Cape Town.","sentiment_label":0}
{"id":"1d5hsxf","text":"When did playing dress up become an identity. \n\nWhere else do we accept someone dressing up as being something to \"celebrate\"? Its like someone dressing up as a pirate or an astronaut to \"live their authentic selves\" being seen as heroic. \n\nImagine someone claimed to be Japanese and dressed in traditional Japanese clothes every day and a group of people set themselves up to \"celebrate\" how Japanese they truly were and supported 45 year old men dressing in Japanese clothing reading to children in order to help validate their Japaneseness. \n\nI clearly have too literal a mind and think too straight. I just see a man dressing how a teenage boy thinks a certain type of female that teenage boys imagine exist dresses. I just cannot pretend hard enough and get on board with this movement. I guess this makes me deeply immoral in modern culture.","sentiment_label":0}
{"id":"1cbesis","text":"These people have no education and no rational basis for their bollocks.\n\nNo need to bother trying to engage them\n\nEnglish nationalists ffs! Might as well talk to your dog and get more sense","sentiment_label":0}
{"id":"1chdm7r","text":"Don't forget the fun facts about the United Kingdom.\n\n- Has porten down.\n- Has Avon Rubber factories.\n- Has the seventh biggest NATO CBRN kit stockpile.\n\nGovernment widely decided to use its industrial base and stockpiles to prevent the pandemic from killing its citizens, nah that's a fucking joke, mid-level managers stole all the funds and then with what was left Imports of shitty bayonet mount JBL respirators from China instead of having government factories ramp up production of military grade 40mm NATO standard comfortable respirators like the C50\/FM12 etc that are rated for much higher levels of threats than a simple biological virus, and have basic things like communication projection and internal microphone ideal for use in medical and general use.\n\n(Oh yes they also make there own P3 and ABEKP3 filters in domestic factories)\n\nDid I mention airtight drinking systems? (Since the 1980s in all competent military respirators)\n\nIsrael was the only country in the world that had half preparation for this because they gave respirators to all of their citizens for practically two decades for free, because biological attacks are so affordable to carry out and so affordably easy to counteract if you own the bloody factories.\n\nDying empire is a bit of a joke honestly.","sentiment_label":0}
{"id":"1d5hsxf","text":"Yeah no sorry, I find the accusation of being obtuse to be grossly offensive.\n\nDrag was every bit of a part of the likes of pantomime through my childhood and it never once was sexualised.\n\nI think for *you* if you're making the link between drag and it being sexualised then I would say it's definitely you that has the issue here.\n\nThis is only now an issue because of anti-lgbtq sentiment that's being driven by religious groups.","sentiment_label":0}
{"id":"1ckrypm","text":"Nearly half a million people took part in one of the protests London, these are citizens of the UK and that muppet calls them all the names under the Sun. Elected to represent, unify and better the community but all she does is sow dissent. She’s been fired twice and doesn’t deserve any platform but for some reason she’s been doing the media rounds.","sentiment_label":0}
{"id":"1d69hhx","text":"I happen to like quirky stories like this. I find them entertaining. I guess you just want death, crime, and politics stories, yeah?","sentiment_label":0}
{"id":"1d57y5r","text":"I don’t even own a log burner but fuck right off, Taylor Swift is flying to the other side of her house in a private jet, but we can’t keep warm burning renewables? Nuh uh","sentiment_label":0}
{"id":"1cgvkaj","text":"I used to see a lass from East Marsh. Half the street had boardered up windows with people living in them. Utter shithole it was.","sentiment_label":0}
{"id":"1d646l7","text":"What the hell is a UK Republican?\n\n\nIs it like being a Ugandan Tory? Or a Haitian Lib Dem?","sentiment_label":0}
{"id":"1bnc9cx","text":"I love cashew’s","sentiment_label":1}
{"id":"1d2ua2s","text":"It's because it includes payments from private pensions too. Pensions are basically treated as normal income taxable income.\n\nPersonally I think it's absolutely insane this is even being discussed. What should be happening is that income tax bands move upwards specifically to benefit people who are cash poor.\n\nThe reasons why removing this tax is insane:\n- It primarily benefits wealthy pensioners. It's a massive gaping hole through which cash rich people will funnel money if they can just take gigantic tax free pension payments in year 1 of their retirement\n- shifts even more tax burden to young people, who provably have higher living expenses (rent, transport, student loans) than most all pensioners.\n- Young people probably won't get the same deal as pension age gets yanked out of reach.\n\nWe really don't need policies giving loads of cash to wealthy old people who don't contribute to productivity.","sentiment_label":0}
{"id":"1d3f986","text":"Even if he was actively dealing heroin right now, it wouldn’t surprise me that Gullis would associate with him.","sentiment_label":0}
{"id":"1d691xq","text":"He’s on a visa, so not actually entitled to anything. Go and ask Assad for a handout.","sentiment_label":0}
{"id":"1czhxmd","text":"Yeah it really is a sorry state of affairs when you can't buy anything in britain with $3","sentiment_label":0}
{"id":"1d5or7g","text":"A lot of hippies were always selfish twonks who moaned about the postwar welfare state (which did far more than they ever did to improve people's lives) while simultaneously being just as big a crowd of stooges and grifters as the people they criticised","sentiment_label":0}
{"id":"1bn09ra","text":"Fair play to him,well said.","sentiment_label":1}
{"id":"1cxvqxm","text":"It’s criminal that it was a water company made for profit! Scottish water absolutely embarrasses England. Makes me feels soo patriotic.","sentiment_label":0}
{"id":"1d3xo7e","text":"You said we can’t defend ourselves. We can. The law specifically provides a defence for the protection of life.\n\nSilly To suggest we can’t defend ourselves","sentiment_label":0}
{"id":"1bnlwem","text":"And to think that Keir Starmer has had 14 years to fix this issue! Ridiculous.![gif](emote|free_emotes_pack|poop)","sentiment_label":0}
{"id":"1d5tdx5","text":"I don’t think there has been a single job he hasn’t had to leave for some form of dishonesty. His only reason for trying to be prime minister seems to be because he thought he deserved to be and for his own advantage. I did at least think it was possible that his total lack of any ideological values and desire to be liked could *possibly* result in doing something for the country but unfortunately a mix of COVID and himself put paid to that.","sentiment_label":0}
{"id":"1d1c2rm","text":"So they saying if you don't want to\/ can't serve in the military you can do social work such as working for the nhs, carr environment or clean up the area. So basically do the fucking government's job to hire staff but do it for cheap. Also there's no repercussions announced.\n\nIt also punishes 18 yo who go straight out to work after leaving school, as say their a porter at a hospital on a Monday to Friday, off the weekend to do their national service the Saturday and Sunday at the same hospital for probably less money, makes no sense to me.","sentiment_label":0}
{"id":"1bzv2q8","text":"The Express has been rather unsucessfully predicting the WORST WINTER EVER!!! for the past decade at least :)\\~ I'm still waiting.","sentiment_label":0}
{"id":"1d5ysl2","text":"I'm sure there's a perfectly good reason as to why they've not done this in any of their 14 years in power...","sentiment_label":0}
{"id":"1cqh07s","text":"My in the lunch line buying it for £1.20 (so expensive)","sentiment_label":0}
{"id":"1d5k060","text":"There is a bit of butt hurt going on there","sentiment_label":0}
{"id":"1d2lemw","text":"That’s the consequence of demographic and cultural change. Different stories, with no relation to the UK (its landscape and history), are being told or created. Personally I wonder how long it will be before Stonehenge becomes our version of the Bamiyan Buddhas or St Paul’s Cathedral another Hagia Sophia. Now for the outpouring of hate for another’s opinion!","sentiment_label":0}
{"id":"1d6810g","text":"Stop propagating nonsense. The whole tourism shtick is bollocks. People visit to see the country, not because of a posh nonce family.","sentiment_label":0}
{"id":"1d35f32","text":"It’s such a scummy industry.\n\nServes absolutely no purpose. A platform levying a fee is one thing but reselling at a high premium is just rewarding those who nefariously horde tickets.","sentiment_label":0}
{"id":"1d4doel","text":"\"He liked to work around the clock and even out of hours to ensure customers were satisfied.”\n\nWeird how the comment has two references to time, when it was watches that were stolen. \n\nIt just reads odd considering the context.","sentiment_label":0}
{"id":"1d3zcb4","text":"I’ll have to try one of these tomorrow morning, thanks!","sentiment_label":1}
{"id":"1d3ril4","text":"A completely unknown blog posting industry friendly research without any reference to academic research that may show the opposite effects?\n\nHmmmmm. \n\nIf you are not familiar with an area of research, stick to sources you trust to be able to give more nuanced analysis of something this complex. Dont just trust rando blogs with agendas.","sentiment_label":0}
{"id":"1crm6ju","text":"People are conflating  the idea that the evidence presented shouldn’t have been enough to convict her with the idea that she is “innocent”.","sentiment_label":0}
{"id":"1d37ehu","text":"> mans just a civvy\n\nAs are, of course, the police.","sentiment_label":0}
{"id":"1d4xckp","text":"What a selfish bitch, I’m so sick of how entitled these waspi women are. The only people they have to blame for this is themselves, apparently personal responsibility doesn’t exist in their world. The only person responsible for someone’s financial planning is themselves. If they want to go back to gender inequality maybe we should strip their right to vote as well.","sentiment_label":0}
{"id":"1d6ccd4","text":"I have seen people driving 30-40k cars stealing. So surely they can afford it. Also working in retail made me realise that anyone can steal.","sentiment_label":0}
{"id":"1d5zbcu","text":"Yes so this issue has been around for ages with doctors pensions. It’s not new. Doctors have been campaigning about this issue for a long time, for which the conservatives have been in power and done nothing about it.\n\nMore bollocks as usual from the traitorgraph","sentiment_label":0}
{"id":"1c69m96","text":"What wilt be, wilt be. Has anyone remembered to water the poor woman this time?","sentiment_label":0}
{"id":"1d4e1pp","text":"This country needs change and Starmer isn’t that change.\n\nThe guy can’t keep to one policy he’s promised, there are already divisions in Labour which will exacerbate once Starmer is in office.\n\nI don’t trust Starmer will achieve much in office, being boring or not a Tory isn’t enough.","sentiment_label":0}
{"id":"1boxsgn","text":"To put this is context, a year is 8,670 hours.   \n\nWhich I think means - but someone please correct me - that there were the equivalent of 461 outlets pumping out raw sewage 24\/7 in 2023\n\nThis is utterly horrifying.   Clean Water is a fundamental human right, and a natural monopoly \n\nOne might possibly attempt to construct an argument that if these were British owned ventures doing their best we should cut them some slack\n\nHowever, like everything else, the uk water industry was sold off by maggie in the ‘80s.   Not only that, the government took on £45 billion of debt  - or more accurately made taxpayers responsible for the debt.   \n\nmultinationals, private equity and hedge funds that now own uk water companies are absolutely gleeful that they don’t need to do any expensive sewage management because the tories have made it clear they don’t care about that.","sentiment_label":0}
{"id":"1beomjd","text":"He’s right, history will not judge this time kindly.","sentiment_label":0}
{"id":"1cagoow","text":"They know that smearing works. Convince everyone that the police can no longer help Jewish people and to ban the marches.\n\nBy the time stuff like this comes out the damage is done.","sentiment_label":0}
{"id":"1d5or7g","text":"Careful! I heard she needs to drink the blood of a virgin every full moon or the lizard people will come to take her away.","sentiment_label":0}
{"id":"1c5hfr0","text":"Especially with the trump and garage comments. Both twats that should be deplaneted","sentiment_label":0}
{"id":"1d3ywj7","text":"“You guys are saving?” Im living on the breadline. Welp another 55 hour week incoming. \n\nJoke of a country.","sentiment_label":0}
{"id":"1cj657s","text":"Totally did it on purpose because he is an attention seeking narcissistic cunt","sentiment_label":0}
{"id":"1d5l3e9","text":"Terrific. \n\nOn thyroid meds, adrenal steroids, migraine meds, and others for over 20 years, and about to be dxd and medicated for ADHD. \n\nI’m already having to use pharmacies other than my usual GP pharmacy, and have already had trouble getting migraine and anti emetic meds. \n\nHow the f has this been allowed to happen? \n\nThey risk literally killing people with shortages of thyroid, adrenal, epilepsy meds, and other treatable conditions aren’t a bundle of laughs if you can’t function in any capacity without the prescribed meds to make them more bearable. \n\nAdrenal crisis will land people in hospital. Anti epileptic drug shortages will land people in hospital. Dehydration from excessive vomiting will land people in hospital. Etc.\n\nAnd that’s not taking into account the difficulties with getting out of the ambulance queues at the moment.\n\nJesus.\n\nThe ramifications are horrendous.","sentiment_label":0}
{"id":"1bw1pq7","text":"We need to get rid of the greenbelt and build outwards from all our major cities. All our cities need to expand 50% to absorb our Net migration rates of 700.000 a year. Then connect them through greater infrustctructe. \n\nIt's the NIBBYS who are the problem.","sentiment_label":0}
{"id":"1d1mt4t","text":"Nothing to do with National Service, all the youngsters loathe them and have done for years.","sentiment_label":0}
{"id":"1cnn7zk","text":"If you want that, the first bit of advice is not to vote Labour or conservatives, not that being on benefits is actually worth squat, but if you keep voting Labour\/conservatives nothing changes. If you do change your vote, don't vote for any posh twit or Farage and the like.\nThen you'll see real changes.","sentiment_label":0}
{"id":"1ca0v08","text":"This guy is a fraud, anyone defending him is a troll, paid hasabara trolls. Dont prent otherwise. \n\nGuy had bodyguards and a film crew follow him for 3 hours. So he could start trouble. He was warned several times for walking against the flow.","sentiment_label":0}
{"id":"1brspxf","text":"In that case I await developments with interest!","sentiment_label":1}
{"id":"1d1pwwl","text":"I love this template. ","sentiment_label":1}
{"id":"1d430lz","text":"If Labour could avoid imploding when it matters for once, that would be great.","sentiment_label":0}
{"id":"1caauel","text":"There was a photograph taken here new years eve that looked like a rennaisance painting, with police restraining someone of the ground, a drunk man casually reclining in the middle of the road with a can of beer, drunk women screaming at other, and just general pandemonium.","sentiment_label":0}
{"id":"1bn9s9s","text":"When our political class want more money for foreign aid or hotels for refugees they appeal to our need to uphold our \"international reputation.\" Of course they'd laugh if you suggested our having the worst value housing in the developed world is also a part of that reputation.","sentiment_label":0}
{"id":"1d4z7k4","text":"A heavily sellable product with very slim proof of cancer reduction.  Sounds like a pharma bros wet dream.","sentiment_label":0}
{"id":"1d5tdx5","text":">we are of course setting new standards\n\nLet us compare.\n\nTrump: \n\n* Met with foreign agents behind closed doors\n* Engaged in corruption and nepotism\n* Repeatedly lied and abused his office\n* Helped to ferment an insurrection against the US Government\n* Used the Supreme Court to aid him\n* Broke the law\n* Has been \"on trial\" for 6 years, with massive fines and possible prison\n* May be elected again.\n\nJohnson: \n\n* Also met with foreign agents behind closed doors\n* Also engaged in corruption and nepotism, literally ennobling family members and honouring his young female \"hairdresser\"\n* Also repeatedly lied and broke Parliamentary standards\n* Lied to the monarch, personally unlawfully suspended the democratically elected Parliament in an attempt to bypass the government and directly rule the country through his office in order to crash the country out of international treaties and break legal international obligations\n* Attempted to turn the people against the Supreme Court and subvert its independence\n* Broke the law\n* Received no punishment\n* Was re-elected with a massive majority\n\nTrump is a worse person, but at least he's faced some repercussions, and in some ways what Johnson actually managed to do (ie: actually suspending the government) was worse.","sentiment_label":0}
{"id":"1d5o3mj","text":"Some Conservative MPs really hate the NHS. It's Labour's creation, they view it as unsustainable, and they would love to privatise it all. It can only be done bit by bit as carrying out an outright, wholesale privatisation like they did with so many other industries would be politically suicidal.","sentiment_label":0}
{"id":"1d1ymrj","text":"the Tories being bad doesnt make labour good lol. They are both as bad as eachother. But I give it to you that atleast the damage labour will do to the country will be sudden enough and wide spread enough that it will kick the tories in gear to at least try to not be corrupt.","sentiment_label":0}
{"id":"1cm7oie","text":"LOL, you think the gov just said look! that couple has 2 beds spare and forced them to sell their house? I hope the gov don't find out I have a spare room or two! HAHA","sentiment_label":0}
{"id":"1c3molo","text":"Maybe you wouldn't get dumped by everyone with a conscious if you didn't model your values on being the next Alan B'stard.","sentiment_label":0}
{"id":"1d5vktv","text":"Both parties are fucking useless let's be honest, dismantle parliament.","sentiment_label":0}
{"id":"1b3dvld","text":"Kill them all.","sentiment_label":0}
{"id":"1bno8wv","text":"This is called gaslighting. We all know the Nike England flag is taking inspiration from the bisexual flag and is meant to be virtuous. \"To unite and inspire, modernisation of the flag\". It's not meant to be a cool colour swap without meaning, it is objectively a political message","sentiment_label":0}
{"id":"1bn9s9s","text":"The article says we live in the most cramped spaces comparative to the amount we pay compared to any advanced economy. That includes Japan where you can rent literal box rooms, but the point is that they won't cost you half your take home pay is the key point. It's very reasonable to rent a box room in Japan, where as it's extortionate in the UK.","sentiment_label":0}
{"id":"1d01a3d","text":"While you are strong appear weak and... When you are weak appear weak and have a day at home.","sentiment_label":0}
{"id":"1c5hfr0","text":"Yes you are all wrong","sentiment_label":0}
{"id":"1d1c2rm","text":"Seriously tho, what point does mandatory service serve. No conscript is gonna be motivated because of some russian attack on mainland europe and are gonna end up as cannonfodder.","sentiment_label":0}
{"id":"1d5jgvb","text":"So they haven't actually been fined. Misleading headline.","sentiment_label":0}
{"id":"1d5wzpn","text":"What a heap of shit. \n\nWhy does the government not pummel companies who miss deadlines like this and fuck everything over for the rest of us?","sentiment_label":0}
{"id":"1cecloh","text":"\"Imagine a white European saying that about another ethnicity or religion\"\n\n ...\n\n \"Imported people\"\n\nDouble standards much?  \n\nAlso, \"Imported\" implies that someone has paid to have them shipped here. They may have migrated, they may even have been traficked but they definately have not been imported.","sentiment_label":0}
{"id":"1bbgqdi","text":"The tories are the only party that can get us through this economic uncertainty that they've spent the last 14 or so years causing.","sentiment_label":0}
{"id":"1d69mzd","text":"They didn't feel like saying minus 1 million via the asylum amnesty then?  Or whatever their brilliant pull factor is about to attract.  \nAnyway there is the Achilles heal exposed, although Tory were too stupid to be any use either.  But at least they tried.","sentiment_label":0}
{"id":"1bk83rc","text":"When the democratically elected government by the people for the people don’t listen the people because they know we will not do anything. It is time to teach them a good lesson so no one will dare to repeat it again in the future. Are we going to do it? Short answer is NO\n\nPolice force has more time to mess around with peaceful protests than dealing with crime. Are we going to do anything about it? Again the answer is NO.","sentiment_label":0}
{"id":"1d4uto8","text":"As with most Labour problems - JUST FUCKING TALK TO EACH OTHER.","sentiment_label":0}
{"id":"1d67ul5","text":"I hope it’s not the case but the way this reads it looks like it could be taken to create nonsense apprenticeships like we have seen in the past. Strongly believe in apprenticeships but if it’s not genuine skilled work the entire thing is a con.","sentiment_label":0}
{"id":"1d3u1tf","text":"Regardless, Diana, who died when Minaj was what, 15, definitely wasn't her \"dear friend\".\n\nSome bullshit indeed.","sentiment_label":0}
{"id":"1bacu7m","text":"Fuck...we can't win anything","sentiment_label":0}
{"id":"1d35bq6","text":"We need to have a national discussion on why the editor felt comfortable putting “White” in the title of this article.","sentiment_label":0}
{"id":"1d3ywj7","text":"What is this thing \"savings\" they speak of.\n\n\n Heard about it, never seen it","sentiment_label":0}
{"id":"1d4uhul","text":"Fuck that. Full driving ban. Tear up their licence. Crush the van and bill therm the cost of that plus the cleanup.","sentiment_label":0}
{"id":"1cbesis","text":"This sub is so funny.","sentiment_label":1}
{"id":"1d3lvmd","text":"The real cancer on this country is men like him","sentiment_label":0}
{"id":"1bdocva","text":"Makes more sense to just bar his company from getting further contracts whilst he is running it. Board of investors will quickly jettison him. Then again if the government only worked with nice people it would be very expensive and rather impractical.","sentiment_label":0}
{"id":"1bdru52","text":"Yeah OK, I see what you mean.\n\nIt should be as simple as.. the job goes to the best prospect, race should not even factor into it.\n\nI hate how the more progressive and woke this country gets, the more problematic it is... Its like our culture is self harming","sentiment_label":0}
{"id":"1d6810g","text":"Which makes this even more laughable.","sentiment_label":0}
{"id":"1bp0vhr","text":"The British Museum recognise theft?","sentiment_label":0}
{"id":"1biil4d","text":"Disgraceful, religious beliefs should be kept to One’s place of worship.\nDo not force or ask other people to react to your beliefs , what next , the I’m a fridge mob will be spouting their manifesto too?","sentiment_label":0}
{"id":"1bzzvtn","text":"Yeah but a Freddo is £750\n\nAnd we still don’t know who LOD **H** is.\n\nAnd every baby born is legally owned by the Amazon\/Disney\/ Nestle\/ Blackrock conglomerate.\n\nBut at least is sunnier, above ground that is, so I’m told, only another few years or decades, they say, before the nuclear radiation fades away. Still, mustn’t grumble.","sentiment_label":0}
{"id":"1clde3h","text":"Never understood our government's idea to throw unreasonable restrictions at farmers in this country, then allow the mass importation of meat from the EU, where they don't have the same restrictions. What's the point? They do the same thing with our fishing industry. So many sustainable fishing laws, many of which involve throwing back half the day's catch. Then we import fish from countries with no such laws, as well as allow EU fishermen to fish in our waters, again, with no such restrictions on them.","sentiment_label":0}
{"id":"1czhxmd","text":"I have beer in the fridge and pizzas in the freezer. I think I'll be fine","sentiment_label":1}
{"id":"1cbusni","text":"What about Russian Fascists committing genocide?","sentiment_label":0}
{"id":"1d1jb3h","text":"Especially red Leicester cheese\n\nFantastic photo","sentiment_label":1}
{"id":"1d38vhm","text":"Here come the moaners telling us how unfair it is that their gran will die because workers are sick of being shafted. \n\nTake your gran private then - that's the way this is all going anyway. Get a taste of what's to come.","sentiment_label":0}
{"id":"1cxehqx","text":"She'd look right at home with a black peaked cap, an eye patch and a cigarette in a very long holder.","sentiment_label":0}
{"id":"1d4e1pp","text":"Yeah, not buying this horse shit I'm afraid. \n\nTime for the Tories to fuck off. They've run the country into the ground over the last 14 years. \n\nMakes me laugh that they think people haven't forgotten about the abysmal response to COVID and partying in 10 downing street, when anyone else would have been arrested for doing the same, letting companies pump raw sewage into lakes and rivers. \n\nEnough is enough.","sentiment_label":0}
{"id":"1biil4d","text":"I saw a post by them saying that they are doing this to 'show the diversity at the Station' so are they going to be putting up Torah verses for Passover or Bible Verses for Christmas or is it just for Islam?","sentiment_label":0}
{"id":"1d569vw","text":"Feminists don't give a shit about men or being fair. Just whatever they think benefits them at the time.","sentiment_label":0}
{"id":"1d3dwhv","text":"But they'll keep putting council tax up I'm sure, whilst not averting homelessness (which are probably partly caused by people falling behind on rent due to rising bills, including rising council taxes).\n\nSo much for the Tory tax cuts. Council tax is regressive and needs overhauling.","sentiment_label":0}
{"id":"1cji78e","text":"Tick tock goes the clock on rishis  and his career ","sentiment_label":0}
{"id":"1d646l7","text":"Bunch of weirdos telling everyone how little integrity they have.","sentiment_label":0}
{"id":"1bq6tfs","text":"Fuck I can almost make out whats in the picture","sentiment_label":0}
{"id":"1boxsgn","text":"Yet when people DO protest about something they care about at get \"THEY'RE BLOCKING MY COMMUTE TO WORK!!!\"","sentiment_label":0}
{"id":"1d5k060","text":"Knock? Think they just post the card saying they tried and leave the parcel in the van.","sentiment_label":0}
{"id":"1d4d0pl","text":"We're starting to get the fentanyl zombie problem too. I don't want London to go the same way as major American cities. ","sentiment_label":0}
{"id":"1bv42jy","text":"How? They’ve lost their freedom of movement thanks to people over 50 who enjoyed it themselves then stole it from the younger generations in 2016. Only about 10% of under 50s would qualify for any kind of permanent work visa in any country. Compare that to 100% of brits free to live as long as they want in any EU country.","sentiment_label":0}
{"id":"1d3hlsq","text":"Stoke on Trent City Council still being absolute cretins instead of doing their job to a minimally adequate standard I see.","sentiment_label":0}
{"id":"1blwc70","text":"This thread:\n\nPoverty, homelessness, cost of living crisis? I sleep.\n\nSomeone changed a colour on a a flag  “IM SO MAD WITH THESE WOKE LEFT WING CORPORATIONS THIS IS WHY IM RIGHT WING”.\nHave some perspective and focus on the real issues you gammons ","sentiment_label":0}
{"id":"1d5h0ce","text":"Teesside is already barren enough without foreigners draining food banks. You’d be hard pressed to find anyone there with a higher education, so these foreigners are literally more privileged than the locals living there who are forced to use those food banks. The locals don’t have the option of returning home where they’d be considered well-off, and they certainly don’t have savings.  \n\nI only made a comment the other week saying this is the worst place I’ve ever been in the UK. Just poverty and drug abuse everywhere with no hope in sight.    ","sentiment_label":0}
{"id":"1bd38hx","text":"Oof. \n\nWhat is it with this country and only using very temporary and sht solutions to everything?","sentiment_label":0}
{"id":"1bacu7m","text":"Unacceptable. How come we aren’t number 1! Try harder lads","sentiment_label":0}
{"id":"1chgol2","text":"The hypocrisy of this stuff is astonishing. EU calls UK barbaric for sending migrants to Rwanda, but is happy to send them here knowing they'll be deported to Rwanda. Also expects UK to take back migrants who leave, despite France refusing for decades.","sentiment_label":0}
{"id":"1b27yrw","text":"This took me a few seconds to get... but once I got it... yep I agree a game changer. Will do this forever. Thankyou brother\/sister ","sentiment_label":1}
{"id":"1awfvj5","text":"He looks like bad breath.","sentiment_label":0}
{"id":"1d5rny5","text":"Unfortunately this is not the \"ITV rigged the public vote\" super scandal I was hoping for. Its a twitters storm super fan tin foil hat conspiracy.","sentiment_label":0}
{"id":"1cogq3r","text":"You lot can sit here and sulk and call the Police all sorts of names. Officers work day and night to protect law abiding citizens and your disrespcting them. At the end of the end, anyone irrespective of any race will be behind the bars if they commit crime of any sort. If you act like an anarchist and an anti-police hooligan and can’t abide by  the law, you will feel the full weight of the law. Social media means responsibility. When the cops said act responsible, please do so. Don’t act hastily. You decide how you want to be treated at the end of the day.","sentiment_label":0}
{"id":"1bd3j0w","text":"Finally a joke after having such a ridiculous story shoved down our throats. Then we wonder why there are so many anti-royalists around.","sentiment_label":0}
{"id":"1crm6ju","text":"Because essentially, just because they speak English, they're nothing like us and their whole issues with conspiracies and living online in a world of negativity needs to eff off from our shores.\n\nThey're just looking for the next 'thing' to give them an adrenalin hit of feeling like their opinions matter.","sentiment_label":0}
{"id":"1bvw8av","text":"Just do, say and think the opposite of Suella Fucking Braverman and you can’t go far wrong in life.","sentiment_label":0}
{"id":"1bpyn8z","text":"What would be better is to eliminate private landlords entirely, and turn their extra properties into council houses which will generate income for the public purse and be feasible options for low income renters\/people who actually want to save to buy a house because of greedy grubbing bastard landlords","sentiment_label":0}
{"id":"1d2xgmo","text":"I can’t wait for Labour to take charge and fix everything like I’m being told on Reddit. They must have done a great job the last time they were in power to be held in such high regard.","sentiment_label":0}
{"id":"1bndxs7","text":"Fucking scummy wanker","sentiment_label":0}
{"id":"1d4doel","text":"Thieves need harsher convictions. I don't understand why in today's society they get off so easily, just 20 years ago I would ride my bike to the shops and leave it outside (no lock) and when I returned it'd still be there. Nowadays, thieves roam around with angle grinders knowing full well, no one is going to stop them and there will be almost no consequence if they get caught.","sentiment_label":0}
{"id":"1by6vom","text":"I've only known one Brazilian personally and the guy was pretty awesome. Straight talking and honest, with the stereotypical open love of the female form.\n\nOutside of that, I'm a Newcastle fan and we love Bruno and Big Joe!","sentiment_label":1}
{"id":"1d4s4nh","text":"\"subsequent testing aboard the destroyer\" - I bet that was fun, almost makes me wanna join the navy","sentiment_label":1}
{"id":"1bvu52z","text":"For some? He should have his passport taken.","sentiment_label":0}
{"id":"1bwgrlq","text":"Appalling journalism, this is meant to be the fact focused “Verify”. Absolute poverty is lower than it was in 2018 and is still below average for the 2010s, naturally mentioned absolutely nowhere. Minor credit they did at least passingly mention that absolute poverty for pensioners was at a record low. This omission while not technically a lie is pretty bad form especially from the wing of the BBC that’s meant to focus on fact and truthfulness. \n\nBut hey don’t let things like facts and wider context get in the way of the narrative you’re trying to “Verify”.\n\nEdit to make clear I’m not a Conservative activist, I just find almost all fact checkers to be very pretentious. Nobody has a monopoly on thought and nobody is above reproach when it comes to truth.","sentiment_label":0}
{"id":"1d1q9p0","text":"Don’t like what you read then ignore it. The Tories and Labour have already created divisions through their actions and inactions. Resorting to “Russian bots” when many of the British people feel the same way about the main 2 parties is foolish.","sentiment_label":0}
{"id":"1cgzte4","text":"Please have a read of 'declassified'.\nIt uncovers a lot of heinous crimes that the UK has committed. Things you wouldn't see publicised in a general newspaper.\n\nI wish people would stop blindly believing newspapers and those in power.\nThey want us to turn on each other so that we ignore the real issues.","sentiment_label":0}
{"id":"1cyq5o9","text":"There’s been a lot of people in her local community coming forward about the disgusting conditions those dogs were being kept in, I’m not disregarding that a life has been lost as it’s truly horrific but I can’t help but think if those dogs were walked, fed and cared for rather than spending their whole lives locked in cages without any stimulation or exercise this might not have happened. The world is in a sorry state at the moment, so much sadness.","sentiment_label":0}
{"id":"1cpo73e","text":"Alright, just don't buy it again then?","sentiment_label":0}
{"id":"1ccw3z0","text":"Starmer will get more votes if he's anti semite, ...most of the world is anti semite...","sentiment_label":0}
{"id":"1cn4u7j","text":"If the country had been a little less turbulent, I reckon she would have done a pretty good job.","sentiment_label":1}
{"id":"1c5ezyp","text":"That lettuce will be after Sunuk's job next.\n\nAlthough any produce would suffice.\n\nA cabbage for example...","sentiment_label":0}
{"id":"1d5x3ph","text":"They should be called the Welfare party. If you have a job, Labour will eventually take your money and give it to scroungers and bogus asylum seekers.","sentiment_label":0}
{"id":"1bkceki","text":"Nvm I didn’t see the “owned” part, what an utter waste of time , the council have essentially done absolutely fuck all","sentiment_label":0}
{"id":"1bij6ji","text":"It's so annoying that people are scooping up this pathetic non story about a talentless nobody and her mundane operation. We have genuine things to be concerned about. Outraged about. Things to match en- mass to downing street about and drag the snivelling government by their hair through the gutter about, but instead millions of dull witted people are obsessing over someone they don't know, will never meet and has no relevance to anything important and never will.","sentiment_label":0}
{"id":"1bsbuwn","text":"> Pretty much all cars are insured so they may well think there are no real victims\n\nI see you’ve never paid a recent insurance premium or seen your insurance rate jump when you lose your no claims bonus.","sentiment_label":0}
{"id":"1d4s4nh","text":"And tomorrow there will be 30 million on a different boat. Completely pointless","sentiment_label":0}
{"id":"1d0cxo0","text":"Going to say something controversial - but I actually felt kind of sorry for Theresa May, I don't agree with her politics but she was thrown so far under the bus by the tory party and then absolutely destroyed by the people who were nominally supposed to be her allies. And of all five of those goons - I think she was the only one who was actually \\*trying\\*.","sentiment_label":0}
{"id":"1ca5pfy","text":"High grade civil servants are usually the result of decades of specialisation. You get a few that are generalists with a talent for administration, or who have the rare talents of being a good public speaker being able to motivate staff. They can nearly always step into the private sector for more money and are hard to get to return after. It's a huge loss of investment even not including the price of the courses they took over the years at Sunningdale, now a nebulous online virtual 'campus'. They only stay because the benefits usually balance out some of the poor wage (less so with 60%, constant efficiency drives) or because the work is for the public good.\n\nTake away the concept of working for the public good and there's no reason to stay. When they all leave we'll be stuck with outsourcing, or the various consultants 'donated' by some of the worst people in the world. American Private Healthcare companies and evangelical anti-abortion activists mostly.","sentiment_label":0}
{"id":"1d5osrx","text":"They had hundreds of millions to dish out for levelling up and the only place to get any of it was that run down place in docklands, what’s it called ? Oh yeah Canary Wharf …… home to the likes of Credit Suisse and Citibank.","sentiment_label":0}
{"id":"1c28m8x","text":"Was it sold for £60,000,000 or was that the PPE baroness? I lose track.\n\nAh no this is over a potential £3,500 additional tax bill from 2010 which would be far less than the council tax paid for the property in the disputed period. Ok.","sentiment_label":0}
{"id":"1cb8gcc","text":"That isn't the case - so many wonderful doctors doing incredible work with a truly ungrateful and ignorant populace.","sentiment_label":1}
{"id":"1d6ayh9","text":"Makes me very angry. Few people know, fewer people care, about the abuse of attempts to maintain a healthy marine environment.","sentiment_label":0}
{"id":"1d490fz","text":"Me and my partner went to this last weekend it was absolutely woeful the both of us couldn’t believe how we had just basically burned £35 i think it was for the two tickets, don’t go near this if you’re a fan of lego, go to Brickfest (different to Brickfest LIVE) instead its a different event and way better, Brickfest LIVE literally tries to con people into getting tickets off the back of that event instead\n\nEDIT: my wifes just made me aware they’ve even took down their site after this \n\n","sentiment_label":0}
{"id":"1d2ww02","text":"A friend of mine's kid just finished his F2 training and the first thing he did was bugger off to Australia.\n\nIt amused me no end. Especially since he was 1st generation born to immigrant parents.","sentiment_label":1}
{"id":"1bkceki","text":"It’s a non-issue, a good start but what percentage of the billboards do they own ? Like I said definitely a good thing. \n\nTime to start promoting allotments and educating people on growing and maintaining their own produce for property owners would be a massive step, which I do believe happened before (maybe not uk) and failed miserably.","sentiment_label":0}
{"id":"1cb3wu7","text":"lol. mate where do these nutty takes come from. Dont tell me you believe what you read in the loss-making newspapers? The loss-making UK newspapers are only published to shape and neuter public opinion. The apologist is you, not Corbyn. But you dont even know that about yourself yet. Wow","sentiment_label":0}
{"id":"1bp56fu","text":"I like to imagine you comment on a variety of subjects while flexing your knowledge of the british road network","sentiment_label":0}
{"id":"1d679qy","text":"And it's not just outside, the air quality inside of the home is terrible if you open it a couple of times to put more wood on","sentiment_label":0}
{"id":"1d4e1pp","text":"While the time has come for the Tories I have basically zero positive expectations for Starmer and expect a continuation of decline under him. On the upside my expectations are so low it wont take much for me to be plesantly surprised. \n\n  \nI honestly hope Im wrong and Ive misjudged him, I hope he's amazing but I think give it 1-2 years for the novelty to wear off and there's going to be a lot of disappointed people that were expecting more from him.","sentiment_label":0}
{"id":"1bd38hx","text":"I dunno, this is AI pics done well I think - a person who can't draw gets a funny idea and can create it. I like that particular use if it.","sentiment_label":1}
{"id":"1d5o3mj","text":"Banger username.","sentiment_label":1}
{"id":"1bus5aa","text":"But I don’t understand.  According to Reddit, judges are beyond reproach, never have an agenda, are never wrong, and would absolutely never make decisions that are bad for the country on the most flimsiest of “hooman rights” grounds.    Something must be going on here.","sentiment_label":0}
{"id":"1c38d0z","text":"Got a Portuguese bloke at work , very hard worker well mannered.respect.","sentiment_label":1}
{"id":"1d41uik","text":"It's the firehose of falsehood method of contorting what people believe by having all statements be true and untrue at the same time.","sentiment_label":0}
{"id":"1d6aqxo","text":">“Therefore, supporters clubs of traditional Labour and Reform voters have been set up, to allow people to tell Mr Largan that they’re supporting him.\n\n>\"These are called Labour for Largan and Reform for Robert. Such supporters’ clubs are not a new phenomenon.”\n\nDoes Mr Largen think his constituents are as thick as he is?\n\nSpent some time in high peak and it wouldn't surprise me if they were.","sentiment_label":0}
{"id":"1d45m83","text":"She claims brown people are being discriminated against in political positions but I remember not too long ago the entirety of the UK was literally ruled by brown people!","sentiment_label":0}
{"id":"1d5l3e9","text":"Now this gov will be directly responsible for deaths due to how this will result in people dying.","sentiment_label":0}
{"id":"1bfcsgr","text":"donkey faced","sentiment_label":0}
{"id":"1d1octn","text":"I don't want either of them winning an overall majority.","sentiment_label":0}
{"id":"1d5ysl2","text":"Every tory that resides in this country, can get fucked.. Utter  duplicitous, degenerative, economic vampiric criminals. Good riddance to the shit stain party that is the Tories.","sentiment_label":0}
{"id":"1d601rh","text":"Is this the MP that has been pictured campaigning with a heroin dealer?","sentiment_label":0}
{"id":"1d3c1qu","text":"Such a shame, Radiohead helped me through some rough times. I’m more than happy to boycott these Zionist genocide-cheering pigs though, any relief these guys gave me is outweighed by their emergent inhumanity and lust for Zionist funds.","sentiment_label":0}
{"id":"1d42rxt","text":"I read the article. Jesus fucking Christ. I sincerely hope this pathetic excuse of a human gets what he deserves.\n\nI hope, really, really hope that the woman ends up being ok.","sentiment_label":0}
{"id":"1d5ls0c","text":"“Okay guys so we don’t give a shit about the poor people enough to actually sort the country out so any ideas?”\n\n“WE BLIND THEM WITH FREE FOOTBALL”\n\nThis country is so ridiculous.","sentiment_label":0}
{"id":"1d68acz","text":"Just as \"Boris Johnson\"s real name is \"Alexander Boris de Pfeffel Johnson\", and he's known to go by Alexander amongst his friends. But that doesn't quite have the *loveable goof* vibe to it does it?","sentiment_label":0}
{"id":"1d4yakh","text":"Every institution in this country hates young people.\n\nWoman gets attacked and responds with a gentle shove, and then BAM they're a convicted criminal.","sentiment_label":0}
{"id":"1d1dypl","text":"it's totally pointless and idiotic for several reasons but one is definitely that tons of money and resources would be wasted on training people for a year for them to never use that training. it would also incredibly lower the standards of our military if we forced everyone to join as to get in voluntarily requires you to pass rigorous testing and train for several years to very high standards","sentiment_label":0}
{"id":"1d1jb3h","text":"Lots of gorgeous bits of Leicestershire like this. Follow the Wreake out of Melton through Asfordby, Frisby and Hoby and there's lots of spots like this, but my favourite has to be the Soar flowing between Sileby\/Barrow and Mountsorrel, alongside the A6. Stunning in the frost in winter, and a great walking and fishing location in the summer","sentiment_label":1}
{"id":"1d569vw","text":"I mean men are murdered more than women... but we aren't allowed to talk about that, apparently.","sentiment_label":0}
{"id":"1d3xo7e","text":"Its great we cant defend ourselves. I really hope all four of them are all okay though.","sentiment_label":0}
{"id":"1chz835","text":"The city isn't great, but the county is lovely.  Near me we have some cool places like Bradgate Park, the Outwoods, Beacon Hill and some nice little villages like Quorn and Barrrow upon Soar.  Lots of green space and independent shops etc.  I'm from somewhere else but I've been living in Leicestershire for 10 years and I can't see myself leaving. \n\n(edited for words and flow)","sentiment_label":1}
{"id":"1bs9yf8","text":"If every use of a swastika ever, regardless of context, was unequivocally antisemitic and a public order offence\/hate crime, then the police would have to arrest a hell of a lot of cartoonists, for example.\n\nBefore anyone says \"but but but it was on a placard at a march\", 1) she is asking the police officer a theoretical question about swastikas in public and not to judge a particular incidence, and 2) even if it was on a placard, we don't know what it said, and the officer is still correct that the context would need to be taken into account.\n\nI am sorry if it upsets you that this police officer actually understood what his job is and how the law works.","sentiment_label":0}
{"id":"1bmj5p2","text":"I’m sure it well be legalised once people like Theresa May and her husband and all their friends have figured a way to monopolise the market before it even launches. Can’t have any old scrub getting rich and being successful can they.","sentiment_label":0}
{"id":"1axin0y","text":"Laughs in Scottish","sentiment_label":1}
{"id":"1cu0xh5","text":"I bet he can hear me.\n*Runs away*\n\n ","sentiment_label":0}
{"id":"1cpkok5","text":"Just rub salt in the wounds why don’t you\n\n(Spent hours trying to see it but clouds)","sentiment_label":0}
{"id":"1d5o3mj","text":"Wow this is insanity. We are so fucked","sentiment_label":0}
{"id":"1bvmp13","text":"Dismantle or  handicap israel","sentiment_label":0}
{"id":"1c3z1qo","text":"Worst thing to ever happen to Lancashire. I’ve met many a person from both Liverpool and Manchester that didn’t even know they were part of Lancashire till 1974. I’m from Urban (poor) Lancashire and there are 0 job prospects or transport links to Manchester- a train that runs once hourly. Blackburn\/burnley\/preston for their large populations are awful places to live to name a few.\n\nBorn in Blackburn, lived in darwen. Left 7 years ago and would hate to go back.","sentiment_label":0}
{"id":"1cncsbd","text":"Demand number 15:\n\n*Ensure insurance quotes don't cost more for someone called \"Muhammad\"*\n\nWTAF\n\nStatistically, I would imagine that insurance would cost more for a \"Muhammad\" because a \"Muhammad\" far more likely than a \"Michael\" to...\n\n* Live in an urban area\n* Live in a poor area\n* Park on the street\n\nWhen I moved from a village to a large town, my insurance nearly doubled.","sentiment_label":0}
{"id":"1bhpktw","text":"Is this the same Frank Hester that proclaimed that MP Dianne Abbott makes him hate all black women, and that she should be shot?\n\nThe same corrupt Frank Hester that gifted the tories £5m a few years ago to get his first pick at lucrative NHS contracts, and has managed to profit £130m from his little \"bribe\"?\n\nThat Frank Hester?","sentiment_label":0}
{"id":"1bm3bus","text":"Wow. Have you always been an unmitigated w***er, or only since the brain trauma?","sentiment_label":0}
{"id":"1bv42jy","text":"I'm studying a construction related degree right now and I don't know a single person who hasn't thought about emigrating. Before I went to university I took a few years off and worked in Italy when we were still in the EU, well that's all finished now so I don't see a future for myself in the UK as it's no longer a base through which to access Europe. My original plan was to work in the UK for a couple of years and then look for work in maybe France or Germany because why not, but that's become so much harder so I'm looking at New Zealand or Australia when I graduate.\n\nIt's common sense. This country doesn't value young people. Why would a 20 something with a valuable degree stay in the UK and have stagnant wages, shit pensions, crappy housing?\n\nMy brother is doing his doctor training at the moment and he's decided to stay in the UK because he loves the NHS and wants to give something back which is very noble. But for someone like myself who has had their life fucked by 14 years of tory bullshit and Brexit I see no future in the UK.","sentiment_label":0}
{"id":"1d35bq6","text":"We need to travel to keep the country running, and pensioners in their triple lock. ","sentiment_label":0}
{"id":"1c0qbo2","text":"Not realistic.\n\nNone of the players have gone bankrupt yet.","sentiment_label":0}
{"id":"1ck3c44","text":"I'm assuming you're a dude probably between the age of 16-25 looking at your jeans and emoji use. If that is the case then I assume your mates are the same age. At which point. They're just mates being knobs because it's funny. They're nice boots dude don't take everything to heart","sentiment_label":1}
{"id":"1d2y53i","text":"Just bloody nationalise them already! It’s not a market as there’s no competition, just foreign pensions and investment funds siphoning the British citizens bank accounts.","sentiment_label":0}
{"id":"1d5x2ir","text":"In Ireland (that distant, exotic land) generally there are no school meals.\n\nedit: oh look it’s being introduced in some places a few years ago.","sentiment_label":0}
{"id":"1d490fz","text":"You are just utterly pulling that price out of your arse mate","sentiment_label":0}
{"id":"1d4e1pp","text":"I'm not the biggest Starmer supporter but in fairness to him, he's doing what he needs to to win. Another Corbyn would struggle.\nI'm hoping he believes in a lot of what labour did then and that's he's just smart enough to keep it quiet. I know he wants to nationalise rail and energy, Iv heard him say he wants to abolish university fees but we can't afford it right now, I have no issues with this as long as I know they want this stuff and we'll get there eventually!","sentiment_label":1}
{"id":"1crm6ju","text":"The irony of Americans defending a baby killer is not lost on me","sentiment_label":0}
{"id":"1by8lcq","text":"I'd prefer chance that they don't use a weapon over certainty.\n\nYou may think that's victim mentality, but I'd rather be alive than not.\n\nMy phone and my wallet are no where near as important to me as my life.\n\n>  just stand there and have your stuff taken in the hopes they don't hurt you?\n\nYes.\n\nI'd rather meekly hand them over, get home in one piece and cancel my cards thanks.\n\nI'm a middle aged, slightly overweight, unfit  IT guy who hasn't been in anything approaching a fight in decades.\n\nFuck that noise, I'd rather get home in one piece than think I'm Jason fucking Statham and end up having my arse handed to me.","sentiment_label":0}
{"id":"1cimjpr","text":"Maybe the tories giving up to 80% cuts in funding to councils since 2010. Austerity making people ill and driving economic decline reduced tax take as less work is done too. \nTory government forcing councils to be \"more commercial\" and thus take massive risks on things like property & commercial projects. \n\nWatch Teeside...they're fucked. With Houchen having sold £130 million of land & £49 million of scrap to \"investors\" for £13 (yes THIRTEEN) & with a contract so badly written they can literally just walk away with the cash, those people up there are going to rightly be fucked over when THEY have to bail that out.\n\nBrum is an interesting take as it was tory \/ lib dem in the 00s that fucked it with the pay stuff. Then capita somehow got a project to save them £1 billion over 10 years which ended up COSTING the council £1 billion. Somehow Capita have got away on the sly with this & somehow still get work.","sentiment_label":0}
{"id":"1d5kmp9","text":"He doesn’t hate them. It’s worse than that, he doesn’t care at all.","sentiment_label":0}
{"id":"1cvmaaz","text":"![gif](emote|free_emotes_pack|grin)![gif](emote|free_emotes_pack|grin) Generally in old documents a Sargent was important, especially to the lower ranks. They had to be tough as old boots & sharp as nails. If you are looking into British Genealogy and you can't get much from the site you are on, have a look at british genealogy forum or if it's WW1 related the Long Long Trail forum. They both good & helpful","sentiment_label":1}
{"id":"1d68acz","text":"Remember when his thing was dressing like a paramilitary guy and rounding up all the old NF clowns for a reunion tour going up and down the country in a coach drinking special brew and making a spectacle of themselves?","sentiment_label":0}
{"id":"1bd3j0w","text":"It’s the cup of tea, isn’t it? They CGI a cup of tea????","sentiment_label":0}
{"id":"1d3i3mt","text":"So she has been cleared by the police, the police again, HMRC, the council…\n\nso I expect tomorrow for the press to have checked with judge Judy, judge Rinder, Tom and Jerry, sooty and the Pudsey bear","sentiment_label":0}
{"id":"1d2ttox","text":"Disgusting hag","sentiment_label":0}
{"id":"1c7chpv","text":"Back in my day when the world was black and white, freddos were 5p","sentiment_label":0}
{"id":"1ckrypm","text":"A large number of politicians are linked directly to Zionist organisations.\nIt's interesting how the British veterans of Palestine have been ignored and conveniently forgotten about.\nYou could make at argument that she is betraying their memory and the other victims of the Zionist Terrorists.\nThings like the king David hotel bombing, the murder of Lord Moyne,the murder of Folke Bernadotte,the Sargent's affair and all the other acts of terror.\nThere was even a letter bombing campaign in the UK  by Zionists.\n","sentiment_label":0}
{"id":"1brvrhg","text":"Lol you're brain damaged","sentiment_label":0}
{"id":"1c0tua0","text":"All those repairs and still a pothole… I’d expect nothing less ","sentiment_label":0}
{"id":"1clonsi","text":"Jesus christ the US is so fucked up rn","sentiment_label":0}
{"id":"1d5yr56","text":"This just shows it's time to outlaw football. Compared to the arrests at most matches, which nutters rant about banning, these are astronomically higher.","sentiment_label":0}
{"id":"1bmj5p2","text":"Cannabis should absolutely be kept illegal. Relative of mine started on that, then moved on to other drugs, ended up on heroin and assaulted police officers, while contributing nothing the society.\n\nHaving visited places in America where it is legal, the stench pervades everywhere and gave me a headache, and is obviously not ideal for kids to be around.\n\nIt is not harmless, and indeed it should hugely be cracked down upon.","sentiment_label":0}
{"id":"1cop1au","text":"You's some handsome people!","sentiment_label":1}
{"id":"1axin0y","text":"Drove from Milton Keynes to the Tunnel and down to the south of France yesterday. 15 hours of non-stop rain. Visibility was less than zero at times. Anyone know any good prayers I can offer to the sun god? ","sentiment_label":0}
{"id":"1cdhbxz","text":"This is basically correct, down to the part where it talks about Edmund, Edward and Æthelbert being patron saints of the Angles, Saxons and Jutes.\n\nThis is modern revisionist rubbish. They were not divided like this.\n\nEdward the Confessor died in 1066. This is well beyond the period when \"Saxon\" and \"Angle\" were distinct identities. The Kingdom of England was one kingdom by then, and they called themselves English.\n\nI also don't know what a \"white Syrian\" is. St George was a Greek.","sentiment_label":0}
{"id":"1d1c2rm","text":"The scheme theyre proposing isnt actually national service, its just the media spin.","sentiment_label":0}
{"id":"1d38vhm","text":"Good!!! Fucking remind the morons who are refusing to vote Labour in July or the GTTO candidate what life will be like if they vote Green or for the \"gaza candidate\"....genuinely fuck yourself if you facilitate a tory come back & then complain that your hospital has closed or that the NHS no longer does the surgery you need","sentiment_label":0}
{"id":"1cyijqb","text":"That would probably be a good idea, to be honest.","sentiment_label":1}
{"id":"1bospol","text":"No you wouldn't. You wouldn't care in the slightest.","sentiment_label":0}
{"id":"1d38bf7","text":"I blagged a flight in an RAF Sea King once and I can still vividly remember the smell now, hot exhaust fumes just constantly blasting through the fuselage, absolutely horrible. \n\nI did think at the time that it cannot be good for you!","sentiment_label":0}
{"id":"1d691xq","text":"Disability benefit processes are designed by the government and companies like Capita to punish those with disabilities, lie where possible and make the lives of disabled people as unpleasant as possible.\n\nWhy the independent only thinks this is newsworthy when it happens to a Syrian is however, a total mystery.","sentiment_label":0}
{"id":"1d5a8wa","text":"As a traffic cop, he will be trained to drive that fast, issue here is that he was doing it for no good reason.","sentiment_label":0}
{"id":"1d3hs54","text":"Posts such as this are why I still use Reddit haha","sentiment_label":1}
{"id":"1bs5y53","text":"\"There's nobody in the world like you!\" Speaking for myself I'd say thank God for that and so would everybody else! Happy Easter to you! Hello Spring at last!","sentiment_label":1}
{"id":"1d5x2ir","text":"100% exactly why this country Infuriates me. I have to pay for all these benefits cheats and their kids, and then they money they get they spend it on booze and tags instead of food.","sentiment_label":0}
{"id":"1ckr51r","text":"He announces plans to reduce benefits, not only is it tone deaf but it looks like he wants to squander it on Ukraine (where the truth is so edited that it can't be relied upon).","sentiment_label":0}
{"id":"1by6vom","text":"I’m married to one so definitely a fan, they’re warm and friendly but also incredibly loud and can be a bit over the top sometimes emotionally haha\n\nI’d say Brazilians are incredibly different from Brits in so many ways but they’re lovely people.","sentiment_label":1}
{"id":"1d4hrho","text":"How much marginal MW capacity would these even provide? It's not \"national security\" when the action doesn't make any meaningful changes.","sentiment_label":0}
{"id":"1b9xbmo","text":"Christ, who'd be a police officer? It seems soul destroying.","sentiment_label":0}
{"id":"1d496h0","text":"I don't like Rishi but give him a break. He and his wife are multi-millionaires. Had he bought a Decathlon backpack, he would have been criticised for pretending to be working class.","sentiment_label":0}
{"id":"1bcvprx","text":"Without the other images citing when people fabricated hate crimes against themselves, this stank of third party agitation or Jews punching themselves.","sentiment_label":0}
{"id":"1bdtrcv","text":"Not saying she’s perfect but she was treated horrendously by the media and her own party.","sentiment_label":0}
{"id":"1bate8h","text":"You’ll see scum celebrating shit like this. Vile wastes of life.","sentiment_label":0}
{"id":"1bwk2tv","text":"Could be Freddy Krueger","sentiment_label":0}
{"id":"1d35qlg","text":"'on balance Mao did more good than harm'.\n\nDiane Abbott on Chairman Mao. \n\nLabour may actually win an election for the first time in 14 years. \n\nWe just need the ship to hold steady, don't do anything stupid, don't fuck it up. \n\nThis fanny just jumped back on board and is rocking and howling. \n\nShe doesn't give a fuck about the country, and would rather lose, again, as long as she's in the spotlight.","sentiment_label":0}
{"id":"1bij6ji","text":"This aged well","sentiment_label":0}
{"id":"1c7ss1u","text":"wish they hadnt told me I had cancer ...","sentiment_label":0}
{"id":"1ay04mv","text":"People talk about shamima begum not being allowed back\n\nPlenty of UK people going over to join the idf, committing genocide and then returning\n\nKeep them out too the genocidal maniacs","sentiment_label":0}
{"id":"1d5kmp9","text":"'You'll love it' shouts this tory ghoul, who never did anything like this himself.\n\nI don't even know how it can be legal, to force someone to do something they don't want to do.\n\nSurely this is an afront to civil liberties at the very least?","sentiment_label":0}
{"id":"1d3yn7z","text":"Horrible. Have an additional twing of empathy partly for the awfulness of a Father getting their son in a horrible situation.","sentiment_label":0}
{"id":"1d5l0pg","text":"The thing about Brexit is that it lets you hypothetically do a bunch of stuff that you can't do in the EU, like control migration, intervene to support heavy industry, and be a lot more explicit in insulting the French.\n\nWhen Labour aren't campaigning to rejoin the EU, they can effectively attack the Government on their failure to do what they promised and what people wanted. When they campaign to rejoin the EU, the position flips, and the Conservatives can again make the argument to do all the stuff that they aren't actually doing. \n\nThe far more sensible strategy is to win power, demonstrate to left behind voters that the government is actually committed to helping them and can be trusted, and then explain why rejoining would offer this better than remaining outside.\n\nUnfortunately, that requires a lot of work. A lot of remainers care enough to tweet, but get quite bored at the prospect of actually coming up with a good solution for the parts of the country they don't actually give a shit about.","sentiment_label":0}
{"id":"1bwgrlq","text":"Its perspective. The poorest people in the UK have the same phones as the richest person in the world. Credit lending to play pretend rich because of social media pressures that’s started since the internet as we compare ourselves with people outside our own towns. \n\nThe government and big wigs are lining each others pockets while we sit defeated and tired in front of the goggle box with our microwave meals because the work life balance never shifted back post war.\n\nBoth sides of the argument considered there, we cannot compete with China and India for growth because we have more rules and regulations to protect us from predatory companies forcing the unemployed into extremely depressing production factories like the ones in China with suicide nets. \n\nBefore anyone gets high and mighty, ask yourself what are you doing to make your country better? All I see is litter and too many cars and not enough respect for each other as we push and shove back to our little castles.","sentiment_label":0}
{"id":"1bs5y53","text":"Someone walking past carrying a knife planning a random stabbing - thanks, yea I am awesome.","sentiment_label":0}
{"id":"1bz00ww","text":"It's fucking disgusting. Never opposed a single thing. Especially Kier, a former human rights lawyer. A pinnacle example of power corrupting.","sentiment_label":0}
{"id":"1d5osrx","text":"Completely empty promises, where does this money come from? Why didn't they do this over the last 14 years if they could have? Even if they did it would only go to tory-friendly towns anyway. Utterly desperate bollocks.","sentiment_label":0}
{"id":"1d45m83","text":"Immediately knew we’d see the word “Islamophobia”. \n\nThis is the environment people like her have created. She’s been accused of Antisemitism for the tweets she’s liked which I agree is soft, but this is the consequence of endlessly accusing people of different cultures and\/or religions of racism or whatever phobia should they disagree.","sentiment_label":0}
{"id":"1csuwqp","text":"> Although the party is expected to impose a shortlist of candidates on the local constituency party, it will then be up to members to decide.\n\nTruly a democratic labour party \/s","sentiment_label":0}
{"id":"1baofai","text":"This show sucks.","sentiment_label":0}
{"id":"1d3hlsq","text":"A public waste offence has definitely been committed here - the council wasting public funds and everyone's time.","sentiment_label":0}
{"id":"1ciqmak","text":"An interesting fact about Cameron and many of his inbred no-lip Eton compadres is that they are actually born without mouths and have to have a slit cut into their otherwise featureless faces when born. Those that don't have this procedure performed talk out of their arse instead which is their natural way of communicating.\n\nDon't trust the Tories, they are lying scum and only have their and their old boy network friend's interests at heart.","sentiment_label":0}
{"id":"1d3e02g","text":"The man should be dismissed. Making a mockery of the law. How much longer will we tolerate this corruption of our democracy.","sentiment_label":0}
{"id":"1d5hsxf","text":"We've taken kids to Panto for generations, and while the appeal to tradition is a shit one, it does somewhat show up the hypocrisy. \n\n>I think you have to be a bit obtuse to not understand why people could perceive it as creepy and inappropriate.\n\nI mean, I think people find it \"inappropriate\" because they assume that cross-dressing is only acceptable either as a joke or as sexual, so seeing sincere non, sexualised drag means that gender non-conformity is being given *respect* and this cannot be allowed.","sentiment_label":0}
{"id":"1bk1b4f","text":"Quicksand or drowning in the Thames, it is imperative we *do not make a scene!*","sentiment_label":0}
{"id":"1c0tua0","text":"That's right, send the team out on 20 separate occasions to inadequately fill in the potholes, vs one single visit to do it right.","sentiment_label":0}
{"id":"1d4b2s4","text":"* Step 1: Purge the unelectables.\n\n* Step 2: Don't engage in highly polarised issues that have no bearing on everyday people's lives.\n\n* Step 3: Don't say stupid shit that makes the Tories look like saints in comparison.\n\nLooks like a fine plan to me","sentiment_label":0}
{"id":"1d57y5r","text":"I've got one in my camper. I love using it. I'm going to keep using it. Don't like it? Boo-fucking-hoo for you I guess.","sentiment_label":1}
{"id":"1bx8eu0","text":"Don't do what the previous owners did in our place ... we moved in and noticed the hall floor didn't seem right in a couple of spots.\n\nHoicked up the carpet and there were holes in the chipboard just like that, except someone had repaired them with plaster. Actual wall plaster. To this day I can't get my head round their thinking.","sentiment_label":0}
{"id":"1d55iyg","text":"This is why I actively avoid tescos. It's bad enough that they're so expensive, never mind the added tax of not having a clubcard.","sentiment_label":0}
{"id":"1cjc4ta","text":"We're just so completely pathetic. \n\nOf course, try bringing your spouse here if you're a 25 year old brit in love and you don't have a chance. \n\nOur spineless system punishes people it has leverage over, and the people who just ignore it get left alone.","sentiment_label":0}
{"id":"1brcl81","text":":No no that can't be my son he is a good boy and is always at church with me\" ...smell the fuckimg roses love or look on his social media feeds mummy ..... guaranteeing will have drugs and hos...and weed and wads of cash and knives and rap songs all over them ...\n While still living at home with mummy ....well 'ard","sentiment_label":0}
{"id":"1c9kjse","text":"It's actually insane to me that people think importing millions of people into western countries who have vastly different sets of values will work out just because. Remember, we live in democracies. We are importing votes for these values we don't agree with.\n\nWe don't even allow for the possibility of integration and assimilation because we're letting so many in that instead of them conforming to our ways of life, they're changing our ways of life over tim","sentiment_label":0}
{"id":"1d4doel","text":"You’re right, comparable countries with harsh sentencing notably have less crime. \n\nWait, hold on a second…","sentiment_label":0}
{"id":"1cb0zq6","text":"I laugh at this because it's so damn true.\n\nI'm currently working for a government department and living in the boot of my car after being issued a section 21 and then evicted.\n\nThe council has not helped in any way and where I am situated there is no available housing (even house shares) or the housing available is way beyond the scope of my affordability.\n\nI'm broke, not financially but in spirit.","sentiment_label":0}
{"id":"1c0qbo2","text":"The point of Monopoly is to show that once someone has some money, it's really easy for them to dominate and nobody else can keep up. Monopoly was already describing 2024. Oh, it's also in the name.","sentiment_label":0}
{"id":"1bka6ay","text":"These articles are written by simpletons for simpletons.","sentiment_label":0}
{"id":"1balovb","text":"I didn’t say they did. I just wanted to know how many dead children is acceptable before one expresses agreement with ‘pro Palestinians’.","sentiment_label":0}
{"id":"1d2vpu1","text":"r\/UnitedKingdom has been a complete right-wing nutjob fest for at least the last 18 months.\nThe mods are out of control, and ban people for simply subscribing to other subs they don't like, they shut down sarcastic comments (in a sub about the United Kingdom....I mean, come on, if it's one thing British people are good at, it's being sarcastic), and basically they lost all sense of humour and common sense.\n\nIt used to be a decent sub for discussion about what was going on in the UK. There was some kind of mod recruitment drive, where they allowed semi-literate knuckle draggers to \"moderate\" posts and it basically turned into a complete fucking mess almost overnight.","sentiment_label":0}
{"id":"1bk83rc","text":"Our right to peaceful protest is danger due to bribed politicians working on behalf of a fascist state.\n\nOur democracy has been compromised- each politician who had accepted such “donations” from any foreign state, has committed treason and is unfit for office- they should be arrested.","sentiment_label":0}
{"id":"1bthc64","text":"Did you not understand the word \"off\" or the word \"fuck\"?","sentiment_label":0}
{"id":"1d5a8wa","text":"I most certainly can’t say the police officers get treated fairly. The occasional exception doesn’t contradict that general understanding.","sentiment_label":0}
{"id":"1d4qpab","text":"How have we got to 2024 and governments still don’t get that prohibition doesn’t work and creates more of a problem. The war on drugs for instance is just one big farce and drugs would actually be less of an issue if everything was legalised.","sentiment_label":0}
{"id":"1baofai","text":"Fucking hell that’s bad.","sentiment_label":0}
{"id":"1d4sb4p","text":"So, the way I see it, the way we are building at the moment is just ludicrous! We are forcing more and more housing into towns and villages that have completely unsuitable infrastructure. When we build, we need to do it properly. Build where people need it, build sustainable, appropriate, housing and build the supporting services with it.","sentiment_label":0}
{"id":"1cqh07s","text":"Buying a cold coffee from the fresh food to go section feeling like a fashionista im my baggy faded joggy bottoms, oversized hoody and crackhead teeth.\n\nLike yes darlings, look at me shopping in the reduced section.\n\nWhat a yellow tag on that bad boy \"can of tinned peas, for 5p you say, well this is elegant\"","sentiment_label":0}
{"id":"1c7xu7d","text":"These goons need to realise that the main reason Palestinians don't want to be refugees (or why their neighbours aren't taking them in) is because once they leave, they aren't going to be let back in.\n\nIt's why the Zionists keep pushing for them to leave. Why should the Palestinians leave their own land and homes? \nThe Facists should f*** off back to America and Europe, where they can revel in their Fascism.","sentiment_label":0}
{"id":"1d3a7po","text":"Sounds like a quick and cheap way to try and get rid of people stupid enough to take this ‘offer’. I hope they tell him to jog on and force him to pay a redundancy package.","sentiment_label":0}
{"id":"1d3gl60","text":"“U.K. prisons are not overcrowded! Go compare them to the most overcrowded prisons in the entire world, in a country that has been repeatedly called out for breaching human rights about this very issue!”\n\nDarling, we are not trying to compete for the worst prison system worldwide, rather we are trying to have a good one.","sentiment_label":0}
{"id":"1cijl06","text":"At least credit the source where you got this from: Spelling Mistakes Cost Lives","sentiment_label":0}
{"id":"1d67ul5","text":"Getting an apprenticeship changed my life. I was working a dead end career as a chef and an apprenticeship gave me a lifeline into the power industry. I really consider them valuable for the country and are an excellent policy for people who traditionally couldn't afford university (the middle working class, where maintenance funding and grants fall majorly short and parents could never afford to support them). For an extra year or two on a course, an apprentice comes out with the same academic qualifications but 4-5 years industrial experience. I highly recommend people trying to get on one.\n\n\n\n\nI support most of Labour’s policies, however I have to agree with the tories on this one and perhaps lean into the lib dems idea being the best. Rather than extracting funds for retraining, there should be additional funding. I can only see unscrupulous business (which is most) using this to utilise the apprenticeship levy to pay for routine staff training, likely redesigned as an in house delivery so individuals don't even get external certification to utilise.","sentiment_label":1}
{"id":"1cbusni","text":"Ukrainian fascists committing genocide...\n\nYou are either a liar or insane. Or both.","sentiment_label":0}
{"id":"1d0hcxd","text":"Awesome thanks for explaining!","sentiment_label":1}
{"id":"1d5hgek","text":"It would be hilarious if 8 mps defected to the lib dems if this happened, so the Tories aren't even the official opposition and get 5 years in timeout.","sentiment_label":1}
{"id":"1by6vom","text":"I live with half a dozen Brazilians and my GF is Brazilian, so I must say I like your people a lot. I also worked in Sao Paulo state for 6 months and had the greatest time (mostly due to the people) I look forward to visiting again soon","sentiment_label":1}
{"id":"1brd5pn","text":"Get rid of the lot. Parasites draining us of hundreds of millions while pensioners can't get their homes.","sentiment_label":0}
{"id":"1d4qqda","text":"And this is *their* estimates.    There's a good chance the real number is double or more, because they aren't exactly known for their accuracy when recording exactly how much environmental pollution they've caused...","sentiment_label":0}
{"id":"1d646l7","text":"They're the same type that say they live in London but really it's somewhere shit like Bromley.","sentiment_label":0}
{"id":"1csifgb","text":"It's a month window for everyone to find their ideal day off and event. \n\n\nThere is zero irony in an out-group's  intolerance of bigotry.\n\n\nAnd you're the one moaning.","sentiment_label":0}
{"id":"1bemjda","text":"If you say anything women don't like, they will have you thrown in prison. Must be nice to have the privelege to issue false accusations with impunity. \n\nWho's the oppressed group? The ones with the power to imprison anyone who displeases you or the ones being silenced and imprisoned?","sentiment_label":0}
{"id":"1ckr51r","text":" It’s just the shame that the first Asian got to be him and not someone elected by the masses.","sentiment_label":0}
{"id":"1d3z6i1","text":"Hahaha no. They will continue to fling shit.","sentiment_label":0}
{"id":"1d6ayh9","text":"This green peace campaign is what caused me to set up a regular donation. \nReal direct action!","sentiment_label":1}
{"id":"1cuktsy","text":"Suggestion: If you ever get over in N.I, you might as well go to Donegal as well (after visiting the Antrim coastline). It’s a stunning drive all the way up and around the north coast from Belfast and out west towards Donegal. Then head south.","sentiment_label":1}
{"id":"1b2ztw8","text":"That's basically the whole mentality. ''Yeah we do stuff of nightmares, but its a magical moment in our country''","sentiment_label":0}
{"id":"1bly5zf","text":"It's hair, who cares.","sentiment_label":0}
{"id":"1csfnv2","text":"You only have to speak to a police officer candidly for a few minutes to realise they are completely out of touch, hypocritical, prejudiced, and incapable of independent thought. I remember one copper telling me, I must be a criminal because I didn't want to talk to him, and another being adamant that cannabis is a gateway drug because every heroin addicts he had ever arrested also smoked cannabis. When I responded with \"but did they also drink alcohol and breath oxygen?\" He didn't get the point I was making. Wankers!","sentiment_label":0}
{"id":"1cntzlc","text":"It's not Israel that's the problem. It's everyone that supports them because of the USa.","sentiment_label":0}
{"id":"1cv8hgk","text":"Deranged and brainwashed","sentiment_label":0}
{"id":"1by2u4l","text":"North east - the people are super friendly. \n\nAlso, the Northumberland countryside is stunning, we’ve got some lovely beaches and we’ve got pretty great access in to Scotland. \n\nJust wish it was warmer.","sentiment_label":1}
{"id":"1d3gl60","text":"\"We're not as bad as them, thus everything is ok\"","sentiment_label":0}
{"id":"1cede54","text":"Insult to cunts, cunts are useful. \n\nNever seen an actual cunt grind down the working class to enrich their wealthy friends.","sentiment_label":0}
{"id":"1d1j2s0","text":"Then the kids have nothing to worry about considering we can't send the illegal economic migrants there anyway","sentiment_label":0}
{"id":"1cmj90n","text":"That pro-Israel lawyer was really grasping at straws lol","sentiment_label":0}
{"id":"1bkceki","text":"Don't sheffield council have more to worry about than what grown adults eyeballs are allowed to look at?\n\nJust another example of state overreach while the BBC and its champions cheer from the sidelines. It is ridiculous. Why aren't people allowed to decide things for themselves any more?\n\nEdit: I guess i shoulsn't be surpised, especially after covid showed just how hard people like to be told what do do and really love to tell others just how stupid they are for wanting to be left alone. You're all lost.","sentiment_label":0}
{"id":"1d4doel","text":"Its sad , obviously felt huge pressure and guilt after goods worth a huge amount were stolen ( millions!?) combined with the shock of a violent robbery. Shouldn't have been alone in that situation. rip.","sentiment_label":0}
{"id":"1d5h0ce","text":"Mass migration is a disaster. We really need to get back to a sensible number of carefully selected migrants or the whole ruddy show is going to explode.","sentiment_label":0}
{"id":"1cmdx4t","text":"I have a friend who left England to go to Greece and he's always saying England is a shit hole but it's like dude you've been telling me for years that Greece is so corrupt you can't even open the business you moved there to start. So what if it's sunny lol","sentiment_label":0}
{"id":"1bbj3fp","text":"Finally, we’re good at something","sentiment_label":1}
{"id":"1b2whi8","text":"Scumbags.","sentiment_label":0}
{"id":"1chgol2","text":"The problem is that Europe isn’t willing to do what is necessary to stop them at the source. In fact, it was a thing that some in Europe were actively telling them to come whilst a few countries were saying the opposite. \n\nEurope is divided on the issue. The tide is changing but it’s too little, too late and all we can do is look out for ourselves until they decide what exactly their position is.","sentiment_label":0}
{"id":"1cqw49x","text":"Really? Oh really? Is it because Rishi still thinks the Tories can win the next GE? To be that bad?","sentiment_label":0}
{"id":"1d4h19p","text":"So no more Covid jabs, hmmmm....\nThey found a way for you to take it again \nSheeple will follow.... ","sentiment_label":0}
{"id":"1ch4w16","text":"This is exactly what I thought when I saw the headline. Yes, let's teach people in this country that Israel is a terrorist state who murdered Britain's (as well as a very large number of Palestinians and others) to create their extremely religious ethno state. That's a very good idea. Well done, that MP.","sentiment_label":0}
{"id":"1d5k060","text":"I was so fucking good at that","sentiment_label":1}
{"id":"1cpo73e","text":"I did have a bottle of Pepsi the other day and it tasted exactly like coke zero. Is that why? It tasted rank.","sentiment_label":0}
{"id":"1d47cc5","text":"I’d like to point out that this party would disappear overnight if Labour or the Conservatives actually got immigration numbers down to sane levels and sorted the illegal immigration problem.\n\nIt only exists because of the mainstream parties ignoring the issue and letting it get worse.\n\nThe left has abandoned normal Brits on this issue, which is forcing them to look to the right for an answer.\n\nThe sole reason the right is growing in mainland Europe, Ireland, Canada and the US is because of the left’s insane immigration stance.","sentiment_label":0}
{"id":"1d69mzd","text":"That’s the concern for me. If they can’t make a drastic cut then forget about it. They won’t be any different","sentiment_label":0}
{"id":"1d4edfh","text":"I'm voting Green this election - sick of Starmer's factionalism. Don't know how anyone can describe themselves as left wing and vote for Labour in its current state.","sentiment_label":0}
{"id":"1d3a7po","text":"(If any Manchester United staff see this, please do not make a [statutory flexible working request]( which MUFC must accept unless it is for [predetermined reasons]( and if they do not accept, do not give a satisfactory reason and\/or fire you or treat you worse because of the request, then definitely do not [appeal ]( take them to an employment tribunal. Also, whatever you do, definitely do NOT look at the ACAS [Flexible Working Guidance]( or [Flexible Working Code of Practice](","sentiment_label":0}
{"id":"1d1pqka","text":"At least we agree on the important things :)","sentiment_label":1}
{"id":"1bcsw5d","text":"That's prince Andrew right? Why would they photos...... OH I think I understand now","sentiment_label":0}
{"id":"1bfa63i","text":"Just to counteract the gammons on here screaming about how yellow is being inappropriately placed - grey doesn’t equal “full to the brim concrete jungle”. If just one person lives in that 1x1km, it gets a grey spot. We have quite a bit of land left. Calm down.","sentiment_label":0}
{"id":"1ciqmak","text":"no no no no","sentiment_label":0}
{"id":"1d3gl60","text":"No they are not . Look at prisons in places like Philippines then come back and tell me UK prisons are overcrowded.","sentiment_label":0}
{"id":"1c6hvsa","text":"Sarcastic?! Not at all mate, truly. But I hope you you have thick skin after asking a question like that here; I suspect most of it will go over your head though. The weather's been a bit shit today.","sentiment_label":0}
{"id":"1cqw49x","text":"Lol who would guess an unelected fraud would suck as prime minister!!","sentiment_label":0}
{"id":"1bvmp13","text":"That's like saying the Tet Offensive started the Vietnam War.","sentiment_label":0}
{"id":"1bdru52","text":"What a fucking cunt","sentiment_label":0}
{"id":"1byzy64","text":"She’s awesome.","sentiment_label":1}
{"id":"1cbgc15","text":"We're not at all! The streets of the town I live in are lined with the English flag put up by the chamber of commerce on most of the buildings. There will have been plenty of St George's day parades up and down the country yesterday and come Sunday there will be St George's day Sunday parades up and down the country. Most scout\/guide, youth group, cadet group and many schools will have celebrated or will do so this week.\n\nWe are embarrassed about how a tiny minority of overweight, under educated yobs (for the want of a better word) get drunk and wave the flag and shout a lot and think that their display of faux patriotism is real patriotism. Patriotism is about wanting everyone to work together to make your country better for everyone.","sentiment_label":1}
{"id":"1bbbyv0","text":"As someone who would be sharing spaces with them, absolutely not.\n\nThey'd cause mayhem with farming too I suspect.\n\nEveryone who is saying yes likely lives nowhere close to where these packs would be roaming.","sentiment_label":0}
{"id":"1d455oj","text":"Give the guy a break. That's probably the cheapest bag he owns...","sentiment_label":0}
{"id":"1d68acz","text":"Mate, he is not posh in the slightest. \n\nMost of us don’t like the guy but let’s not tell half-truths.","sentiment_label":0}
{"id":"1blwc70","text":"Shameful. What do you mean a country’s flag is offensive? Get over yourself, absolute fucking zero. St George’s cross is the English flag, not this absolute bullshit. Even if it’s only for a football kit, that is not the English bloody flag, and it shouldn’t be on the England football team’s kit. Absolute disgrace, and Im not even a fan of football, more of a rugby girl.","sentiment_label":0}
{"id":"1d4rmlq","text":"This is really about the reputation of the police. \n\nI'd love to be able to assume that the police wouldn't set a dog on someone without good reason.\n\nUnfortunately, that's not an assumption I'm confident making.\n\nI think it's very plausible that a small proportion of police officers would be happy to set a dog on someone in an act of performative revenge. I think it's also plausible that a much larger proportion of police officers - probably most of them - would happily look the other way while that happened. I would expect this to be more likely if the guy had scorned the police officers involved, because they're extremely protective of their own hurt feelings, but that's another issue altogether.\n\nI wish none of this was so. It's a tragedy. But police behaviour in the UK has not been wonderful for a long time and the result is a lack of confidence in their good behaviour.\n\nThe fact that this guy might be an absolute scumbag is irrelevant. It's the job of the courts to pass sentence, not the police. If they're shown to have acted properly, so be it. If not, they should be charged with crimes and imprisoned like anyone else would be, and the fact that they are usually shown to be (to all practical purposes) immune from the criminal law is a large part of the problem.","sentiment_label":0}
{"id":"1d6aqxo","text":"As long as they contain the required imprint then it's not illegal. Arsey, yes. But not actually illegal.","sentiment_label":0}
{"id":"1d39k8g","text":"He won’t…he’d be exposed as a racist crank","sentiment_label":0}
{"id":"1d5or7g","text":"Could it be that the powers that be are promoting the sort of drivel which the likes of Cockpins spews out because it's a convenient distraction from the damage they're actually doing ?  For example, why worry about bird numbers falling due to the effects of pesticides on insect populations, when you can blame it all on 5G ?","sentiment_label":0}
{"id":"1d2vpu1","text":"I got kicked out for saying \"eat the rich\" then I told the slimy, shit eating mod to stick his sub up his arse the snivelling little cunt.\n\nI still smile when I think of his reaction ","sentiment_label":0}
{"id":"1d5x3ph","text":"A fixed wealth tax so in twenty years we all pay it. Why not concentrate on wealth creation? ","sentiment_label":0}
{"id":"1b2xlw6","text":"We did similar things to the natives of America and Canada, even went as far as raping their children (well the catholic brits did). We know the british empire did awful things but us brits in today’s society mostly had nothing to do with colonialism. If you’re really passionate about what happened in Kenya then you’ll probably be better off trying to informing the department for education because none of us here can teach it in school, heck I’m still learning in school","sentiment_label":0}
{"id":"1d5jgvb","text":"It’s the Tory way , sell public utilities to private companies ( school chums and relatives ) .\nThey run them into the ground like all private equity companies and pick every bit of fat off them , oversight over utilities and transport is dismal . Their mates probably run that too , bunch of parasites .","sentiment_label":0}
{"id":"1cxwfhs","text":"It’s one of my biggest fears, losing the functionality of my bowels and I realised that this fear is mostly due to public perception. Hopefully stuff like this goes someways in changing that.","sentiment_label":1}
{"id":"1cb3wu7","text":"No you're wrong. Ukraine invaded Russia. Didn't you know, poor Russia is innocent and it is the Wrst who are war hungry animals","sentiment_label":0}
{"id":"1d3wfv4","text":"> A man who says he falsely confessed to stealing money from his mother's Post Office to protect her from going to prison is waiting to find out whether his conviction will be quashed.\n\nIf this country wants to lead the way in being just and fair, his conviction should be quashed. This story is absolutely harrowing.","sentiment_label":0}
{"id":"1awfvj5","text":"Prick.","sentiment_label":0}
{"id":"1bk8q8i","text":"Yes yes we've heard it all before - if we pave over the entire country we could easily fit infinity migrants!","sentiment_label":0}
{"id":"1bndcm3","text":"Call the police, on a kid with a toy gun? \n\nThis is why we can't get proper response to genuine crimes, because of arse cracks like you wasting peoples time. \n\nI don't agree with what the kids are doing, but ringing the police and hoping for armed response? Get a grip you absolute idiot.","sentiment_label":0}
{"id":"1d5376m","text":"If only more people were like you.","sentiment_label":1}
{"id":"1czickv","text":"BBC Headline: \n\n# \"Net migration to UK fell 10% last year, ONS says\"\n\n  \nDoes anybody else get the feeling they're trying to make us forget that we all thought net migration was too high even when it was in the 300,000s?","sentiment_label":0}
{"id":"1d48dmh","text":"He's....he's already said he's not standing. He's joined Labour as a private member, since he's no longer an MP (there are no MPs while Parliament is dissolved).\n\nSo this is a 2019 intake Tory MP, after having served a 5-year term as MP, saying \"I'm walking away from politics, but also, fuck the Tories\".\n\nThis is another nightmare for Sunak. I'd expect more Tories to defect to Labour while not actually standing in the next election. Labour get the best of both worlds - former Tories coming out saying Labour are the sensible choice, but it's still lifelong Labour supporters who stand in that constituency.\n\nlmao @ the Tory Party. They instructed their client press to go full throttle on Dianne Abbott, and then barely a day later, another Tory MP defects to Labour and THAT is now national news.\n\nGive it a week and people will forget who Dianne Abbott is.","sentiment_label":0}
{"id":"1d5qeuo","text":"It captures his personality perfectly.","sentiment_label":1}
{"id":"1cfwkbf","text":"Fuck it we don’t need human rights, just don’t be disabled","sentiment_label":0}
{"id":"1d3i3mt","text":"That's embarassing for the nob who kept posting memes against her.","sentiment_label":0}
{"id":"1cbusni","text":"Snore","sentiment_label":0}
{"id":"1d57y5r","text":"Nothing. It's great having one and I haven't got a care in the world about using it.","sentiment_label":1}
{"id":"1d569vw","text":"A gay woman is stabbed to death & another woman seriously injured, & the attacker is called Nasen Saadi. Honestly, the chance that it was a random attack because they're 'women' & that is all there is to this is hard for me to believe. \n\nBut that's for the police & courts to prove.","sentiment_label":0}
{"id":"1cvwflz","text":"Because of all the rain interspersed with decent sunshine our garden looks, feels and sounds like the bountiful garden of Eden, it's wondrous, deffinately makes the wet winter worth struggling through.","sentiment_label":1}
{"id":"1cb3vk3","text":"Ok, regardless of Femi's theory here, England categorically does *not* deserve a day off for St. Georges day and this is why:\n\nPart of Jeremy Corbyn's manifesto in 2017 was explicitly to give the UK 4 additional bank Holidays, one for each nations patron saint.\n\nNow, whatever your opinion on corbyn's various other policies, to my mind refusing to vote for 4 extra days off is the stupidest decision ever. Ergo, no, we don't deserve that day.","sentiment_label":0}
{"id":"1d5maxb","text":"perfect, now we just need to get more people motivated to join the armed forces and make it a fulfilling career and something that people can take long learned skills back to civilian life.\n\nand.... it doesn't involve the Tories conscripting teenagers.\n\nI recently watched Amazon's Blue Angels series and was just blown away with the support of the US military. America i think has learned alot from their recent past wars and starting to really support members of their armed forces.","sentiment_label":1}
{"id":"1boli15","text":"Being pro immigration control has to stop being considered a racist position. I've always said it's a working class issue, not a race issue. It's an employment and housing issue. It's blindingly obvious. Immigration has benefited the nation over the last 60 years on the whole I'd say. But what the fk has happened over the last 10 years?","sentiment_label":0}
{"id":"1cdkst6","text":"Holocaust didn't teach them anything","sentiment_label":0}
{"id":"1cmdx4t","text":"Of those two pictures I'd say the top one is far more representative of the \"real England\" that people actually experience day to day then the bottom one of Castle Coombe where a 3 bed semi will set you back nearly £700k and everyone who lives there has had a very different life experience from the average England dweller.\n\nAlso, that bottom photo has had a lot of processing to make it look far more idyllic than it really does.","sentiment_label":0}
{"id":"1d3gxc7","text":"Those poor children - no chance with a family like that.","sentiment_label":0}
{"id":"1d646l7","text":"Arent U.K. Republicans more concerned with the continued tenure of Charles Windsor as head of state?","sentiment_label":0}
{"id":"1cnn7zk","text":"\"Government is letting them\"- the government is DOING this you bozo","sentiment_label":0}
{"id":"1cvmaaz","text":"Everyone would love to be related to royalty. Only the wealthy kept family trees\/heraldry. In the UK Civil Registration wasn't compulsory until 1837. So for me I'm always happy finding ancestors that were born before 1800, as they didn't have to keep any record. So my wife's family are old blood Londoners and I found out that one of them lived 2 doors down from where Jack the Ripper killed his 2nd victim. So finding things like that trumps some crusty lords life.","sentiment_label":0}
{"id":"1d4pv4f","text":"Cancelling HS2 has been one of the most stupidest decisions this country has made in recent times.","sentiment_label":0}
{"id":"1c5ezyp","text":"Y'all I never paid any attention to politics, I don't give a single fuck about it. Who is this?","sentiment_label":0}
{"id":"1d5r159","text":"And there's no way someone non-white or socialist\/left have these facts conveniently ignored by our media.  \n  \nThe headline would be so different.","sentiment_label":0}
{"id":"1cbxn9t","text":"Just sounds like you're either inexperienced or have got bad balance","sentiment_label":0}
{"id":"1bn9s9s","text":"Anecdotal experience: in the UK you’re paying out the nose for a tiny miners place, which is often covered in mold, vs other countries I’ve spent time in where you can have a house with a two car garage and even a pool, for a reasonable amount","sentiment_label":0}
{"id":"1ctyga5","text":"What a difficult take on what they would have thought was a little raunchy weekend. That’s so bloody difficult to comprehend. Sex workshops (I don’t know like a meeting or something) could help spread the word on safe practices. \n\nCondolences to them and their family, that’s a sad read.","sentiment_label":0}
{"id":"1bmlgoe","text":"Alot of the guys who were known bullies at my school now doing time. Don't know anyone who would meet that criteria who has done remotely well.","sentiment_label":0}
{"id":"1avil8p","text":"Is he out of mind, where are the ethics or values in the Israeli army thoughtlessly killing innocent Palestinian children.","sentiment_label":0}
{"id":"1d2ua2s","text":"Given their odds they can promise everyone gets a bugatti and a blowjob. They can't deliver it nor will they be in a position to. They can just say they promised it and point the finger when reality sets in.","sentiment_label":0}
{"id":"1cuktsy","text":"Yeah this is something that confuses me about people here. I love travelling around the UK and have done so since very young. It’s a surprisingly diverse country and has so much to offer. We travel to Japan for ancient culture and gardens and we travel to Australia for cliffy beaches but we have both of those things at home","sentiment_label":1}
{"id":"1bndcm3","text":"Someone is funding all of this and it isn't those children.  Disgusts me as they have the potential to end up with criminal records whilst the racist fuck knuckles who taught these children to be this way are hiding away. No child is born racist. So much for land of the free.","sentiment_label":0}
{"id":"1boxsgn","text":"Protest harder, go to water companies with a large group of men and women, demand they stop or they will be run out of the county through any means necessary. They’re killing our rivers, our ecosystem, the very thing that keeps us alive. Retaliate","sentiment_label":0}
{"id":"1d3hdw7","text":"Next election in my country is in 2 years and israeli government don't give a f*** of what my politicians will Say. The only one who can do something is Joe Biden.","sentiment_label":0}
{"id":"1d4dgk9","text":"Letting criminals die is not senseless. They will allow us to starve out here by making minimum wage too low and cost of living too high but I should care if some drug dealing heroin slinger who ruined the countless lives of others is starving to death or uncomfortable?","sentiment_label":0}
{"id":"1ch1318","text":"Its hilarious that Ireland now wants the UK to police the flow of migrants across the non existent border that they insisted didn't exist. \n\nGo do one !\n\nIf Ireland don't want to become a refugee camp, then send them back to France on those ferries the EU promised Ireland to get around the EU no deal Brexit blockade which Ireland supported.","sentiment_label":0}
{"id":"1bqtyti","text":"This woman is pure evil. If there’s any justice in this world she should end up behind bars. My fear is that she is being protected by numerous Prime Minister and Civil Servants. This has been going on since Blair was PM.","sentiment_label":0}
{"id":"1b5iodf","text":"How is this a non-story? A shop will bow to the whims of an off duty police officer in restricting people buying basic products in case they might be used for a protest. This is actual fascism.","sentiment_label":0}
{"id":"1cv6iym","text":"The smoke screen is real, and Suella (along with the host) tried very hard to distract the points the student was making. Shit channel.","sentiment_label":0}
{"id":"1c9kjse","text":"It's a really serious problem that young white people are being taught to hate their own countries, people, history and culture and this is not hyperbole to any degree, it's literally true and it will manifest in all sorts of ways down the road.","sentiment_label":0}
{"id":"1b22zae","text":"Good luck. Imagine if you refuse to see a PA because you didnt trust them to be able to feel a lump or do a routine blood test then wait several months to see a GP *trainee","sentiment_label":0}
{"id":"1d3zv41","text":"So first thing you're going to do is to fix the chronic pay issue in public services so you can actually recruit more policemen \/ firefighters \/ doctors \/ nurses right?\n\nRight?","sentiment_label":0}
